<!-- $Revision: 1.1 $ -->
 <chapter id="faq.mailinglist">
  <title>Posta Listeleri</title>
  <titleabbrev>Posta Listeleri</titleabbrev>

   <para>
    Bu bölümden PHP toplulu&eth;u ile nas&yacute;l ileti&thorn;im kurabilece&eth;inizi ö&eth;renebilirsiniz : En iyi yol posta listeleridir.
   </para>

  <qandaset>
   <qandaentry id="faq.mailinglist.isthere">
    <question>
     <para>Bir PHP posta listesi mevcut mu?</para>
    </question>
    <answer>
     <para>
      Elbette! Üye olmak için, 
      <ulink url="mailto:&faqmail.ml.general.subscribe;">&faqmail.ml.general.subscribe;</ulink>
      adresine bo&thorn; bir e-posta göndermeniz yeterlidir.
     </para>
     <para>
      Listeden ç&yacute;kmak için, 
      <ulink url="mailto:&faqmail.ml.general.unsubscribe;">&faqmail.ml.general.unsubscribe;</ulink>
      adresini kullanabilirsiniz.
      <literal>php-general-unsubscribe@lists.php.net</literal>.
     </para>
    </answer>
   </qandaentry>

   <qandaentry id="faq.mailinglist.subscribing">
    <question>
     <para>Yard&yacute;m! Posta listesine üye olam&yacute;yorum - listeden ç&yacute;kam&yacute;yorum!
     </para>
    </question>
    <answer>
     <para>
      Posta listesine üye olmakta - üyelikten ç&yacute;kmakta problem ya&thorn;&yacute;yorsan&yacute;z,
      posta listesi uygulamas&yacute; hangi e-posta adresinin üye olmak istedi&eth;ini bulam&yacute;yor olabilir.
      Bu durumda posta adresiniz <literal>joeblow@example.com</literal> ise, kaydolmak için
      <literal>php-general-subscribe-joeblow=example.com@lists.php.net</literal> adresine bo&thorn; bir posta gönderebilir,
      ya da listeden ç&yacute;kmak için
      <literal>php-general-unsubscribe-joeblow=example.com@lists.php.net</literal> adresini kullanabilirsiniz.
     </para>
    </answer>
   </qandaentry>

   <qandaentry id="faq.mailinglist.archive">
    <question>
     <para>Posta listesi için bir ar&thorn;iv mevcut mu?</para>
    </question>
    <answer>
     <para>
       Evet,<ulink url="&faqurl.php.support;">Support</ulink> adresinden posta listelerini toplu halde bulabilirsiniz.
     </para>
    </answer>
   </qandaentry>
  
   <qandaentry id="faq.mailinglist.question">
    <question>
     <para>Posta listesine ne sorabilirim?</para>
    </question>
    <answer>
     <para>
       PHP her geçen gün daha popüler hale geliyor ve bunun sonucu olarak
       PHP posta listesinin trafi&eth;i günde 150 ila 200 iletiye dayanm&yacute;&thorn; durumda.
       Bu nedenle bu posta listesini arad&yacute;&eth;&yacute;n&yacute;z sorunun cevab&yacute;n&yacute; di&eth;er bildi&eth;iniz
       kaynaklar&yacute; inceledikten sonra son çare olarak kullanmal&yacute;s&yacute;n&yacute;z.
     </para>
     <para>
      Bu listeye bir ileti göndermeden önce lütfen önce SSS bölümüne sonra da
      kullan&yacute;m k&yacute;lavuzuna bak&yacute;p sorunuzun cevab&yacute;n&yacute;n orada olmad&yacute;&eth;&yacute;ndan emin olun.
      Bu ikiliden bir sonuç alamazsan&yacute;z, posta listesinin ar&thorn;ivlerini deneyin.
      PHP'nin kurulumu ya da konfigürasyonu ile ilgili bir probleminiz varsa lütfen
      da&eth;&yacute;t&yacute;mla birlikte gelen README dosyalar&yacute;n&yacute; okuyun. Bütün bunlardan sonra
      sorunuzun cevab&yacute;n&yacute; hala alamam&yacute;&thorn;san&yacute;z posta listemizin kap&yacute;lar&yacute; size ard&yacute;na kadar aç&yacute;k olacakt&yacute;r.
     </para>
    </answer>
   </qandaentry>
   
   <qandaentry id="faq.mailinglist.guideline">
    <question>
     <para>Bir ileti gönderirken hangi bilgileri eklemey dikkat etmeliyim?</para>
    </question>
    <answer>
     <para>
      "PHP'yi çal&yacute;&thorn;t&yacute;ram&yacute;yorum! Yard&yacute;m edin! Hata nerede?" tarz&yacute; sorulara
      bir cevap alamayaca&eth;&yacute;n&yacute;z kesindir. PHP'yi çal&yacute;&thorn;t&yacute;rmakta problem ya&thorn;&yacute;yorsan&yacute;z,
      hangi i&thorn;letim sistemini kulland&yacute;&eth;&yacute;n&yacute;z&yacute;, hangi PHP sürümünü kurmaya çal&yacute;&thorn;t&yacute;&eth;&yacute;n&yacute;z&yacute;,
      nas&yacute;l elde etti&eth;inizi (derlenmi&thorn;, CVS, RPM ve di&eth;erleri), &thorn;imdiye kadar neler yapt&yacute;&eth;&yacute;n&yacute;z&yacute;,
      nerede hata ald&yacute;&eth;&yacute;n&yacute;z&yacute; ve hatan&yacute;n tam olarak ne oldu&eth;unu eklemeniz gerekir.
     </para>
     <para>
      Bu tan&yacute;mlama genel olarak di&eth;er sorunlar&yacute; da kapsar. Ne yapt&yacute;&eth;&yacute;n&yacute;z, nerede tak&yacute;ld&yacute;&eth;&yacute;n&yacute;z,
      ne yapmak istedi&eth;iniz, ve varsa, hata mesaj&yacute;n&yacute;n tamam&yacute;n&yacute; iletinize eklemeniz gerekir.
      Kaynak kodunuzla ilgili problem varsa, kodun çal&yacute;&thorn;mayan k&yacute;sm&yacute;n&yacute; da eklemelisiniz.
      Gerekli olandan fazlas&yacute;n&yacute; eklememeye dikkat edin! Gerekli olandan fazlas&yacute; yaln&yacute;zca kodun
      okunmas&yacute;n&yacute; zorla&thorn;t&yacute;r&yacute;r ve birçok ki&thorn;inin iletinizi okumadan geçmesine neden olur.
      E&eth;er ne eklemeniz gerekti&eth;inden emin de&eth;ilseniz, daha çok bilgi vermenin daha az vermekten
      daha iyi olaca&eth;&yacute;n&yacute; bilmelisiniz.
     </para>
     <para>
      Bir ba&thorn;ka önemli bilgi probleminizi iletinin konu bölümünde özetlemeniz gerekti&eth;idir.
      "YARDIM ED&Yacute;&Yacute;&Yacute;&Yacute;&Yacute;&Yacute;&Yacute;&Yacute;N!!!" ya da "Buradaki problem nedir?" tarz&yacute;ndaki ba&thorn;l&yacute;klar okuyucular&yacute;n
      büyük bir k&yacute;sm&yacute; taraf&yacute;ndan gözard&yacute; edilecektir.
     </para>
    </answer>
   </qandaentry>
  </qandaset>
 </chapter>

 <!-- Keep this comment at the end of the file
 Local variables:
 mode: sgml
 sgml-omittag:t
 sgml-shorttag:t
 sgml-minimize-attributes:nil
 sgml-always-quote-attributes:t
 sgml-indent-step:1
 sgml-indent-data:t
 sgml-parent-document:nil
 sgml-default-dtd-file:"../../manual.ced"
 sgml-exposed-tags:nil
 sgml-local-catalogs:nil
 sgml-local-ecat-files:nil
 End:
 -->
