<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.1.1.1 $ -->
 <chapter id="introduction">
  <title>Giri&scedil;</title>

  <sect1 id="intro-whatis">
   <title>PHP Nedir?</title>
   <para>
   PHP ("PHP: Hypertext Preprocessor" için k&inodot;salt&inodot;lm&inodot;&scedil; haldir)
   HTML içine gömülebilir, sunucu tarafl&inodot;, aç&inodot;k kod lisans&inodot;yla da&gbreve;&inodot;t&inodot;lan bir programlama dilidir.
   </para>
   <para>
   Basit bir cevap, ama tam olarak söylenmek istenen nedir? Bir örnek:
   </para>
   <para>
    <example>
     <title>Giri&scedil; Örne&gbreve;i</title>
     <programlisting role="php">
<![CDATA[
<html>
    <head>
        <title>Örnek</title>
    </head>
    <body>

        <?php 
        echo "Merhaba, ben bir PHP program&inodot;y&inodot;m!"; 
        ?>

    </body>
</html>
]]>
     </programlisting>
    </example>
   </para>
   <para>
   Bir PHP program&inodot;n&inodot;n (scriptinin) Perl ya da C gibi dillerden ne kadar farkl&inodot;
   bir yap&inodot;da oldu&gbreve;una dikkat edin. HTML kodu yaratmak için bir sürü kod yazaca&gbreve;&inodot;n&inodot;za,
   istedi&gbreve;iniz i&scedil;i yapan bir gömülü koda sahip HTML yaz&inodot;yorsunuz (bu örnekte, yap&inodot;lan i&scedil;
   ekrana yaz&inodot; yazmak). PHP kodu özel <link
    linkend="language.basic-syntax.phpmode">ba&scedil;lang&inodot;ç ve biti&scedil; etiketleri</link>
    aras&inodot;na yaz&inodot;l&inodot;r. Bu etiketler "PHP moduna" girip ç&inodot;kabilmenizi sa&gbreve;larlar.
   </para>
   <para>
   PHP'yi Javascript gibi kullan&inodot;c&inodot; taraf&inodot;nda çal&inodot;&scedil;an dillerden ay&inodot;ran, sunucu taraf&inodot;nda
   çal&inodot;&scedil;t&inodot;r&inodot;l&inodot;yor olmas&inodot;d&inodot;r. Yukardaki örnekteki kodu kendi sunucunuzda çal&inodot;&scedil;t&inodot;r&inodot;rsan&inodot;z,
   sitenize ba&gbreve;lanan kullan&inodot;c&inodot;lar kodu göremeyecekler ve müdahale edemeyecekler,
   yaln&inodot;zca sonucu görebileceklerdir. Dilerseniz web sunucunuzu bütün HTML dosyalar&inodot;n&inodot;z&inodot;
   PHP dosyas&inodot; kabul edip i&scedil;leyecek hale bile getirebilirsiniz. Buna ra&gbreve;men kullan&inodot;c&inodot;lar sizin
   gerçekte sunucu tarafl&inodot; bir uygulama kulland&inodot;&gbreve;&inodot;n&inodot;z&inodot; fark edemeyebilirler.
   </para>
   <para>
   PHP kullanman&inodot;n en güzel yanlar&inodot;ndan biri, yeni kullan&inodot;c&inodot;lar için oldukça kolay olmas&inodot; ve
   ayn&inodot; zamanda profesyonel kullan&inodot;c&inodot;lar için ileri seviyede özellikler içermesidir. PHP'nin
   uzun özellikler listesini okumaktan korkmay&inodot;n. K&inodot;sa sürede PHP ile programlamaya
   ba&scedil;layabilir ve birkaç saat içersinde basit programlar yazmaya ba&scedil;layabilirsiniz.
   </para>
   <para>
   PHP'nin geli&scedil;imi sunucu-tarafl&inodot; programlamaya odaklanm&inodot;&scedil;sa da, çok daha fazlas&inodot;n&inodot; yapman&inodot;za
   olanak tan&inodot;yan araçlara da sahiptir. <link linkend="intro-whatcando">PHP neler yapabilir?</link>
   bölümünden bu araçlar hakk&inodot;nda daha fazla bilgiye ula&scedil;abilirsiniz.
   </para>
  </sect1>

  <sect1 id="intro-whatcando">
   <title>PHP neler yapabilir?</title>
   <para>
   Her &scedil;eyi. PHP temel olarak sunucu-tarafl&inodot; programlamaya odaklanm&inodot;&scedil;t&inodot;r, bu nedenle CG&Idot; uygulamalar&inodot;n&inodot;n
   yapt&inodot;&gbreve;&inodot; her &scedil;eyi, örne&gbreve;in formdan veri toplama, dinamik sayfa içeri&gbreve;i yaratma, ya da çerez al&inodot;p gönderme i&scedil;lemlerini
   yapabilirsiniz. Ama PHP çok daha fazlas&inodot;n&inodot; yapabilir.
   </para>
   <para>
   PHP programlar&inodot;n&inodot;n kullan&inodot;ld&inodot;&gbreve;&inodot; üç temel alan vard&inodot;r.
    <itemizedlist>
     <listitem>
      <simpara>
      Sunucu-tarafl&inodot; programlama. Bu PHP için en geleneksel ve en temel aland&inodot;r. Sunucu-tarafl&inodot; programlama için üç
      &scedil;eye sahip olman&inodot;z gerekir. PHP motoru (CG&Idot; ya da sunucu modülü), bir web sunucu ve bir web taray&inodot;c&inodot;s&inodot;. Web sunucusunu
      PHP'den anlar &scedil;ekilde kurman&inodot;z ve çal&inodot;&scedil;t&inodot;rman&inodot;z gerekir. PHP uygulamas&inodot;n&inodot;n ç&inodot;kt&inodot;s&inodot;na web taray&inodot;c&inodot;s&inodot; üzerinden eri&scedil;ebilirsiniz.
      <link linkend="installation">kurulum bilgileri</link> bölümünden bununla ilgili daha fazla bilgiye ula&scedil;abilirsiniz.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
      Komut sat&inodot;r&inodot; uygulamalar&inodot;. Bir PHP uygulamas&inodot;n&inodot; komut sat&inodot;r&inodot;ndan hiçbir sunucu ya da taray&inodot;c&inodot; kullanmadan çal&inodot;&scedil;t&inodot;rabilirsiniz.
      Burada tek ihtiyac&inodot;n&inodot;z olan PHP motorudur. Bu tip kullan&inodot;m cron üzerinden (Windows e&scedil;de&gbreve;eri görev yöneticisi) düzenli çal&inodot;&scedil;t&inodot;r&inodot;lan
      i&scedil;lemler ya da basit yaz&inodot; i&scedil;lem görevleri için idealdir. <link linkend="commandline">PHP'nin komut sat&inodot;r&inodot;nda kullan&inodot;m&inodot;</link> bölümünden
      daha detayl&inodot; bilgiye ula&scedil;man&inodot;z mümkün.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
      Kullan&inodot;c&inodot; taraf&inodot;nda çal&inodot;&scedil;an grafik arayüze sahip uygulamalar. PHP için görsel uygulamalar&inodot;n yaz&inodot;labilece&gbreve;i en iyi dil diyemeyiz, ancak PHP'yi
      iyi biliyorsan&inodot;z ve PHP'nin birtak&inodot;m ileri seviye özelliklerini kendi kullan&inodot;c&inodot; tarafl&inodot; uygulamalar&inodot;n&inodot;zda kullanmak istiyorsan&inodot;z, PHP-GTK eklentisini
      bu tip programlar yazmak için kullanabilirsiniz. Bu &scedil;ekilde ayn&inodot; zamanda platformdan ba&gbreve;&inodot;ms&inodot;z uygulamalar yazma &scedil;ans&inodot;na da sahip oluyorsunuz.
      PHP-GTK, PHP için bir eklentidir ve ana da&gbreve;&inodot;t&inodot;mda yer alm&inodot;yor. PHP-GTK ilginizi çektiyse, <ulink url="&url.php.gtk;">kendi web sitesini</ulink>
      ziyaret edebilirsiniz.
      </simpara>
     </listitem>
    </itemizedlist>
   </para>
   <para>
   PHP bütün büyük i&scedil;letim sistemlerinde, Linux, birçok Unix türevi (HP-UX, Solaris, OpenBSD vb.),
   Microsoft Windows, Mac OS X, R&Idot;SC OS dahil olmak üzere çe&scedil;itli platformlarda çal&inodot;&scedil;abilir.
   PHP ayn&inodot; &scedil;ekilde bugün yayg&inodot;n biçimde kullan&inodot;lan web sunucular&inodot;n&inodot;n büyük k&inodot;sm&inodot;n&inodot; destekler. Bunlara
   örnek olarak Apache, Microsoft &Idot;&Idot;S, Microsoft PWS, Netscape ve iPlanet Sunucular&inodot;, Oreilly Website Pro,
   Caudium, Xitami, OmniHTTPD ve daha birçok sunucu say&inodot;labilir. Bu sunucular&inodot;n ço&gbreve;unlu&gbreve;unda PHP
   modül olarak kullan&inodot;labilir, geri kalanlar&inodot;nda da CG&Idot; standard&inodot; üzerinden PHP çal&inodot;&scedil;t&inodot;r&inodot;labilir.
   </para>
   <para>
   Sonuç olarak, PHP ile i&scedil;letim sistemi ve web sunucusu seçme özgürlü&gbreve;üne sahipsiniz. Dahas&inodot;, hangi programlama
   yöntemini kullanaca&gbreve;&inodot;n&inodot;z&inodot;, fonksiyonel yakla&scedil;&inodot;m&inodot; m&inodot; yoksa nesne yönelimli yakla&scedil;&inodot;m&inodot; m&inodot; yoksa her ikisini birden mi
   kullanaca&gbreve;&inodot;n&inodot;za karar verebilirsiniz. Bütün OOP (nesne yönelimli programlama) özellikleri PHP'nin &scedil;u andaki sürümünde
   varolmasa da, birçok kod kütüphanesi ve büyük uygulama (<link linkend="pear">PEAR kütüphanesi</link> dahil) OOP
   kullan&inodot;larak yaz&inodot;lm&inodot;&scedil;t&inodot;r.
   </para>
   <para>
   PHP yaln&inodot;zca HTML ç&inodot;kt&inodot; üretmekle s&inodot;n&inodot;rl&inodot; de&gbreve;ildir. PHP'nin kabiliyetleri aras&inodot;nda resim ç&inodot;kt&inodot;s&inodot; üretebilme, PDF olu&scedil;turabilme
   ve hatta Flash filmleri yaratabilme (libswf ve Ming kullanarak) vard&inodot;r. Ayn&inodot; &scedil;ekilde XHTML ya da XML gibi her tür yaz&inodot; içeren
   dosyay&inodot; yaratabilmeniz mümkün. PHP bu dosyalar&inodot; otomatik olarak yaratabilir ve ekrana yazd&inodot;rmak haricinde
   sizin için dosya sisteminde saklayabilir, böylece dinamik içeri&gbreve;iniz için sunucu-tarafl&inodot; bir depo sistemini kullan&inodot;m&inodot;n&inodot;za sunabilir.
   </para>
   <para>
   PHP'nin en güçlü ve en çok üstünde durulan özelliklerinden biri, sahip oldu&gbreve;u geni&scedil; ve geli&scedil;mi&scedil; veritaban&inodot; deste&gbreve;idir. PHP ile
   veritaban&inodot; ba&gbreve;lant&inodot;l&inodot; web sayfalar&inodot; yaratmak son derece basittir. A&scedil;a&gbreve;&inodot;da desteklenen veritabanlar&inodot;n&inodot;n bir listesi bulunuyor:
    <blockquote>
     <simplelist columns="3">
      <member>Adabas D</member>
      <member>dBase</member>
      <member>Empress</member>
      <member>FilePro (salt-okunur)</member>
      <member>Hyperwave</member>
      <member>&Idot;BM DB2</member>
      <member>&Idot;nformix</member>
      <member>&Idot;ngres</member>
      <member>&Idot;nterBase</member>
      <member>FrontBase</member>
      <member>mSQL</member>
      <member>Direct MS-SQL</member>
      <member>MySQL</member>
      <member>ODBC</member>
      <member>Oracle (OC&Idot;7 ve OC&Idot;8)</member>
      <member>Ovrimos</member>
      <member>PostgreSQL</member>
      <member>Solid</member>
      <member>Sybase</member>
      <member>Velocis</member>
      <member>Unix dbm</member>
     </simplelist>
    </blockquote>
    Bunlar&inodot;n haricinde DBX ad&inodot; verilen uzant&inodot; ile farkl&inodot; veritabanlar&inodot; için
    ayn&inodot; kodu kullanarak kodlama yapabilirsiniz. Ek olarak PHP ODBC'yi,
    Aç&inodot;k Veritaban&inodot; Ba&gbreve;lant&inodot; standard&inodot;n&inodot; destekler, bu &scedil;ekilde ODBC'yi destekleyen
    bütün veritabanlar&inodot; ile ileti&scedil;im kurabilirsiniz.
   </para>
   <para>
   PHP farkl&inodot; hizmetlerle LDAP, &Idot;MAP, SNMP, NNTP, POP3, HTTP, COM (Windows için)
   ve daha say&inodot;s&inodot;z protokol arac&inodot;l&inodot;&gbreve;&inodot;yla konu&scedil;abilecek bir altyap&inodot;ya da sahiptir. Haz&inodot;r modüllerin
   haricinde ham a&gbreve; soketleri aç&inodot;p bu soketler üzerinden istedi&gbreve;iniz bütün protokollerle çal&inodot;&scedil;abilirsiniz.
   PHP, WDDX üzerinden sanal olarak web üzerinde hangi dilde yaz&inodot;lm&inodot;&scedil; olursa olsun bütün uygulamalarla
   haberle&scedil;ebilir. Ayr&inodot;ca Java nesnelerinin yarat&inodot;lmas&inodot; ve transparan olarak PHP nesneleri olarak kullan&inodot;labilmeleri
   önemli bir özelli&gbreve;idir. Uzaktaki nesnelere eri&scedil;im için CORBA uzant&inodot;s&inodot;, yine PHP özellikleri aras&inodot;ndad&inodot;r.
   </para>
   <para>
   PHP oldukça faydal&inodot; doküman i&scedil;leme özelliklerine sahiptir. Bu yelpaze Geni&scedil;letilmi&scedil; POS&Idot;X ya da Perl regular expressions komutlar&inodot;ndan
   XML dosyalar&inodot;n&inodot; okumaya kadar uzan&inodot;r. XML dosyalar&inodot;n&inodot;n okunmas&inodot; ve eri&scedil;imi için SAX ve DOM standartlar&inodot;n&inodot; destekler. XSLT
   uzant&inodot;s&inodot; ile XML dokümanlar&inodot;n&inodot;n biçimlendirilmesi yap&inodot;labilir.
   </para>
   <para>
   E-ticaret alan&inodot;nda PHP'yi kullanacaklar için Cybercash ödeme sistemi, CyberMUT, Verysign Payflow Pro
   ile ileti&scedil;im için gerekli uzant&inodot;lar ve CCVS fonksiyonlar&inodot; haz&inodot;r halde gelmektedir. Bu &scedil;ekilde online ödeme
   i&scedil;lemleri yapmak kolayla&scedil;t&inodot;r&inodot;lm&inodot;&scedil;t&inodot;r.
   </para>
   <para>
   Bunlar&inodot;n d&inodot;&scedil;&inodot;nda, mnoGoSearch arama motoru, &Idot;RC A&gbreve; geçidi uzant&inodot;lar&inodot;, birçok s&inodot;k&inodot;&scedil;t&inodot;rma arac&inodot; (gzip, bz2) için fonksiyon , takvim i&scedil;lemleri,
   çeviri fonksiyonlar&inodot; yine PHP'nin di&gbreve;er birçok uzant&inodot;s&inodot; aras&inodot;ndad&inodot;r.
   </para>
   <para>
   Sizin de görebildi&gbreve;iniz gibi bu sayfa PHP'nin sunabilece&gbreve;i bütün özellikleri ve faydalar&inodot; anlatmak için yeterli de&gbreve;il. <link linkend="installation">PHP kurulumu</link>
   bölümünde ve <link linkend="funcref">fonksiyonlar</link> adresinde listelenen uzant&inodot;lar&inodot;n ba&scedil;lang&inodot;ç bölümlerindeki aç&inodot;klamalardan her bir uzant&inodot; için
   daha fazla bilgiye ula&scedil;man&inodot;z mümkün.
   </para>
  </sect1>

  <sect1 id="intro-history">
   <title>PHP'nin Tarihçesi</title>
   <simpara>
   PHP 1994 ekiminde &link.rasmus; taraf&inodot;ndan planland&inodot;.
   Rasmus da&gbreve;&inodot;t&inodot;m&inodot;n&inodot; yapmad&inodot;&gbreve;&inodot; ilk sürümü kendi sitesinde online CV'sini okuyanlar&inodot;n say&inodot;s&inodot;n&inodot; takip için kulland&inodot;.
   Sonraki sürüm 1995 y&inodot;l&inodot;n&inodot;n ba&scedil;lar&inodot;nda ba&scedil;ka kullan&inodot;c&inodot;larla bulu&scedil;tu ve Personal Home Page Tools
   ad&inodot;n&inodot; ald&inodot;. Mant&inodot;&gbreve;&inodot; çok basit bir okuyucu motora dayanan bu sürüm yaln&inodot;zca basit baz&inodot; makrolar&inodot;
   ve ki&scedil;isel sayfalarda kullan&inodot;m&inodot; kolayla&scedil;t&inodot;racak, ziyaretçi defteri, sayaç ve benzer basit birkaç arac&inodot; içeriyordu. 
   Program 1995 y&inodot;l&inodot; ortalar&inodot;nda ba&scedil;tan yaz&inodot;ld&inodot; ve PHP/F&Idot; Sürüm 2 ismini ald&inodot;. F&Idot; ismi Rasmus taraf&inodot;ndan yaz&inodot;lm&inodot;&scedil;
   ve html form verisini yorumlayan ba&scedil;ka bir uygulamadan geliyordu. Personal Home Page araçlar&inodot; ile Form &Idot;nterpreter
   uygulamas&inodot;n&inodot; birle&scedil;tirip bunlara mSQL deste&gbreve;ini ekledi&gbreve;inde, PHP/F&Idot; de do&gbreve;mu&scedil; oldu. PHP/F&Idot; da&gbreve;&inodot;t&inodot;m&inodot;na ba&scedil;lanmas&inodot;ndan
   itibaren inan&inodot;lmaz bir h&inodot;zla büyüyüp geli&scedil;ti ve ba&scedil;ka insanlar taraf&inodot;ndan program&inodot;n geli&scedil;imine katk&inodot;lar gelmeye ba&scedil;lad&inodot;.
   </simpara>
   <simpara>
   Kesin bir istatistik sunmak zor, ama 1996 y&inodot;l&inodot;n&inodot;n sonlar&inodot;na gelindi&gbreve;inde PHP/F&Idot; kullanan sitelerin say&inodot;s&inodot; 15,000 civar&inodot;ndayd&inodot;.
   1997 ortalar&inodot;nda bu say&inodot; 50,000'e ula&scedil;t&inodot;. 1997 y&inodot;l&inodot; ortas&inodot; ayn&inodot; zamanda PHP için yeni bir de&gbreve;i&scedil;imin ba&scedil;lang&inodot;c&inodot; oldu. Rasmus
   projenin tek sahibi olmaktan ç&inodot;kt&inodot; ve geli&scedil;tirme süreci bir ekiple devam etti. Program Zeev Suraski ve Andi Gutmans taraf&inodot;ndan
   s&inodot;f&inodot;ndan yaz&inodot;lmaya ba&scedil;land&inodot; ve PHP Sürüm 3 halini ald&inodot;. PHP/F&Idot; üzerinden birçok araç yeni sürüme eklendi, birçok araç da yeniden
   yaz&inodot;ld&inodot;.
   </simpara>
   <simpara>
   Son sürüm (PHP 4) daha yüksek performans için optimize edilmi&scedil; <ulink url="&url.zend;">Zend</ulink> motorunu kullan&inodot;yor.
   Bu motor üçüncü-taraf kütüphanelere ve uzant&inodot;lara çok daha aç&inodot;k, ve sunucuya özel modda çal&inodot;&scedil;abilen bir yap&inodot;ya sahip.
   </simpara>
   <simpara>
   Bugün itibariyle (1/2001) PHP 3 ve PHP 4 Red Hat Stronghold Web Sunucusu gibi ticari ürünlerle beraber da&gbreve;&inodot;t&inodot;l&inodot;yor.
   <ulink url="&url.netcraft;">Netcraft</ulink>
    (ayr&inodot;ca bak&inodot;n <ulink url="&url.netcraft-survey;">Netcraft Web Sunucu Ýncelemesi</ulink>)
    taraf&inodot;ndan yap&inodot;lan muhafazakar ara&scedil;t&inodot;rma sonuçlar&inodot;na göre PHP dünyada 5,100,000 sitede kullan&inodot;l&inodot;yor. Ba&scedil;ka bir aç&inodot;dan bu rakam,
    Microsoft &Idot;&Idot;S Sunucusunun &Idot;nternet üzerindeki bütün varl&inodot;&gbreve;&inodot;ndan (5.03 milyon) daha yüksek bir de&gbreve;er.
   </simpara>
<!--
   <figure>
    <title>NetCraft Web Sunucu Ýncelemesi</title>
    <graphic fileref="&url.php.stats;"/>
   </figure>
-->
  </sect1>

 </chapter>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
