<?xml version="1.0" encoding="iso-8859-9"?>
<!-- $Revision: 1.8 $ -->
 <chapter id="installation">
  <title>Kurulum</title>

  <sect1 id="install.general">
   <title>Genel Kurulum Tercihleri</title>
   <para>
   Kuruluma ba&scedil;lamadan önce, PHP'yi ne amaçla kullanmak istedi&gbreve;inizi
   kesinle&scedil;tirmelisiniz. PHP'yi kullanabilece&gbreve;iniz üç temel alan vard&inodot;r. Bu alanlar
   <link linkend="intro-whatcando">PHP ne yapabilir?</link> bölümünde
   tan&inodot;mlanm&inodot;&scedil;t&inodot;r:
    <itemizedlist>
     <listitem><simpara>Sunucu-tarafl&inodot; programlama</simpara></listitem>
     <listitem><simpara>Komut sat&inodot;r&inodot; programlama</simpara></listitem>
     <listitem><simpara>Grafik arayüzlü kullan&inodot;c&inodot; tarafl&inodot; programlama</simpara></listitem>
    </itemizedlist>
   </para>
   <para>
   &Idot;lk ve en çok kullanan biçim için üç &scedil;eye ihtiyac&inodot;n&inodot;z var:
   PHP'nin kendisi, bir web sunucu ve bir web taray&inodot;c&inodot;s&inodot;. Muhtemelen halihaz&inodot;rda
   bir web taray&inodot;c&inodot;s&inodot;na sahipsiniz, ve i&scedil;letim sisteminizin kurulumuna ba&gbreve;l&inodot; olmakla
   birlikte bir web sunucusuna da sahipsiniz (örn. Linux için Apache ya da Windows
   için IIS). Bir firmadan web alan&inodot; da kiralam&inodot;&scedil; olabilirsiniz. Bu &scedil;ekilde, kendi
   makinan&inodot;zda hiçbir ayar yapmaya gerek duymadan, yaln&inodot;zca PHP programlar&inodot;n&inodot;z&inodot;
   yazabilir, kiralad&inodot;&gbreve;&inodot;n&inodot;z sunucuya gönderebilir ve sonuçlar&inodot; web taray&inodot;c&inodot;n&inodot;zdan
   görebilirsiniz. PHP destekleyen alan kiralama firmalar&inodot;n&inodot;n adreslerini
   <ulink url="&url.php.hosts;">&url.php.hosts;</ulink> ba&gbreve;&inodot;nda bulabilirsiniz.
   </para>
   <para>
   Kendi makinan&inodot;zda sunucu ve PHP kurarken, PHP'yi sunucuya tan&inodot;tmak için
   iki farkl&inodot; seçene&gbreve;iniz vard&inodot;r. Birçok sunucu için PHP direk modül olarak
   tan&inodot;t&inodot;labilir (ayn&inodot; zamanda SAPI olarak adland&inodot;r&inodot;l&inodot;r). Bu sunuculara örnek Apache, 
   Microsoft Internet Information Server, Netscape ve  iPlanet sunucular&inodot;
   gösterilebilir. Baz&inodot; sunucular Microsoft'un modül arayüzü olan ISAPI yi
   destreklerler (OmniHTTPd gibi). E&gbreve;er web sunucunuz PHP'yi modül olarak
   desteklemiyorsa, PHP'yi CGI i&scedil;lemcisi olarak kullanabilirsiniz. Bunun anlam&inodot;
   sunucunuzun PHP çal&inodot;&scedil;t&inodot;r&inodot;labilir dosyas&inodot;n&inodot; (Windows alt&inodot;nda <filename>php.exe</filename> )
   kullanarak kendisine gelen bütün PHP isteklerini cevaplayabilmesidir.
   </para>
   <para>
   E&gbreve;er PHP'yi ayn&inodot; zamanda komut sat&inodot;r&inodot;ndan kullanmakla ilgileniyorsan&inodot;z 
   (örn. siz makinan&inodot;n ba&scedil;&inodot;nda de&gbreve;ilken baz&inodot; resimlerin otomatik olarak yarat&inodot;lmas&inodot;,
   ya da sizin belirtti&gbreve;iniz parametreler ölçüsünde yaz&inodot; dosyalar&inodot;n&inodot;n i&scedil;lenmesi),
   mutlaka php çal&inodot;&scedil;t&inodot;r&inodot;labilir dosyas&inodot;na ihtiyac&inodot;n&inodot;z vard&inodot;r. Daha fazla bilgi için,
   <link linkend="commandline">Komut sat&inodot;r&inodot;nda PHP uygulamalar&inodot; yazmak</link>
   bölümünü ziyaret edebilirsiniz. Bu durumda, sunucuya ve taray&inodot;c&inodot;ya ihtiyac&inodot;n&inodot;z
   kalmaz.
   </para>
   <para>
   PHP ile PHP-GTK uzant&inodot;s&inodot;n&inodot; kullanarak, 
   kullan&inodot;c&inodot; taraf&inodot;nda çal&inodot;&scedil;an görsel arabirime sahip uygulamalar yazabilirsiniz.
   Bu HTML ç&inodot;kt&inodot;s&inodot; üretmedi&gbreve;iniz ve pencerelerle nesneleri ile u&gbreve;ra&scedil;t&inodot;&gbreve;&inodot;n&inodot;z için
   web sayfalar&inodot; yaratmaktan tamamen farkl&inodot; bir yakla&scedil;&inodot;m gerektirir. PHP-GTK
   hakk&inodot;nda daha fazla bilgiyi <ulink url="&url.php.gtk;">bu uzant&inodot;ya ayr&inodot;lm&inodot;&scedil; siteyi</ulink>
   ziyaret ederek bulabilirsiniz. PHP-GTK, resmi PHP da&gbreve;&inodot;t&inodot;m&inodot; ile birlikte da&gbreve;&inodot;t&inodot;lmamaktad&inodot;r.
   </para>
   <para>
   &Scedil;u andan itibaren, bu bölümde PHP'nin Unix ve Windows alt&inodot;nda çal&inodot;&scedil;an sunucularda
   sunucu modülü ve CGI çal&inodot;&scedil;t&inodot;r&inodot;labiliri olarak kurulumu üzerinde duraca&gbreve;&inodot;z.
   </para>
   <para>
   PHP, kaynak kodu ve Windows için derlenmi&scedil; sürümleri <ulink url="&url.php;">&url.php;</ulink>
   adresinden edinilebilir. Size en yak&inodot;n <ulink url="&url.mirrors;">yans&inodot;y&inodot;</ulink>
   kullanman&inodot;z&inodot; öneririz.
   </para>
  </sect1>
  
  <sect1 id="install.unix">
   <title>UNIX alt&inodot;nda Kurulum</title>
   <para>
   Bu bölüm size PHP'nin Unix sistemlerde kurulumu ve genel ayarlar&inodot; konusunda
   yol gösterecektir. &Idot;&scedil;leme ba&scedil;lamadan önce kendi platformunuza veya web web sunucunuza ait bölümleri
   okudu&gbreve;unuzdan iyice emin olun.
   </para>
   <para>
   Gerekli temel bilgi ve yaz&inodot;l&inodot;m:
    <itemizedlist>
     <listitem>
      <simpara>
      Temel UNIX bilgisi ("make" komutunu çal&inodot;&scedil;t&inodot;rabilir olmak ve derleme yap&inodot;lacaksa
      C derleyicisi hakk&inodot;nda fikir sahibi olmak)
      </simpara>
     </listitem> 
     <listitem>
      <simpara>
      Bir ANSI C derleyicisi (derleme yap&inodot;lacaksa)
      </simpara>
     </listitem> 
     <listitem>
      <simpara>
      flex (derleme için)
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       bison (derleme için)
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       Bir web sunucusu
      </simpara>
     </listitem>
     <listitem>
      <simpara>
      Modüle özel araçlar (gd, pdf kütüphanesi vb.)
      </simpara>
     </listitem>
    </itemizedlist>
   </para>
   
   <para>
   PHP'yi UNIX platformunda kurmak için birkaç farkl&inodot; yöntem vard&inodot;r. 
   Bunlardan biri konfigüre et - derle i&scedil;lemidir, di&gbreve;eri de önceden derlenip
   paketlenmi&scedil; yöntemleri kullanmakt&inodot;r. Bu dokümantasyon temel olarak
   PHP'nin derlenmesi ve konfigüre edilmesi üzerine odaklanm&inodot;&scedil;t&inodot;r.
   </para>
   
   <para>
   Temel PHP kurulum ve konfigürasyon a&scedil;amas&inodot;, komut sat&inodot;r&inodot;ndan çal&inodot;&scedil;t&inodot;r&inodot;lan
   <filename>configure</filename> program&inodot; taraf&inodot;ndan yap&inodot;l&inodot;r. Bu sayfada
   en temel seçeneklerin kullan&inodot;m&inodot;n&inodot; bulabilirsiniz, ancak bunlar&inodot;n haricinde üzerinde
   oynanabilecek birçok ayar daha vard&inodot;r. <link
    linkend="install.configure">Konfigürasyon seçeneklerinin tam listesi</link> 
    bölümünden her biri hakk&inodot;nda bilgi alabilirsiniz. PHP'nin kurulumu için birkaç
    yöntem bulunur:
    <itemizedlist>
     <listitem>
      <simpara>
       <link linkend="install.apache">Apache modülü</link> olarak.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       <link linkend="install.fhttpd">fhttpd modülü</link> olarak.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       <link
       linkend="install.otherhttpd">AOLServer, NSAPI,
       phttpd, Pi3Web, Roxen, thttpd, ya da Zeus</link> ile entegre olarak.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       <link linkend="install.commandline">CGI çal&inodot;&scedil;t&inodot;r&inodot;labiliri</link> olarak.
      </simpara>
     </listitem>
    </itemizedlist>
   </para>
   
   <sect2 id="install.unix.apache-module">
    <title>Apache Modülü Cep K&inodot;lavuzu</title>
    
    <para>
    PHP birçok farkl&inodot; yolla derlenebilir, ancak bunlar&inodot;n aras&inodot;nda en popüler olan&inodot;
    Apache modülü &scedil;eklinde oland&inodot;r. A&scedil;a&gbreve;&inodot;da basit bir kurulum örne&gbreve;i göreceksiniz.
    </para>
    
    <example id="install.unix.apache-module.quick">
     <title>
     PHP 4 için H&inodot;zl&inodot; Kurulum Aç&inodot;klamalar&inodot; (Apache Modül Sürümü)
      </title>
     <programlisting>
1.  gunzip apache_1.3.x.tar.gz
2.  tar xvf apache_1.3.x.tar
3.  gunzip php-x.x.x.tar.gz
4.  tar xvf php-x.x.x.tar
5.  cd apache_1.3.x
6.  ./configure --prefix=/www
7.  cd ../php-x.x.x
8.  ./configure --with-mysql --with-apache=../apache_1.3.x --enable-track-vars
9.  make
10. make install
11. cd ../apache_1.3.x
12. ./configure --activate-module=src/modules/php4/libphp4.a
13. make
14. make install
15. cd ../php-x.x.x
16. cp php.ini-dist /usr/local/lib/php.ini
17. httpd.conf dosyan&inodot;z&inodot; ya da srm.conf dosyan&inodot;z&inodot; aç&inodot;p içine ekleyin: 
      AddType application/x-httpd-php .php

18. Apache sunucunuzu yeniden ba&scedil;latmak için gerekli olan i&scedil;lemi
uygulay&inodot;n . (Sunucuyu kapat&inodot;p yeniden ba&scedil;latmal&inodot;s&inodot;n&inodot;z, sunucuya HUP ya da
USR1 sinyali yollamak yeterli de&gbreve;ildir.)
     </programlisting>
    </example>
   </sect2>

   <sect2 id="install.building">
    <title>Derleme</title>
    <simpara>
    PHP konfigüre edildi&gbreve;inde, CGI modülü olarak derlenmeye haz&inodot;r durumdad&inodot;r.
     <command>make</command> komutu derleme i&scedil;lemini ba&scedil;latacakt&inodot;r.
     Bu komut ba&scedil;ar&inodot;s&inodot;z olursa ve nedenini bulamazsan&inodot;z, <link linkend="install.problems">Sorunlar Bölümü</link>
     adresine gözat&inodot;n.
    </simpara>
   </sect2>
  </sect1>

  <sect1 id="install.linux">
   <title>Unix/Linux kurulumlar&inodot;</title>
   <para>
   Bu bölüm PHP'nin Linux da&gbreve;&inodot;t&inodot;mlar&inodot;nda kurulumu ile ilgili notlar ve ipuçlar&inodot;
   içermektedir.
   </para>
   <sect2 id="install.linux.packages">
    <title>Paket Kullan&inodot;m&inodot;</title>
    <simpara>
    Birçok Linux da&gbreve;&inodot;t&inodot;m&inodot; RPM gibi kendine has paket kurulum metodlar&inodot; kullan&inodot;r.
    Bu standart kurulum için yard&inodot;mc&inodot; olabilir, ama farkl&inodot; özelliklere sahip bir sisteme
    ihtiyac&inodot;n&inodot;z varsa (güvenli sunucu, ya da farkl&inodot; bir veritaban&inodot; sürücüsü gibi), 
    PHP'yi ya da web sunucunuzu kendinizin kurmas&inodot; gerekir. Kendi yaz&inodot;l&inodot;m&inodot;n&inodot;z&inodot;
    kurmak ve derlemek konusu size yabanc&inodot; geliyorsa, PHP'nin sizin istedi&gbreve;iniz
    özelliklerle ba&scedil;ka biri taraf&inodot;ndan derlenip derlenmedi&gbreve;ini ara&scedil;t&inodot;rman&inodot;z&inodot;n yard&inodot;m&inodot;
    olabilir.
    </simpara>
   </sect2>
  </sect1>

  <sect1 id="install.hpux">
   <title>Unix/HP-UX installs</title>
   <para>
    This section contains notes and hints specific to installing PHP
    on HP-UX systems.
   </para>
   <example id="install.hpux.example">
    <title>
     Installation Instructions for HP-UX 10
    </title>
    <programlisting>
From: paul_mckay@clearwater-it.co.uk
04-Jan-2001 09:49
(These tips are for PHP 4.0.4 and Apache v1.3.9) 

So you want to install PHP and Apache on a HP-UX 10.20 box? 

1. You need gzip, download a binary distribution from
http://hpux.connect.org.uk/ftp/hpux/Gnu/gzip-1.2.4a/gzip-1.2.4a-sd-10.20.depot.Z
uncompress the file and install using swinstall 

2. You need gcc, download a binary distribution from 
http://gatekeep.cs.utah.edu/ftp/hpux/Gnu/gcc-2.95.2/gcc-2.95.2-sd-10.20.depot.gz 
gunzip this file and install gcc using swinstall. 

3. You need the GNU binutils, you can download a binary distribution from 
http://hpux.connect.org.uk/ftp/hpux/Gnu/binutils-2.9.1/binutils-2.9.1-sd-10.20.depot.gz 
gunzip and install using swinstall. 

4. You now need bison, you can download a binary distribution from 
http://hpux.connect.org.uk/ftp/hpux/Gnu/bison-1.28/bison-1.28-sd-10.20.depot.gz 
install as above. 

5. You now need flex, you need to download the source from one of the
http://www.gnu.org mirrors. It is in the <filename>non-gnu</filename> directory of the ftp site. 
Download the file, gunzip, then tar -xvf it. Go into the newly created flex
directory and do a ./configure, then a make, and then a make install 

If you have errors here, it's probably because gcc etc. are not in your
PATH so add them to your PATH. 

Right, now into the hard stuff. 

6. Download the PHP and apache sources. 

7. gunzip and tar -xvf them. 

We need to hack a couple of files so that they can compile ok. 

8. Firstly the configure file needs to be hacked because it seems to lose
track of the fact that you are a hpux machine, there will be a
better way of doing this but a cheap and cheerful hack is to put 
    lt_target=hpux10.20 
on line 47286 of the configure script. 

9. Next, the Apache GuessOS file needs to be hacked. Under
apache_1.3.9/src/helpers change line 89 from 
    "echo "hp${HPUXMACH}-hpux${HPUXVER}"; exit 0" 
to: 
    "echo "hp${HPUXMACH}-hp-hpux${HPUXVER}"; exit 0" 
    
10. You cannot install PHP as a shared object under HP-UX so you must compile
it as a static, just follow the instructions at the Apache page. 

11. PHP and apache should have compiled OK, but Apache won't start. you need
to create a new user for Apache, eg www, or apache. You then change lines 252
and 253 of the conf/httpd.conf in Apache so that instead of 
    User nobody 
    Group nogroup 
you have something like 
    User www 
    Group sys 

This is because you can't run Apache as nobody under hp-ux. 
Apache and PHP should then work. 

Hope this helps somebody,
Paul Mckay.
  </programlisting>
 </example>

</sect1>

<sect1 id="install.solaris">
 <title>Unix/Solaris installs</title>
 <para>
  This section contains notes and hints specific to installing
  PHP on Solaris systems.
 </para>
 <sect2 id="install.solaris.required">
  <title>Required software</title>
  <para>
   Solaris installs often lack C compilers and their related tools.
   The required software is as follows:    
   <itemizedlist>
    <listitem>
     <simpara>
      gcc (recommended, other C compilers may work)
     </simpara>
    </listitem> 
    <listitem>
     <simpara>
      make
     </simpara>
    </listitem> 
    <listitem>
     <simpara>
      flex
     </simpara>
    </listitem> 
    <listitem>
     <simpara>
      bison
     </simpara>
    </listitem>
    <listitem>
     <simpara>
      m4
     </simpara>
    </listitem>
    <listitem>
     <simpara>
      autoconf
     </simpara>
    </listitem>
    <listitem>
     <simpara>
      automake
     </simpara>
    </listitem>
    <listitem>
     <simpara>
      perl
     </simpara>
    </listitem>
    <listitem>
     <simpara>
      gzip
     </simpara>
    </listitem>
    <listitem>
     <simpara>
      tar
     </simpara>
    </listitem>
   </itemizedlist>
    In addition, you will need to install (and possibly compile) any
    additional software specific to your configuration, such as Oracle
    or MySQL.
  </para>     
 </sect2>
 <sect2 id="install.solaris.packages">
  <title>Using Packages</title>
  <simpara>
   You can simplify the Solaris install process by using pkgadd to
   install most of your needed components. 
  </simpara>
 </sect2>
</sect1>

<sect1 id="install.openbsd">
 <title>Unix/OpenBSD installs</title>
 <para>
 This section contains notes and hints specific to installing
 PHP on <ulink url="&url.openbsd;">OpenBSD</ulink>.
 </para>
 <sect2 id="install.openbsd.ports">
  <title>Using Ports</title>
   <simpara>
    This is the recommended method of installing PHP on OpenBSD, as it will have 
    the latest patches and security fixes applied to it by the maintainers.  To
    use this method, ensure that you have a <ulink url="&url.openbsd.ports;">
    recent ports tree</ulink>.  Then simply find out which flavors you wish
    to install, and issue the <command>make install</command> command.  Below
    is an example of how to do this.
   </simpara>
   <example id="install.openbsd.ports.example">
    <title>OpenBSD Ports Install Example</title>
    <programlisting>
$ cd /usr/ports/www/php4
$ make show VARNAME=FLAVORS
 (choose which flavors you want from the list)
$ env FLAVOR="imap gettext ldap mysql gd" make install
$ /usr/local/sbin/php4-enable
    </programlisting>
   </example>
 </sect2>
 <sect2 id="install.openbsd.packages">
  <title>Using Packages</title>
  <simpara>
   There are pre-compiled packages available for your release
   of <ulink url="&url.openbsd;">OpenBSD</ulink>.  These integrate 
   automatically with the version of Apache installed with the OS.
   However, since there are a large number of options (called 
   <emphasis>flavors</emphasis>) available for this port,
   you may find it easier to compile it from source using the ports tree.
   Read the <ulink url="&url.openbsd.packages;">packages(7)</ulink>
   manual page for more information in what packages are available.
  </simpara>
 </sect2>
</sect1>
  
<sect1 id="install.macosx">
 <title>Unix/Mac OS X installs</title>
 <para>
  This section contains notes and hints specific to installing
  PHP on Mac OS X Server.
 </para>
 <sect2 id="install.macosx.packages">
  <title>Using Packages</title>
  <simpara>
   There are a few pre-packaged and pre-compiled versions of PHP for
   Mac OS X. This can help in setting up a standard
   configuration, but if you need to have a different set of features
   (such as a secure server, or a different database driver), you may
   need to build PHP and/or your web server yourself. If you are unfamiliar
   with building and compiling your own software, it's worth
   checking whether somebody has already built a packaged
   version of PHP with the features you need.
  </simpara>
 </sect2>
 <sect2 id="install.macosx.compile">
  <title>Compiling for OS X server</title>
  <simpara>
   There are two slightly different versions of Mac OS X, client and
   server. The following is for OS X Server.
  </simpara>
   <example id="install.macosx.compile.example">
   <title>Mac OS X server install</title>
   <programlisting>
1. Get the latest distributions of Apache and PHP
2. Untar them, and run the configure program on Apache like so.
    ./configure --exec-prefix=/usr \ 
    --localstatedir=/var \ 
    --mandir=/usr/share/man \ 
    --libexecdir=/System/Library/Apache/Modules \ 
    --iconsdir=/System/Library/Apache/Icons \ 
    --includedir=/System/Library/Frameworks/Apache.framework/Versions/1.3/Headers \ 
    --enable-shared=max \ 
    --enable-module=most \ 
    --target=apache 

4. You may also want to add this line: 
    setenv OPTIM=-O2 
    If you want the compiler to do some optimization. 
    
5. Next, go to the PHP 4 source directory and configure it. 
    ./configure --prefix=/usr \ 
    --sysconfdir=/etc \ 
    --localstatedir=/var \ 
    --mandir=/usr/share/man \ 
    --with-xml \ 
    --with-apache=/src/apache_1.3.12 

    If you have any other addiitons (MySQL, GD, etc.), be sure to add
    them here. For the --with-apache string, put in the path to your 
    apache source directory, for example "/src/apache_1.3.12". 
6. make
7. make install    
    This will add a directory to your Apache source directory under
    src/modules/php4.
    
8. Now, reconfigure Apache to build in PHP 4.
    ./configure --exec-prefix=/usr \ 
    --localstatedir=/var \ 
    --mandir=/usr/share/man \ 
    --libexecdir=/System/Library/Apache/Modules \ 
    --iconsdir=/System/Library/Apache/Icons \ 
    --includedir=/System/Library/Frameworks/Apache.framework/Versions/1.3/Headers \ 
    --enable-shared=max \ 
    --enable-module=most \ 
    --target=apache \ 
    --activate-module=src/modules/php4/libphp4.a 

    You may get a message telling you that libmodphp4.a is out of date.
    If so, go to the src/modules/php4 directory inside your apache
    source directory and run this command: 

    ranlib libmodphp4.a 

    Then go back to the root of the apache source directory and run the
    above configure command again. That'll bring the link table up to
    date. 

9. make

10. make install

11. copy and rename the php.ini-dist file to your "bin" directory from your
    PHP 4 source directory:
    cp php.ini-dist /usr/local/bin/php.ini 

    or (if your don't have a local directory) 

    cp php.ini-dist /usr/bin/php.ini 
   </programlisting>
  </example>
  <simpara>
   Other examples for
   <ulink url="&url.stepwise.macosx-client;">Mac OS X client</ulink>
   and
   <ulink url="&url.stepwise.macosx-client;">Mac OS X server</ulink>
   are available at <ulink url="&url.stepwise;">Stepwise</ulink>.
  </simpara>
 </sect2>
 <sect2 id="install.macosx.client">
  <title>Compiling for MacOS X client</title>
  <simpara>
   Those tips are graciously provided by <ulink url="&url.macosx;">Marc Liyanage</ulink>.
  </simpara>
  <simpara>
   The PHP module for the Apache web server included in Mac OS X.
   This version includes support for the MySQL and PostgreSQL databases.
  </simpara>
  <simpara>
   NOTE: Be careful when you do this, you could screw up your Apache web server!
  </simpara>
  <para>
   Do this to install:
   <itemizedlist>
    <listitem>
     <simpara>
      1.	Open a terminal window 
     </simpara>
    </listitem>
    <listitem>
     <simpara>
      2.	Type "wget http://www.diax.ch/users/liyanage/software/macosx/libphp4.so.gz",
      wait for download to finish 
     </simpara>
    </listitem>
    <listitem>
     <simpara>
      3.	Type "gunzip libphp4.so.gz" 
     </simpara>
    </listitem>
    <listitem>
     <simpara>
      4.	Type "sudo apxs -i -a -n php4 libphp4.so" 
     </simpara>
    </listitem>
   </itemizedlist>
   Now type "<literal>sudo open -a TextEdit /etc/httpd/httpd.conf</literal>"
   TextEdit will open with the web server configuration file. Locate these 
   two lines towards the end of the file: (Use the Find command)
   <programlisting>
   *	#AddType application/x-httpd-php .php 
   *	#AddType application/x-httpd-php-source .phps
   </programlisting>
   Remove the two hash marks (<literal>#</literal>), then save the file and quit TextEdit.
  </para>
  <para>
   Finally, type "<literal>sudo apachectl graceful</literal>" to restart the web server.
  </para>
  <para>
   PHP should now be up and running. You can test it by dropping a file into 
   your "Sites" folder which is called "test.php". Into that file, write this
   line: "<literal>&lt;?php phpinfo() ?&gt;</literal>".
  </para>
  <para>
   Now open up <literal>127.0.0.1/~your_username/test.php</literal> in your web browser.
   You should see a status table with information about the PHP module.
  </para>
 </sect2>
</sect1>

<sect1 id="install.configure">
 <title>Konfigürasyon seçeneklerinin tam listesi</title>
 <note>
  <para>
  Bu seçenekler yaln&inodot;zca derleme sürecinde kullan&inodot;l&inodot;r. E&gbreve;er PHP'nin çal&inodot;&scedil;ma
  s&inodot;ras&inodot;ndaki ayarlar&inodot;n&inodot; de&gbreve;i&scedil;tirmek istiyorsan&inodot;z, lütfen <link
   linkend="configuration">Konfigürasyon</link> bölümünü inceleyin.
  </para>
 </note>

 <para>
 A&scedil;a&gbreve;&inodot;da Unix türevi ortamlarda PHP3 ve PHP4 taraf&inodot;ndan desteklenen kurulum
 seçeneklerinin tam listesi yer almaktad&inodot;r. Baz&inodot;lar&inodot; PHP 3, baz&inodot;lar&inodot; PHP 4, baz&inodot;lar&inodot;
 da her ikisi birden kullan&inodot;lmaktad&inodot;r ve ait olduklar&inodot; sürüm not edilmi&scedil;tir. PHP 3 ile
 PHP 4 aras&inodot;nda isimleri farkl&inodot; oldu&gbreve;u halde ayn&inodot; görevi gören seçenekler bulunabilir.
 Bu giri&scedil;ler birbirlerine çapraz ba&gbreve;lant&inodot;l&inodot;d&inodot;r, bu &scedil;ekilde PHP 3 üzerinde yapt&inodot;&gbreve;&inodot;n&inodot;z
 ayarlarla ilgili bir sorun ya&scedil;arsan&inodot;z, isimlerin de&gbreve;i&scedil;ip de&gbreve;i&scedil;medi&gbreve;ine bak&inodot;n.
 </para>

 <itemizedlist>
  <listitem>
   <para>
    <link linkend="install.configure.databases">Veritaban&inodot;</link>
   </para>
  </listitem>
  <listitem>
   <para>
    <link linkend="install.configure.ecommerce">E-ticaret</link>
   </para>
  </listitem>
  <listitem>
   <para>
    <link linkend="install.configure.graphics">Grafikler</link>
   </para>
  </listitem>
  <listitem>
   <para>
    <link linkend="install.configure.misc">Di&gbreve;er</link>
   </para>
  </listitem>
  <listitem>
   <para>
    <link linkend="install.configure.networking">A&gbreve;</link>
   </para>
  </listitem>
  <listitem>
   <para>
    <link linkend="install.configure.php">PHP Özel</link>
   </para>
  </listitem>
  <listitem>
   <para>
    <link linkend="install.configure.servers">Sunucu</link>
   </para>
  </listitem>
  <listitem>
   <para>
    <link linkend="install.configure.text">Yaz&inodot; ve dil</link>
   </para>
  </listitem>
  <listitem>
   <para>
    <link linkend="install.configure.xml">XML</link>
   </para>
  </listitem>
 </itemizedlist>

 <sect2 id="install.configure.databases">
  <title>Veritaban&inodot;</title>
   <variablelist>

    <varlistentry id="install.configure.with-adabas">
     <term>
      <parameter>--with-adabas[=DIR]</parameter>
     </term>
     <listitem>
      <para>
      PHP 3, PHP 4: Adabas D deste&gbreve;ini ekler. DIR Adabas kurulum klasörünü
      gösterir, öntan&inodot;ml&inodot; olarak /usr/local de&gbreve;erini içerir.
      </para>
      <para>
       <ulink url="&url.adabas;">Adabas web sitesi</ulink>
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-dba">
     <term>
      <parameter>--enable-dba=shared</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: DBA payla&scedil;&inodot;ml&inodot; modül olarak eklenir
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-dbx">
     <term>
      <parameter>--enable-dbx</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: DBX deste&gbreve;ini ekler
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-dbase">
     <term>
      <parameter>--enable-dbase</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: Seçenek mevcut de&gbreve;il; bunun yerine <link
       linkend="install.configure.with-dbase">--with-dbase</link>
       kullan&inodot;n.
      </para>
      <para>
       PHP 4: PHP ile birlikte gelen dbase kütüphanesini çal&inodot;&scedil;t&inodot;r&inodot;r.
       Ba&scedil;ka modüle gerek yoktur.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-dbase">
     <term>
      <parameter>--with-dbase</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP ile birlikte gelen dbase kütüphanesini çal&inodot;&scedil;t&inodot;r&inodot;r.
       Ba&scedil;ka modüle gerek yoktur.
      </para>
      <para>
       PHP 4: Seçenek mevcut de&gbreve;il; bunun yerine <link
       linkend="install.configure.enable-dbase">--enable-dbase</link>
       kullan&inodot;n.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-db2">
     <term>
      <parameter>--with-db2[=DIR]</parameter>
     </term>
     <listitem>
      <para>
       PHP 3, PHP 4: Berkeley DB2 deste&gbreve;ini ekler
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-db3">
     <term>
      <parameter>--with-db3[=DIR]</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: Berkeley DB3 deste&gbreve;ini ekler
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-dbm">
     <term>
      <parameter>--with-dbm[=DIR]</parameter>
     </term>
     <listitem>
      <para>
       PHP 3, PHP 4: DBM deste&gbreve;ini ekler
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-dbmaker">
     <term>
      <parameter>--with-dbmaker[=DIR]</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
      PHP 4: DBMaker deste&gbreve;ini ekler. DIR DBMaker kurulum klasörünü gösterir,
      öntan&inodot;ml&inodot; olarak DBMaker'in son sürümünün klasörünü ta&scedil;&inodot;r
      (/home/dbmaker/3.6 gibi)
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-empress">
     <term>
      <parameter>--with-empress[=DIR]</parameter>
     </term>
     <listitem>
      <para>
      PHP 3, PHP 4: Empress deste&gbreve;ini ekler. DIR Empress temel kurulum dizinidir,
      öntan&inodot;ml&inodot; olarak $EMPRESSPATH de&gbreve;erini ta&scedil;&inodot;r.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-filepro">
     <term>
      <parameter>--enable-filepro</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: Seçenek mevcut de&gbreve;il; bunun yerine <link
       linkend="install.configure.with-filepro">--with-filepro</link>
       kullan&inodot;n.
      </para>
      <para>
       PHP 4: PHP ile birlikte gelen salt-okunur filePro deste&gbreve;ini etkinle&scedil;tirir. D&inodot;&scedil;
       kütüphaneye gerek yoktur.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-filepro">
     <term>
      <parameter>--with-filepro</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP ile birlikte gelen salt-okunur filePro deste&gbreve;ini etkinle&scedil;tirir. D&inodot;&scedil;
       kütüphaneye gerek yoktur.
      </para>
      <para>
       PHP 4: Seçenek mevcut de&gbreve;il; bunun yerine <link
       linkend="install.configure.enable-filepro">--enable-filepro</link>
       kullan&inodot;n.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-fbsql">
     <term>
      <parameter>--with-fbsql[=DIR]</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: Seçenek mevcut de&gbreve;il.
      </para>
      <para>
      PHP 4: FrontBase SQL deste&gbreve;ini etkinle&scedil;tirir. DIR FrontBase temel kurulum
      klasörüdür, öntan&inodot;ml&inodot; olarak al&inodot;&scedil;&inodot;lm&inodot;&scedil; Frontbase dizinini kullan&inodot;r. 
      Al&inodot;&scedil;&inodot;lm&inodot;&scedil; kurulum dizinleri i&scedil;letim sisteminize göre farkl&inodot;l&inodot;k gösterir:
       Solaris: <literal>/opt/FrontBase</literal>, 
       WinNT: <literal>\usr\FrontBase</literal>,
       Linux: <literal>/usr/frontbase</literal>,
       Mac OSX: <literal>/Library/FrontBase</literal>.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-gdbm">
     <term>
      <parameter>--with-gdbm[=DIR]</parameter>
     </term>
     <listitem>
      <para>
       PHP 3, PHP 4: GDBM deste&gbreve;ini ekler
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-hyperwave">
     <term>
      <parameter>--with-hyperwave</parameter>
     </term>
     <listitem>
      <para>
       PHP 3, PHP 4: Hyperwave deste&gbreve;ini ekler
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-ibm-db2">
     <term>
      <parameter>--with-ibm-db2[=DIR]</parameter>
     </term>
     <listitem>
      <para>
      PHP 3, PHP 4: IBM DB2 deste&gbreve;ini ekler. DIR DB2 temel kurulum klasörüdür.
      Öntan&inodot;ml&inodot; olarak <filename>/home/db2inst1/sqllib</filename> de&gbreve;erini ta&scedil;&inodot;r.
      </para>
      <para>
       <ulink url="&url.ibmdb2;">IBM DB2 web sitesi</ulink>
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-informix">
     <term>
      <parameter>--with-informix[=DIR]</parameter>
     </term>
     <listitem>
      <para>
      PHP 3, PHP4: Informix deste&gbreve;ini ekler. DIR Informix temel kurulum klasörüdür.
      Öntan&inodot;ml&inodot; olarak bo&scedil;tur.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-ingres">
     <term>
      <parameter>--with-ingres[=DIR]</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
      PHP 4: Ingres II deste&gbreve;ini  ekler. DIR Ingres temel klasörüne e&scedil;it olmal&inodot;d&inodot;r.
      ( öntan&inodot;ml&inodot; d&gbreve;er /II/inges)
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-interbase">
     <term>
      <parameter>--with-interbase[=DIR]</parameter>
     </term>
     <listitem>
      <para>
      PHP 3, PHP4: InterBase deste&gbreve;ini ekler. DIR InterBase temel kurulum
      klasörüdür. Öntan&inodot;ml&inodot; de&gbreve;eri <filename>/usr/interbase</filename>.
      </para>
      <simpara>
       <link linkend="ref.ibase">Interbase fonksiyonlar&inodot;</link>
      </simpara>
      <simpara>
       <ulink url="&url.ibase;">Interbase ana sayfas&inodot;</ulink>
      </simpara>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-ldap">
     <term>
      <parameter>--with-ldap[=DIR]</parameter>
     </term>
     <listitem>
      <para>
      PHP 3: LDAP deste&gbreve;ini ekler. DIR LDAP temel kurulum klasörüdür.
      Öntan&inodot;ml&inodot; olarak <filename>/usr</filename> ve
      <filename>/usr/local</filename> kullan&inodot;l&inodot;r.
     </para>
     <para>
     PHP 4: LDAP deste&gbreve;ini ekler. DIR LDAP temel kurulum klasörüne denktir.
     </para>
      <simpara>
      Bu seçenek <acronym>LDAP</acronym> (Lightweight Directory Access
       Protocol deste&gbreve;i) modülünü etkinle&scedil;tirir. Parametre de&gbreve;eri LDAP temel kurulum
       klasörünü gösterir, öntan&inodot;ml&inodot; olarak <filename class="directory">/usr/local/ldap</filename>
       klasörünü gösterir.
      </simpara>
      <simpara>
      LDAP hakk&inodot;nda daha fazla bilgiye <ulink
       url="&url.rfc;rfc1777.html">RFC1777</ulink> ve
       <ulink
       url="&url.rfc;rfc1778.html">RFC1778</ulink> ba&gbreve;lar&inodot;ndan ula&scedil;&inodot;labilir.
      </simpara>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-msql">
     <term>
      <parameter>--with-msql[=DIR]</parameter>
     </term>
     <listitem>
      <para>
      PHP 3, PHP 4: mSQL deste&gbreve;ini etkinle&scedil;tirir. Bu seçene&gbreve;e ait parametre
      mSQL kurulum klasörünün de&gbreve;erini ta&scedil;&inodot;r ve öntan&inodot;ml&inodot; olarak  <filename
       class="directory">/usr/local/Hughes</filename> d&inodot;r. Bu klasör
       mSQL 2.0 da&gbreve;&inodot;t&inodot;m&inodot; için öntan&inodot;ml&inodot; klasördür.
       <command>configure</command> hangi mSQL sürümünü kulland&inodot;&gbreve;&inodot;n&inodot;z&inodot;
       otomatik olarak tespit eder. PHP hem 1.0 hem de 2.0 sürümlerini destekler,
       ancak 1.0 eklentisi ise yaln&inodot;zca mSQL 1.0 sürümü veritabanlar&inodot;na, 2.0 sürümü
       ile de yaln&inodot;zca 2.0 olanlara ula&scedil;abilirsiniz.
      </para>
      <simpara>
       Ayn&inodot; zamanda <link linkend="configuration.file">konfigürasyon dosyas&inodot;</link>
       içindeki <link linkend="ini.sect.msql">mSQL
       Konfigürasyon</link> yönergelerini de inceleyin.
      </simpara>
      <simpara>
       <ulink url="&url.msql;">mSQL ana sayfas&inodot;</ulink>
      </simpara>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-mysql">
     <term>
      <parameter>--with-mysql[=DIR]</parameter>
     </term>
     <listitem>
      <para>
      PHP 3: MySQL deste&gbreve;ini ekler. DIR MySQL temel kurulum klasörüdür. Öntan&inodot;ml&inodot;
      de&gbreve;eri MySQL dosyalar&inodot;n&inodot;n bulunabilece&gbreve;i ortak alanlar&inodot; inceleyerek elde eder.
      </para>
      <para>
      PHP 4: MySQL deste&gbreve;ini ekler. DIS MySQL temel klasörüdür. Belirtilmemi&scedil;se,
      PHP ile birlikte gelen MySQL kütüphanesi kullan&inodot;l&inodot;r. Bu seçenek öntan&inodot;ml&inodot; olarak
      aç&inodot;kt&inodot;r.
      </para>
      <para>
      Ayn&inodot; zamanda
       <link linkend="configuration.file">konfigürasyon dosyas&inodot;</link>
       içindeki <link linkend="ini.sect.mysql">MySQL
       Konfigürasyon</link> yönergelerini de inceleyin.
      </para>
      <para>
       <ulink url="&url.mysql;">MySQL ana sayfas&inodot;</ulink>
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-ndbm">
     <term>
      <parameter>--with-ndbm[=DIR]</parameter>
     </term>
     <listitem>
      <para>
       PHP 3, PHP 4: NDBM deste&gbreve;ini ekler.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-ovrimos">
     <term>
      <parameter>--with-ovrimos</parameter>
     </term>
     <listitem>
      <para>
       PHP 3, PHP 4: Ovrimos deste&gbreve;ini ekler.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-oci8">
     <term>
      <parameter>--with-oci8[=DIR]</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il.
      </para>
      <para>
      PHP 4: Oracle-oci8 deste&gbreve;ini ekler. Öntan&inodot;ml&inodot; DIR, ORACLE_HOME
      de&gbreve;erine e&scedil;ittir.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-oracle">
     <term>
      <parameter>--with-oracle[=DIR]</parameter>
     </term>
     <listitem>
     <para>
     PHP 3: Oracle veritaban&inodot; deste&gbreve;ini ekler. DIR, Oracle ana klasörüdür,
     öntan&inodot;ml&inodot; olarak $ORACLE_HOME de&gbreve;erini ta&scedil;&inodot;r.
     </para>
     <para>
     PHP 4: Oracle-oci7 deste&gbreve;ini ekler. Öntan&inodot;ml&inodot; DIR de&gbreve;eri ORACLE_HOME
     de&gbreve;erine e&scedil;ittir.
     </para>
     <simpara>
     Oracle deste&gbreve;ini ekler. Test edilmi&scedil;tir ve en az&inodot;ndan Oracle 7.0-7.3 aras&inodot;ndaki
     sürümlerde sorunsuz çal&inodot;&scedil;maktad&inodot;r. Parametre <envar>ORACLE_HOME</envar>
     klasörüdür. Oracle ortam&inodot;n&inodot;z kuruluysa belirtmenize gerek yoktur.
     </simpara>
     <simpara>
      <ulink url="&url.oracle;">Oracle ana sayfa</ulink>
     </simpara>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-pgsql">
    <term>
     <parameter>--with-pgsql[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3: PostgresSQL deste&gbreve;ini ekler. DIR, PostgreSQL temel kurulum klasörüdür.
     Öntan&inodot;ml&inodot; de&gbreve;eri <filename>/usr/local/pgsql</filename> olarak belirtilmi&scedil;tir.
     </para>
     <para>
     PHP 4: PostgreSQL deste&gbreve;ini ekler. DIR, PostgreSQL temel kurulum klasörüdür.
     Öntan&inodot;ml&inodot; de&gbreve;eri <filename>/usr/local/pgsql</filename> olarak belirtilmi&scedil;tir.
     DIR de&gbreve;erine shared verirseniz d&inodot;&scedil; modül olarak derlenir.
     </para>
     <simpara>
      Ayn&inodot; zamanda
       <link linkend="configuration.file">konfigürasyon dosyas&inodot;</link>
       içindeki <link linkend="ini.sect.pgsql">pgSQL
       Konfigürasyon</link> yönergelerini de inceleyin.
     </simpara>
     <simpara>
      <ulink url="&url.pgsql;">PostgreSQL ana sayfas&inodot;</ulink>
     </simpara>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-solid">
    <term>
     <parameter>--with-solid[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3, PHP 4: Solid deste&gbreve;ini ekler. DIR, Solid temel kurulum klasörüne e&scedil;it
     olmal&inodot;d&inodot;r. Öntan&inodot;ml&inodot; de&gbreve;er /usr/local/solid dir.
     </para>
     <simpara>
      <ulink url="&url.solid;">Solid ana sayfa</ulink>
     </simpara>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-sybase-ct">
    <term>
     <parameter>--with-sybase-ct[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3, PHP 4: Sybase-CT deste&gbreve;ini ekler. DIR, Sybase ana klasörüdür.
     Öntan&inodot;ml&inodot; de&gbreve;eri /home/sybase dir.
     </para>
     <simpara>
      Ayn&inodot; zamanda
       <link linkend="configuration.file">konfigürasyon dosyas&inodot;</link>
       içindeki <link linkend="ini.sect.sybct">Sybase-CT
       Konfigürasyon</link> yönergelerini de inceleyin.
     </simpara>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-sybase">
    <term>
     <parameter>--with-sybase[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3, PHP4: Sybase-DB deste&gbreve;ini ekler. DIR, Sybase ana klasörüdür,
     öntan&inodot;ml&inodot; olarak <filename>/home/sybase</filename> de&gbreve;erini ta&scedil;&inodot;r.
     </para>
     <simpara>
      Ayn&inodot; zamanda
       <link linkend="configuration.file">konfigürasyon dosyas&inodot;</link>
       içindeki <link linkend="ini.sect.sybase">Sybase
       Konfigürasyon</link> yönergelerini de inceleyin.
     </simpara>
     <simpara>
      <ulink url="&url.sybase;">Sybase ana sayfas&inodot;</ulink>
     </simpara>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-openlink">
    <term>
     <parameter>--with-openlink[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3, PHP 4: OpenLink ODBC deste&gbreve;ini ekler. DIR, OpenLink temel kurulum
     klasörüdür. Öntan&inodot;ml&inodot; de&gbreve;eri /usr/local/openlink tir.
	  PHP 4.0.6 sürümünden itibaren bu seçenek geçerli de&gbreve;ildir. Lütfen OpenLink
	  ODBC sistemini kullanmak istiyorsan&inodot;z <parameter>--with-iodbc</parameter>
	  kullan&inodot;n.
     </para>
     <simpara>
      <ulink url="&url.openlink;">OpenLink Software ana sayfas&inodot;</ulink>
     </simpara>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-iodbc">
    <term>
     <parameter>--with-iodbc[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3, PHP 4: iODBC deste&gbreve;ini ekler. DIR, iODBC temel kurulum klasörüdür.
     Öntan&inodot;ml&inodot; de&gbreve;eri <filename>/usr/local</filename> d&inodot;r.
     </para>
     <para>
     Bu özellik ilk ba&scedil;ta iODBC Sürücü Yöneticisi taraf&inodot;ndan geli&scedil;tirilmi&scedil;tir.
     Bu sürücü çe&scedil;itli UNIX sürümleri alt&inodot;nda çal&inodot;&scedil;an ve serbestçe da&gbreve;&inodot;t&inodot;lan bir
     uygulamad&inodot;r.
     </para>
     <simpara>
      <ulink url="&url.freeodbc;">FreeODBC ana sayfa</ulink> 
      or <ulink url="&url.iodbc;">iODBC ana sayfa</ulink>
     </simpara>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-custom-odbc">
    <term>
     <parameter>--with-custom-odbc[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3, PHP 4: Özelle&scedil;tirilmi&scedil; ODBC kütüphanesi deste&gbreve;i ekler. Parametre
     kurulum klasörü olmal&inodot;d&inodot;r. Öntan&inodot;ml&inodot; de&gbreve;eri <filename class="directory">/usr/local</filename>
     dir.
     </para>
     <simpara>
     Bu seçenek CUSTOM_ODBC_LIBS in configure çal&inodot;&scedil;t&inodot;r&inodot;ld&inodot;&gbreve;&inodot;nda tan&inodot;ml&inodot;
     oldu&gbreve;unu varsayar. Ayr&inodot;ca include yolunuzun içersinde geçerli bir odbc.h ba&scedil;l&inodot;k
     dosyas&inodot; bulundurmal&inodot;s&inodot;n&inodot;z. E&gbreve;er bu dosyaya sahip de&gbreve;ilseniz, yarat&inodot;n ve kendinize
     özel ba&scedil;l&inodot;&gbreve;&inodot; ekleyin. Ba&scedil;l&inodot;&gbreve;&inodot;n&inodot;z ayn&inodot; zamanda fazladan tan&inodot;mlamalar gerektiriyor
     olabilir, bu durum özellikle çok platformlu yap&inodot;larda ya&scedil;an&inodot;r. Bu tan&inodot;mlamalar&inodot;
     CFLAGS de&gbreve;erine yapabilirsiniz.
      CFLAGS.
     </simpara>
     <simpara>
     Örne&gbreve;in, Sybase SQL Anywhere veritaban&inodot;n&inodot; QNX üzerinde a&scedil;a&gbreve;&inodot;daki biçimde
     kullanabilirsiniz.
      <literal>
       CFLAGS=-DODBC_QNX LDFLAGS=-lunix CUSTOM_ODBC_LIBS="-ldblib
       -lodbc" ./configure --with-custom-odbc=/usr/lib/sqlany50
      </literal>
     </simpara>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.disable-unified-odbc">
    <term>
     <parameter>--disable-unified-odbc</parameter>
    </term>
    <listitem>
     <para>
     PHP 3: Tekille&scedil;tirilmi&scedil; ODBC deste&gbreve;ini devre d&inodot;&scedil;&inodot; b&inodot;rak&inodot;r. Yaln&inodot;zca
     iODBC, Adabas, Solid, Velocis ya da özelle&scedil;tirilmi&scedil; ODBC arayüzleri etkinle&scedil;tirilmi&scedil;se
     uygulanabilir.
     </para>
     <para>
      PHP 4: PHP 4 için mevcut de&gbreve;il
     </para>
     <simpara>
     Tekille&scedil;tirilmi&scedil; ODBC modülü, Solid, IBM DB2, Adabas gibi veritabanlar&inodot;na
     ortak eri&scedil;im arayüzü sa&gbreve;lar. Ayn&inodot; zamanda normal ODBC kütüphaneleri için
     de kullan&inodot;l&inodot;r. iODBC, Solid, Adabas D, IBM DB2 ve Sybase SQL Anywhere
     üzerinde test edilmi&scedil;tir. Bu uzant&inodot;lardan birinin (yaln&inodot;zca birinin) ya da Velocis
     uzant&inodot;s&inodot;n&inodot;n etkinle&scedil;tirilmi&scedil; olmas&inodot;n&inodot;, ya da özelle&scedil;tirilmi&scedil; ODBC kütüphanesinin
     seçilmi&scedil; olmas&inodot;n&inodot; gerektirir. Bu seçenek yaln&inodot;zca a&scedil;a&gbreve;&inodot;daki seçeneklerden biri
     kullan&inodot;ld&inodot;&gbreve;&inodot;nda kullan&inodot;labilir durumdad&inodot;r: <link
      linkend="install.configure.with-iodbc">--with-iodbc</link>,
      <link
      linkend="install.configure.with-solid">--with-solid</link>,
      <link
      linkend="install.configure.with-ibm-db2">--with-ibm-db2</link>,
      <link
      linkend="install.configure.with-adabas">--with-adabas</link>,
      <link
      linkend="install.configure.with-velocis">--with-velocis</link>,
      or <link
      linkend="install.configure.with-custom-odbc">--with-custom-odbc</link>.
     </simpara>
     <simpara>
      Ayn&inodot; zamanda
       <link linkend="configuration.file">konfigürasyon dosyas&inodot;</link>
       içindeki <link linkend="ini.sect.uodbc">Tekille&scedil;tirilmi&scedil; ODBC
       Konfigürasyonu</link> yönergelerini de inceleyin.
     </simpara>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-unixODBC">
    <term>
     <parameter>--with-unixODBC[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3: Seçenek PHP 3 için mevcut de&gbreve;il
     </para>
     <para>
     PHP 4: unixODBC deste&gbreve;ini ekler. DIR, unixODBC temel kurulum klasörüdür.
     Öntan&inodot;ml&inodot; de&gbreve;eri /usr/local dir.
     </para>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-velocis">
    <term>
     <parameter>--with-velocis[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3, PHP 4: Velocis deste&gbreve;ini ekler. DIR, Velocis temel kurulum klasörüdür.
     Öntan&inodot;ml&inodot; de&gbreve;eri /usr/local/velocis dir.
     </para>
     <simpara>
      <ulink url="&url.velocis;">Velocis ana sayfas&inodot;</ulink>
     </simpara>
    </listitem>
   </varlistentry>
  </variablelist>
 </sect2>
   
 <sect2 id="install.configure.ecommerce">
  <title>E-ticaret</title>
   <variablelist>
    <varlistentry id="install.configure.with-ccvs">
     <term>
      <parameter>--with-ccvs[=DIR]</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
      PHP 4: CCVS deste&gbreve;ini PHP 4 için derler. CCVS kurulum klasörünüzü DIR
      de&gbreve;eri olarak belirtmeniz gereklidir.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-cybermut">
     <term>
      <parameter>--with-cybermut[=DIR]</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 seçene&gbreve;i mevcut de&gbreve;il
      </para>
      <para>
      PHP 4: Cybermut deste&gbreve;ini PHP'ye ekler. DIR, Cybermut SDK klasörüdür.
      Bu klasör hem <filename>libcm-mac.a</filename>
       hem de <filename>cm-mac.h</filename> dosyalar&inodot;n&inodot; içermelidir.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-mck">
     <term>
      <parameter>--with-mck[=DIR]</parameter>
     </term>
     <listitem>
      <para>
      PHP 3: Cybercash MCK deste&gbreve;ini ekler. DIR cybercash mck kurulum klasörüdür.
      Öntan&inodot;ml&inodot; de&gbreve;eri <filename>/usr/src/mck-3.2.0.3-linux</filename>. Yard&inodot;m için
      <filename>extra/cyberlib</filename> dosyas&inodot;n&inodot; inceleyin.
      </para>
      <para>
      PHP 4: Seçenek mevcut de&gbreve;il; <link
       linkend="install.configure.with-cybercash">--with-cybercash</link>
       ba&gbreve;&inodot;na bak&inodot;n.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.with-cybercash">
     <term>
      <parameter>--with-cybercash[=DIR]</parameter>
     </term>
     <listitem>
      <para>
      PHP 3: Seçenek mevcut de&gbreve;il; <link
       linkend="install.configure.with-mck">--with-mck</link>
       ba&gbreve;&inodot;n&inodot; kullan&inodot;n.
      </para>
      <para>
      PHP 4: CyberCash deste&gbreve;ini ekler. DIR, CyberCash MCH kurulum klasörüdür.
      </para>
     </listitem>
    </varlistentry>

    <varlistentry id="install.configure.with-pfpro">
      <term>
      <parameter>--with-pfpro[=DIR]</parameter>
     </term>
     <listitem>
      <para>
      PHP 3: Seçenek PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
      PHP 4: Verisign Payflow Pro deste&gbreve;ini ekler
      </para>
    </listitem>
   </varlistentry>
  </variablelist>
 </sect2>
  
 <sect2 id="install.configure.graphics">
  <title>Grafikler</title>
  <variablelist>
   <varlistentry id="install.configure.enable-freetype-4bit-antialias-hack">
    <term>
     <parameter>--enable-freetype-4bit-antialias-hack</parameter>
    </term>
    <listitem>
     <para>
     PHP 3: Seçenek PHP 3 için mevcut de&gbreve;il
     </para>
     <para>
     PHP 4: FreeType2 deste&gbreve;ini ekler (deneysel).
     </para>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-gd">
    <term>
     <parameter>--with-gd[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3: GD deste&gbreve;ini ekler (DIR GD kurulum klasörüdür).
     </para>
     <para>
     PHP 4: GD deste&gbreve;ini ekler (DIR GD kurulum klasörüdür). DIR de&gbreve;erini shared
     olarak belirtirseniz, shared modül kurulum yapabilirsiniz.
     </para>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.without-gd">
    <term>
     <parameter>--without-gd</parameter>
    </term>
    <listitem>
     <para>
     PHP 3, PHP 4: GD deste&gbreve;ini devre d&inodot;&scedil;&inodot; b&inodot;rak&inodot;r.
     </para>
    </listitem>
   </varlistentry>

   <varlistentry id="install.configure.with-imagick">
    <term>
     <parameter>--with-imagick[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3: ImageMagick deste&gbreve;ini ekler. DIR, kurulum klasörüdür, bo&scedil; b&inodot;rak&inodot;ld&inodot;&gbreve;&inodot;nda,
     PHP nerede oldu&gbreve;unu bulmaya çal&inodot;&scedil;&inodot;r (deneysel).
     </para>
     <para>
     PHP 4: PHP 4 için mevcut de&gbreve;il
     </para>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-jpeg-dir">
    <term>
     <parameter>--with-jpeg-dir[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3: pdflib 2.0 için jpeg klasörü
     </para>
     <para>
     PHP 4: pdflib 3.x ve 4.x için jpeg klasörü
     </para>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-png-dir">
    <term>
     <parameter>--with-png-dir[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3: PHP 3 için mevcut de&gbreve;il
     </para>
     <para>
     PHP 4: pdflib 3.x ve 4.x için png klasörü
     </para>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.enable-t1lib">
    <term>
     <parameter>--enable-t1lib</parameter>
    </term>
    <listitem>
     <para>
     PHP 3: t1lib deste&gbreve;ini etkinle&scedil;tirir.
     </para>
     <para>
     PHP 4: Seçenek mevcut de&gbreve;il; <link
      linkend="install.configure.with-t1lib">--with-t1lib</link>
      ba&gbreve;&inodot;n&inodot; kullan&inodot;n.
     </para>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-t1lib">
    <term>
     <parameter>--with-t1lib[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3: Seçenek mevcut de&gbreve;il; <link
      linkend="install.configure.enable-t1lib">--enable-t1lib</link>
      ba&gbreve;&inodot;n&inodot; kullan&inodot;n.
     </para>
     <para>
     PHP 4: T1lib deste&gbreve;ini ekler.
     </para>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-tiff-dir">
    <term>
     <parameter>--with-tiff-dir[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3: pdflib 2.0 için tiff klasörü
     </para>
     <para>
     PHP 4: pdflib 3.x ve 4.x için tiff klasörü
     </para>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-ttf">
    <term>
     <parameter>--with-ttf[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3, PHP 4: FreeType deste&gbreve;ini ekler.
     </para>
    </listitem>
   </varlistentry>
   <varlistentry id="install.configure.with-xpm-dir">
    <term>
     <parameter>--with-xpm-dir[=DIR]</parameter>
    </term>
    <listitem>
     <para>
     PHP 3: seçenek PHP 3 için mevcut de&gbreve;il
     </para>
     <para>
     PHP 4: gd-1.8+ için xpm klasörü
     </para>
    </listitem>
   </varlistentry>
  </variablelist>
 </sect2>

 <sect2 id="install.configure.misc">
  <title>Di&gbreve;er</title>
   <para>
   Bu seçenekler zamanla gerekti&gbreve;i biçimde s&inodot;n&inodot;fland&inodot;r&inodot;lacakt&inodot;r.
   </para>

   <variablelist>

    <varlistentry id="install.configure.gmp">
     <term>
      <parameter>--with-gmp</parameter>
     </term>
     <listitem>
      <para>
      PHP 3, PHP 4: GMP deste&gbreve;ini ekler.
      </para>
     </listitem>
    </varlistentry>

    <varlistentry id="install.configure.disable-bcmath">
     <term>
      <parameter>--disable-bcmath</parameter>
     </term>
     <listitem>
      <para>
      PHP 3: Derlemeyi BC soyut matematik fonksiyonlar&inodot; olmadan yap.
      Bu fonksiyonlar size bilinen tamsay&inodot; ve gerçel say&inodot;lar&inodot;n d&inodot;&scedil;&inodot;ndaki say&inodot;larla
      i&scedil;lem yapma imkan&inodot; sa&gbreve;lar. <link linkend="ref.bc">BCMath Arbitrary Precision
       Mathematics Functions</link> linkinden daha fazla bilgiye ula&scedil;abilirsiniz.
      </para>
      <para>
      PHP 4: Seçenek mevcut de&gbreve;il, bcmath öntan&inodot;ml&inodot; olarak derlenmez. Derlemek için
      <link
        linkend="install.configure.enable-bcmath">--enable-bcmath</link>
      kullanabilirsiniz.
      </para>
     </listitem>
    </varlistentry>

    <varlistentry id="install.configure.disable-display-source">
     <term>
      <parameter>--disable-display-source</parameter>
     </term>
     <listitem>
      <para>
      PHP 3: Kaynak kod gösterme deste&gbreve;i olmadan derle
      </para>
      <para>
       PHP 4: PHP 4 için mevcut de&gbreve;il
      </para>
     </listitem>
    </varlistentry>
     <varlistentry id="install.configure.disable-libtool-lock">
     <term>
      <parameter>--disable-libtool-lock</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: Kilitlemeyi kald&inodot;r (paralel kurulumlar&inodot; bozabilir)
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.disable-pear">
     <term>
      <parameter>--disable-pear</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: PEAR yükleme
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.disable-pic">
     <term>
      <parameter>--disable-pic</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: Payla&scedil;&inodot;mdaki nesneler için PIC i devre d&inodot;&scedil;&inodot; b&inodot;rak.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.disable-posix">
     <term>
      <parameter>--disable-posix</parameter>
     </term>
     <listitem>
      <para>
      PHP 3: Seçenek PHP 3 için mevcut de&gbreve;il; <link
       linkend="install.configure.without-posix">--without-posix</link>
       ba&gbreve;&inodot;na bak&inodot;n.
      </para>
      <para>
      PHP 4: POSIX-benzeri fonksiyonlar&inodot; devre d&inodot;&scedil;&inodot; b&inodot;rak&inodot;r.
      </para>
     </listitem>
    </varlistentry>
     <varlistentry id="install.configure.enable-pcntl">
      <term>
       <parameter>--enable-pcntl</parameter>
      </term>
      <listitem>
       <para>
	PHP 3: Seçenek PHP 3 için mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: &Idot;&scedil;lem kontrol fonksiyonlar&inodot;n&inodot; etkinle&scedil;tirir.
       (fork, waitpid, signal ve di&gbreve;erleri.)
       </para>
      </listitem>
     </varlistentry>
    <varlistentry id="install.configure.disable-rpath">
     <term>
      <parameter>--disable-rpath</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: Disable passing additional runtime library search paths
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.disable-session">
     <term>
      <parameter>--disable-session</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: Oturum deste&gbreve;ini devre d&inodot;&scedil;&inodot; b&inodot;rak&inodot;r.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-bcmath">
     <term>
      <parameter>--enable-bcmath</parameter>
     </term>
     <listitem>
      <para>
      PHP 3: PHP 3 için mevcut de&gbreve;il, bcmath öntan&inodot;ml&inodot; olarak derlenir. <link
       linkend="install.configure.disable-bcmath">--disable-bcmath</link>
       kullanarak devre d&inodot;&scedil;&inodot; b&inodot;rakabilirsiniz.
      </para>
      <para>
      PHP 4: bc tipi matematik fonksiyonlar&inodot;n&inodot; derleyebilirsiniz. README-BCMATH
      dosyas&inodot;n&inodot; okuyarak modülün nas&inodot;l kullan&inodot;laca&gbreve;&inodot;n&inodot; ö&gbreve;renebilirsiniz.
      Bu fonksiyonlar size bilinen tamsay&inodot;lar ve gerçel say&inodot;lar d&inodot;&scedil;&inodot;nda kalan say&inodot;larla
      çal&inodot;&scedil;ma olana&gbreve;&inodot; tan&inodot;r. <link linkend="ref.bc">BCMath Arbitrary Precision
       Mathematics Functions</link> adresinden daha fazla bilgiye ula&scedil;abilirsiniz.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-c9x-inline">
     <term>
      <parameter>--enable-c9x-inline</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: Seçenek PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: C9x-inline semantiklerini etkinle&scedil;tirir
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-calendar">
     <term>
      <parameter>--enable-calendar</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: Takvim çeviri fonksiyonlar&inodot;n&inodot; etkinle&scedil;tirir.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-debug">
     <term>
      <parameter>--enable-debug</parameter>
     </term>
     <listitem>
      <para>
       PHP 3, PHP 4: Hata ay&inodot;klama sembolleriyle birlikte derler
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-debugger">
     <term>
      <parameter>--enable-debugger</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: Uzaktan hata ay&inodot;klama özelli&gbreve;ini etkinle&scedil;tirir
      </para>
      <para>
       PHP 4: PHP 4 için mevcut de&gbreve;il
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-discard-path">
     <term>
      <parameter>--enable-discard-path</parameter>
     </term>
     <listitem>
      <para>
      PHP 3, PHP4: Etkinle&scedil;tirildi&gbreve;inde, PHP CGI binary dosyas&inodot; web a&gbreve;ac&inodot;n&inodot;n
      d&inodot;&scedil;&inodot;nda bir yere güvenle konulabilir, böylece .htaccess güvenli&gbreve;inden fazlas&inodot;
       sa&gbreve;lanm&inodot;&scedil; olur.      
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-dmalloc">
     <term>
      <parameter>--enable-dmalloc</parameter>
     </term>
     <listitem>
      <para>
      PHP 3, PHP 4: dmalloc etkinle&scedil;tirilir.
       PHP 3, PHP 4: Enable dmalloc
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-exif">
     <term>
      <parameter>--enable-exif</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: Exif deste&gbreve;i etkinle&scedil;tirilir.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-experimental-zts">
     <term>
      <parameter>--enable-experimental-zts</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: Bu büyük ihtimalle derlemenizi bozacakt&inodot;r.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-fast-install">
     <term>
      <parameter>--enable-fast-install[=PKGS]</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: H&inodot;zl&inodot; kurulum için iyile&scedil;tir [öntan&inodot;ml&inodot;=evet]
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-force-cgi-redirect">
     <term>
      <parameter>--enable-force-cgi-redirect</parameter>
     </term>
     <listitem>
      <para> 
      PHP 3, PHP 4: &Idot;ç sunucu yönlendirmeleri için güvenlik sorgulamas&inodot;n&inodot;
      etkinle&scedil;tirir. Apache üzerinde CGI sürümünü kullan&inodot;yorsan&inodot;z etkinle&scedil;tirmelisiniz.
      </para>
     </listitem>
    </varlistentry>
     <varlistentry id="install.configure.enable-inline-optimization">
     <term>
      <parameter>--enable-inline-optimization</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
      PHP 4: Bolca haf&inodot;zan&inodot;z varsa ve gcc kullan&inodot;yorsan&inodot;z, bunu deneyebilirsiniz.
      </para>
     </listitem>
    </varlistentry>
     <varlistentry id="install.configure.enable-libgcc">
     <term>
      <parameter>--enable-libgcc</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: Seçenek PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: Enable explicitly linking against libgcc
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-maintainer-mode">
     <term>
      <parameter>--enable-maintainer-mode</parameter>
     </term>
     <listitem>
      <para>
       PHP 3, PHP 4: enable make rules and dependencies not useful (and
       sometimes confusing) to the casual installer
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-mbstr-enc-trans">
     <term>
      <parameter>--enable-mbstr-enc-trans</parameter>
     </term>
     <listitem>
      <para>
      PHP 4: http giri&scedil; karakterini otomatik incelemeyi etkinle&scedil;tirir ve
      multi-byte karakter kümelerinin çevirisini yapar.
      </para>
      <warning>
        <para>
	Yaln&inodot;zca PHP 4.0.6 ve üstü için geçerlidir.
        </para>
       </warning>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-mbstring">
     <term>
      <parameter>--enable-mbstring</parameter>
     </term>
     <listitem>
      <para>
      PHP 4: multi-byte karakter kümesi fonksiyonlar&inodot;n&inodot; etkinle&scedil;tirir.
      </para>
      <warning>
        <para>
	Yaln&inodot;zca PHP 4.0.6 ve üstü için geçerlidir.
        </para>
       </warning>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-memory-limit">
     <term>
      <parameter>--enable-memory-limit</parameter>
     </term>
     <listitem>
      <para>
      PHP 3, PHP 4: Haf&inodot;za s&inodot;n&inodot;r&inodot; deste&gbreve;i ile derle. [öntan&inodot;ml&inodot;=hay&inodot;r]
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-safe-mode">
     <term>
      <parameter>--enable-safe-mode</parameter>
     </term>
     <listitem>
      <para>
      PHP 3, PHP 4: Güvenli modu öntan&inodot;ml&inodot; olarak etkinle&scedil;tir
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-satellite">
     <term>
      <parameter>--enable-satellite</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
      PHP 4: Satellite üzerinden CORBA deste&gbreve;ini etkinle&scedil;tir (ORBit gerektirir).
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-shared">
     <term>
      <parameter>--enable-shared[=PKGS]</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: payla&scedil;&inodot;m kütüphanelerini yarat [öntan&inodot;ml&inodot;=yes]
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-sigchild">
     <term>
      <parameter>--enable-sigchild</parameter>
     </term>
     <listitem>
      <para>
      PHP 3, PHP 4: PHP'nin kendi SIGCHLD yöneticisin etkinle&scedil;tirir.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-static">
     <term>
      <parameter>--enable-static[=PKGS]</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: sabit kütüphaneleri yarat [öntan&inodot;ml&inodot;=yes]
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-sysvsem">
     <term>
      <parameter>--enable-sysvsem</parameter>
     </term>
     <listitem>
      <para>
      PHP 3, PHP 4: System V semaphore deste&gbreve;ini etkinle&scedil;tir.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-sysvshm">
     <term>
      <parameter>--enable-sysvshm</parameter>
     </term>
     <listitem>
      <para>
      PHP 3, PHP 4: System V haf&inodot;za payla&scedil;&inodot;m&inodot; deste&gbreve;ini etkinle&scedil;tir.
      </para>
     </listitem>
    </varlistentry>
    <varlistentry id="install.configure.enable-trans-sid">
     <term>
      <parameter>--enable-trans-sid</parameter>
     </term>
     <listitem>
      <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
      </para>
      <para>
       PHP 4: Transparan oturum numaras&inodot; geçi&scedil;ini etkinle&scedil;tir.
      </para>
     </listitem>
    </varlistentry>

     <varlistentry id="install.configure.with-cdb">
      <term>
       <parameter>--with-cdb[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: CDB deste&gbreve;ini etkinle&scedil;tir
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-config-file-path">
      <term>
       <parameter>--with-config-file-path=PATH</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: php3.ini için bak&inodot;lacak yolu belirtir. Öntan&inodot;ml&inodot; de&gbreve;eri
        <filename>/usr/local/lib</filename> dir.
       </para>
       <para>
       PHP 4: php.ini için bak&inodot;lacak yolu belirtir. Öntan&inodot;ml&inodot; de&gbreve;eri
        <filename>/usr/local/lib</filename> dir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-cpdflib">
      <term>
       <parameter>--with-cpdflib[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: ClibPDF deste&gbreve;ini etkinle&scedil;tirir. DIR, ClibPDF kurulum klasörüdür.
       Öntan&inodot;ml&inodot; de&gbreve;eri /usr/local dir.
       </para>
       <para>
       PHP 4: cpdflib deste&gbreve;ini ekler (cpdflib &gt;=2 gerektirir). DIR, cpdflib kurulum
       klasörüdür, öntan&inodot;ml&inodot; de&gbreve;eri /usr d&inodot;r.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-esoob">
      <term>
       <parameter>--with-esoob[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Seçenek PHP 3 için mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: Easysoft OOB deste&gbreve;ini etkinle&scedil;tirir. DIR, OOB kurulum klasörüdür.
       Öntan&inodot;ml&inodot; de&gbreve;eri /usr/local/easysoft/oob/client d&inodot;r.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-exec-dir">
      <term>
       <parameter>--with-exec-dir[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: DIR içindeki çal&inodot;&scedil;t&inodot;r&inodot;labilir dosyalar&inodot;n güvenli modda çal&inodot;&scedil;mas&inodot;n&inodot;
       sa&gbreve;la. Öntan&inodot;ml&inodot; de&gbreve;er /usr/local/php/bin dir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-fdftk">
      <term>
       <parameter>--with-fdftk[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: fdftk deste&gbreve;ini ekler. DIR, fdftk kurulum klasörüdür. Öntan&inodot;ml&inodot;
       de&gbreve;eri /usr/local dir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-gnu-ld">
      <term>
       <parameter>--with-gnu-ld</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: C derleyicisinin GNU ld kulland&inodot;&gbreve;&inodot;ndan emin ol [öntan&inodot;ml&inodot;=no]
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-icap">
      <term>
       <parameter>--with-icap[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: ICAP deste&gbreve;ini ekler
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-imap">
      <term>
       <parameter>--with-imap[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: IMAP deste&gbreve;ini ekler. DIR, IMAP include ve c-client.a için
       yer gösterir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-imsp">
      <term>
       <parameter>--with-imsp[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: IMSP deste&gbreve;ini ekler (DIR IMSP include klasörünü gösterir. Bu klasör libimsp.a
       dosyas&inodot;n&inodot; içermelidir).
       </para>
       <para>
       PHP 4: PHP 4 için seçenek mevcut de&gbreve;il
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-java">
      <term>
       <parameter>--with-java[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: Java deste&gbreve;ini ekler. DIR, JDK'n&inodot;n kurulu oldu&gbreve;u klasörü gösterir.
       Bu uzant&inodot; yaln&inodot;zca payla&scedil;&inodot;m (shared) olarak derlenebilir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-kerberos">
      <term>
       <parameter>--with-kerberos[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: PHP 3 için seçenek mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: IMAP için Kerberos deste&gbreve;ini ekler.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-mcal">
      <term>
       <parameter>--with-mcal[=DIR]</parameter>
      </term>
      <listitem>
      <para>
      PHP 3, PHP 4: MCAL deste&gbreve;ini ekler
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-mcrypt">
      <term>
       <parameter>--with-mcrypt[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: mcrypt deste&gbreve;ini ekler. DIR, mcrypt kurulum klasörüdür.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-mhash">
      <term>
       <parameter>--with-mhash[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: mhash deste&gbreve;ini ekler. DIR, mhash kurulum klasörünü gösterir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-mm">
      <term>
       <parameter>--with-mm[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: Oturum yönetimi için mm deste&gbreve;ini ekler
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-mod_charset">
      <term>
       <parameter>--with-mod_charset</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: mod_charset için tablo transferini etkinle&scedil;tirir (Rus Apache).
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-pdflib">
      <term>
       <parameter>--with-pdflib[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: pdflib deste&gbreve;ini ekler (0.6 ve 0.2 ile test edilmi&scedil;tir). DIR, pdflib
       kurulum klasörünü gösterir, öntan&inodot;ml&inodot; olarak <filename>/usr/local</filename>
       de&gbreve;erine e&scedil;ittir.
       </para>
       <para>
       PHP 4: pdflin 3.x/4.x deste&gbreve;ini ekler. DIR, pdfllib için kurulum klasörüdür,
       öntan&inodot;ml&inodot; de&gbreve;eri <filename>/usr/local</filename> de&gbreve;erine e&scedil;ittir.
       </para>
       <para>
       PHP 4 ve PDFlib 3.x/4.x sürümlerini kullanabilmek için JPEG ve TIFF
       kütüphanelerine sahip olman&inodot;z gereklidir. PHP'yi PDFlib deste&gbreve;i ile derlerken
	<link
	linkend="install.configure.with-jpeg-dir">--with-jpeg-dir</link>
	ve <link
	linkend="install.configure.with-tiff-dir">--with-tiff-dir</link>
	ayarlar&inodot;yla birlikte derleyin. Bunlara ek olarak
	<link
	linkend="install.configure.with-png-dir">--with-png-dir</link>
	ve <link
	linkend="install.configure.with-zlib-dir">--with-zlib-dir</link>
	kütüphaneleri de PNG ve Zlib deste&gbreve;i için eklenebilir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.enable-shared-pdflib">
      <term>
       <parameter>--enable-shared-pdflib</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: pdflib payla&scedil;&inodot;m (shared) kütüphanesi olarak derlenir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-readline">
      <term>
       <parameter>--with-readline[=DIR]</parameter>
      </term>
      <listitem>
       <para>
        PHP 3: Option not available in PHP 3
       </para>
       <para>
       PHP 4: Readline deste&gbreve;ini ekler. DIR, readline kurulum klasörüdür.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-regex">
      <term>
       <parameter>--with-regex=TYPE</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: PHP için bu seçenek mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: regex kütüphane tipi: system, apache, php
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-servlet">
      <term>
       <parameter>--with-servlet[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: servlet deste&gbreve;ini ekler. DIR, JSDK için kurulum klasörüdür.
       Bu SAPI, Java uzant&inodot;s&inodot;n&inodot;n payla&scedil;&inodot;m dl olarak derlenmesini gerektirir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-ming">
      <term>
       <parameter>--with-ming</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: PHP 3 için bu seçenek mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: Ming kütüphanesini kullanarak Flash 4 deste&gbreve;ini ekler.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-swf">
      <term>
       <parameter>--with-swf[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: PHP 3 için seçenek mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: swf deste&gbreve;ini ekler
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-system-regex">
      <term>
       <parameter>--with-system-regex</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Dahili regex kütüphanesini kullanma
       </para>
       <para>
       PHP 4: (kullan&inodot;m d&inodot;&scedil;&inodot;) Sistemdeki regex kütüphanesini kullan&inodot;r
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-tsrm-pth">
      <term>
       <parameter>--with-tsrm-pth[=pth-config]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: PHP 3 için seçenek mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: GNU pth kullan.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-tsrm-pthreads">
      <term>
       <parameter>--with-tsrm-pthreads</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: POSIX ilmeklerini kullan (öntan&inodot;ml&inodot;)
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-x">
      <term>
       <parameter>--with-x</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: X Pencere Yöneticisini kullan
       </para>
       <para>
       PHP 4: PHP 4 için mevcut de&gbreve;il
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-bzip2">
      <term>
       <parameter>--with-bz2[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 4: bzip2 deste&gbreve;ini ekler. DIR, bzip2 klasörünü gösterir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-zlib-dir">
      <term>
       <parameter>--with-zlib-dir[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: pdflib 2.0 için ya da zlib deste&gbreve;ini eklemek için zlib kütüphanesinin yerini
       gösterir.
       </para>
       <para>
       PHP 4: pdflib 3.x/4.x için ya da zlib deste&gbreve;ini eklemek için zlib kütüphanesinin
       yerini gösterir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-zlib">
      <term>
       <parameter>--with-zlib[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: zlib deste&gbreve;ini ekler (zlib &gt;= 1.0.9 gerektirir). DIR, zlib
       kurulum klasörüdür, öntan&inodot;ml&inodot; de&gbreve;eri /usr a e&scedil;ittir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-zip">
      <term>
       <parameter>--with-zip[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 4: zip deste&gbreve;ini ekler (zziplib &gt;= 0.10.6 gerektirir). DIR
       zziplib kurulum klasörüdür, öntan&inodot;ml&inodot; de&gbreve;eri /usr/local dir.
       </para>
       <para>
       zziplib'in son sürümü <ulink
	url="&url.zziplib;">&url.zziplib;</ulink> adresinde bulunabilir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.without-pcre-regex">
      <term>
       <parameter>--without-pcre-regex</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Perl Uyumlu Regular Expressions deste&gbreve;ini kurmaz.
       </para>
       <para>
       PHP 4: Perl Uyumlu Regular Expressions deste&gbreve;ini kurmaz. 
       --with-pcre-regex=DIR kullan&inodot;m&inodot; ile PCRE için include ve kütüphane klasörlerini
       belirtebilirsiniz.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.without-posix">
      <term>
       <parameter>--without-posix</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: POSIX fonksiyonlar&inodot;n&inodot; eklemez.
       </para>
       <para>
       PHP 4: PHP 4 için bu seçenek mevcut de&gbreve;il; <link
         linkend="install.configure.disable-posix">--disable-posix</link>
        kullan&inodot;n.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.enable-overload">
      <term>
       <parameter>--enable-overload</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: Nesne özellik ve method overloading deste&gbreve;ini etkinle&scedil;tirir.
       </para>
      </listitem>
     </varlistentry>
    </variablelist>
   </sect2>

   <sect2 id="install.configure.networking">
    <title>A&gbreve;</title>

    <variablelist>
     <varlistentry id="install.configure.with-curl">
      <term>
       <parameter>--with-curl[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: CURL deste&gbreve;ini ekler.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.enable-ftp">
      <term>
       <parameter>--enable-ftp</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Seçenek mevcut de&gbreve;il, <link
         linkend="install.configure.with-ftp">--with-ftp</link>
        kullan&inodot;n.
       </para>
       <para>
        PHP 4: FTP deste&gbreve;ini etkinle&scedil;tirir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-ftp">
      <term>
       <parameter>--with-ftp</parameter>
      </term>
      <listitem>
       <para>
        PHP 3: FTP deste&gbreve;ini ekler.
       </para>
       <para>
        PHP 4: Seçenek mevcut de&gbreve;il <link
         linkend="install.configure.enable-ftp">--enable-ftp</link>
        kullan&inodot;n.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.disable-url-fopen-wrapper">
      <term>
       <parameter>--disable-url-fopen-wrapper</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: Dosyalara http ya da ftp üzerinden eri&scedil;ime imkan sa&gbreve;layan
       URL-duyarl&inodot; fopen okuyucusunu devre d&inodot;&scedil;&inodot; b&inodot;rak&inodot;r.
       </para>
       <warning>
        <para>
	Bu seçenek yaln&inodot;zca 4.0.3 sürümüne kadar olan PHP sürümlerinde
	mevcuttur, yeni sürümler yeni bir INI parametresi olan
	<parameter>allow_url_fopen</parameter> yi sa&gbreve;larlar, böylece
	bu özelli&gbreve;in olup olmamas&inodot;na kurulum a&scedil;amas&inodot;nda karar vermekten
	kurtulursunuz.
        </para>
       </warning>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-mod-dav">
      <term>
       <parameter>--with-mod-dav=DIR</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: Apache'in mod_dav deste&gbreve;i üzerinden DAV deste&gbreve;ini ekler.
       DIR, mod_dav kurulum klasörünü gösterir (yaln&inodot;zca Apache modül sürümü!)
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-openssl">
      <term>
       <parameter>--with-openssl[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: SNMP için OpenSSL deste&gbreve;ini ekler.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-snmp">
      <term>
       <parameter>--with-snmp[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: SNMP deste&gbreve;ini ekler. DIR, SNMP kurulum klasörüdür.
       Öntan&inodot;ml&inodot; olarak snmp kurulumunun olma ihtimalinin bulundu&gbreve;u klasörleri
       ara&scedil;t&inodot;r&inodot;r. DIR de&gbreve;erini shared yaparak dl olarak derlenmesini sa&gbreve;layabilirsiniz,
       ya da shared, DIR komutunu vererek hem shared kurulum yap&inodot;lmas&inodot;n&inodot; hem
       de DIR belirtilmesini sa&gbreve;layabilirsiniz.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.enable-ucd-snmp-hack">
      <term>
       <parameter>--enable-ucd-snmp-hack</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: UCD SNMP'yi etkinle&scedil;tirir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.enable-sockets">
      <term>
       <parameter>--enable-sockets</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Seçenek PHP 3 için mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: Soket deste&gbreve;ini etkinle&scedil;tirir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-yaz">
      <term>
       <parameter>--with-yaz[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Seçenek PHP 3 için mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: YAZ deste&gbreve;ini ekler (ANSI(NISO Z39.50). DIR YAZ bin
       kurulum klasörüdür.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.enable-yp">
      <term>
       <parameter>--enable-yp</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Seçenek mevcut de&gbreve;il; <link
         linkend="install.configure.with-yp">--with-yp</link> kullan&inodot;n.
       </para>
       <para>
       PHP 4: YP deste&gbreve;ini ekler
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-yp">
      <term>
       <parameter>--with-yp</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: YP deste&gbreve;ini ekler
       </para>
       <para>
       PHP 4: Seçenek mevcut de&gbreve;il, <link
         linkend="install.configure.enable-yp">--enable-yp</link>
        kullan&inodot;n.
       </para>
      </listitem>
     </varlistentry>
     
     <varlistentry id="install.configure.with-mnogosearch">
      <term>
       <parameter>--with-mnogosearch</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: mnoGoSearch deste&gbreve;ini ekler.
       </para>
      </listitem>
     </varlistentry>
    </variablelist>

   </sect2>

   <sect2 id="install.configure.php">
    <title>PHP Davran&inodot;&scedil;lar&inodot;</title>

    <variablelist>
     <varlistentry id="install.configure.enable-magic-quotes">
      <term>
       <parameter>--enable-magic-quotes</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: Magic quotes özelli&gbreve;ini öntan&inodot;ml&inodot; olarak etkinle&scedil;tirir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.disable-short-tags">
      <term>
       <parameter>--disable-short-tags</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: K&inodot;salt&inodot;lm&inodot;&scedil; &lt;? ba&scedil;lang&inodot;ç etiketini öntan&inodot;ml&inodot; olarak
       devre d&inodot;&scedil;&inodot; b&inodot;rak&inodot;r.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.enable-track-vars">
      <term>
       <parameter>--enable-track-vars</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: GET/POST/Çerez takip de&gbreve;i&scedil;kenlerini önyüklü olarak etkinle&scedil;tirir.
       </para>
       <para>
       PHP 4: Seçenek PHP 4 için mevcut de&gbreve;il; PHP 4.0.2 sürümünden itibaren,
       track_vars sürekli etkindir.
       </para>
      </listitem>
     </varlistentry>
    </variablelist>

   </sect2>

   <sect2 id="install.configure.servers">
    <title>Sunucu</title>
    
    <variablelist>
     <varlistentry id="install.configure.with-aolserver-src">
      <term>
       <parameter>--with-aolserver-src=DIR</parameter>
      </term>
      <listitem>
       <para>
        PHP 3: Seçenek mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: AOLsunucu için yolu belirtir
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-aolserver">
      <term>
       <parameter>--with-aolserver=DIR</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Seçenek mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: AOLsunucu için yolu belirtir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-apache">
      <term>
       <parameter>--with-apache[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: Apache modülünü yükler. DIR, Apache için en üst klasör yolunu
       gösterir, öntan&inodot;ml&inodot; olarak /ust/local/etc/httpd dir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-apxs">
      <term>
       <parameter>--with-apxs[=FILE]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: Shared Apache modülünü yükler. FILE, Apache apxs arac&inodot;
       için seçime ba&gbreve;l&inodot; yolu gösterir, öntan&inodot;ml&inodot; de&gbreve;er apxs dir.
       </para>
      </listitem>
     </varlistentry>
     
     <varlistentry id="install.configure.enable-versioning">
      <term>
       <parameter>--enable-versioning</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Solaris 2.x ve Linux taraf&inodot;ndan sa&gbreve;lanan sürümleme özelli&gbreve;inden
       yararlan&inodot;r.
       </para>
       <para>
       PHP 4: Yaln&inodot;zca gerekli sembolleri al&inodot;r. INSTALL dosyas&inodot;ndan daha fazla
       bilgi alabilirsiniz.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-caudium">
      <term>
       <parameter>--with-caudium[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Seçenek mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: PHP'yi Cadium websunucusu ile çal&inodot;&scedil;abilmesi için Pike modülü
       olarak yükler. DIR, Cadium ana klasörüdür. Klasör belirtilmemi&scedil;se
       $prefix/caudium/server kullan&inodot;l&inodot;r. Önek --prefix ayar&inodot; ile kontrol edilir ve
       öntan&inodot;ml&inodot; olarak /usr/local dir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-fhttpd">
      <term>
       <parameter>--with-fhttpd[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: fhttpd modülünü yokler. DIR, fhttpd kaynak klasörüdür.
       Öntan&inodot;ml&inodot; de&gbreve;eri /usr/local/src/fhttpd dir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-nsapi">
      <term>
       <parameter>--with-nsapi=DIR</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Seçenek mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: Kurulu Netscape'in yolunu belirtir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-phttpd">
      <term>
       <parameter>--with-phttpd=DIR</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Seçenek mevcut de&gbreve;il
       </para>
       <para>
        PHP 4: 
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-pi3web">
      <term>
       <parameter>--with-pi3web=DIR</parameter>
      </term>
      <listitem>
       <para>
        PHP 3: Seçenek mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: Pi3Web ile kullan&inodot;labilmesi için PHP'yi modül olarak yükler.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-roxen">
      <term>
       <parameter>--with-roxen=DIR</parameter>
      </term>
      <listitem>
       <para>
        PHP 3: Seçenek mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: PHP'yi Pike modülü olarak derler. DIR, Roxen ana klasörüdür,
       normal yeri /usr/local/roxen/server d&inodot;r.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.enable-roxen-zts">
      <term>
       <parameter>--enable-roxen-zts</parameter>
      </term>
      <listitem>
       <para>
        PHP 3: Mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: Roxen modülünü Zend Thread Safety ile derler.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-thttpd">
      <term>
       <parameter>--with-thttpd=SRCDIR</parameter>
      </term>
      <listitem>
       <para>
        PHP 3: Seçenek mevcut de&gbreve;il
       </para>
       <para>
        PHP 4: 
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-zeus">
      <term>
       <parameter>--with-zeus=DIR</parameter>
      </term>
      <listitem>
       <para>
        PHP 3: Seçenek mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: PHP'yi Zeus ile birlikte kullan&inodot;labilmesi için ISAPI modülü olarak derler.
       </para>
      </listitem>
     </varlistentry>
    </variablelist>
    
   </sect2>

   <sect2 id="install.configure.text">
    <title>Metin ve dil</title>
 
    <variablelist>
     <varlistentry id="install.configure.with-aspell">
      <term>
       <parameter>--with-aspell[=DIR]</parameter>
      </term>
      <listitem>
       <para>
        PHP 3, PHP 4: ASPELL deste&gbreve;ini ekler.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-gettext">
      <term>
       <parameter>--with-gettext[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: GNU gettext deste&gbreve;ini ekler. DIR, gettext kurulum klasörünü
       gösterir, öntan&inodot;ml&inodot; de&gbreve;eri /usr/local dir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-iconv">
      <term>
       <parameter>--with-iconv[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Seçenek mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: iconv deste&gbreve;ini ekler.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-pspell">
      <term>
       <parameter>--with-pspell[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Seçenek mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: PSPELL deste&gbreve;ini ekler.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-recode">
      <term>
       <parameter>--with-recode[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: GNU recode deste&gbreve;ini ekler.
       </para>
       <para>
       PHP 4: recode deste&gbreve;ini ekler. DIR, recode kurulum klasörüdür.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.enable-shmop">
      <term>
       <parameter>--enable-shmop</parameter>
      </term>
      <listitem>
       <para>
       PHP 3, PHP 4: shmop deste&gbreve;ini etkinle&scedil;tirir.
       </para>
      </listitem>
     </varlistentry>
     
    </variablelist>

   </sect2>
   
   <sect2 id="install.configure.xml">
    <title>XML</title>

    <variablelist>   
     <varlistentry id="install.configure.with-dom">
      <term>
       <parameter>--with-dom[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: DOM deste&gbreve;ini ekler (libxml &gt;= 2.0 gerektirir). DIR, libxml
       kurulum klasörünü gösterir, öntan&inodot;ml&inodot; de&gbreve;eri <filename>/usr</filename> d&inodot;r.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.enable-sablot-errors-descriptive">
      <term>
       <parameter>--enable-sablot-errors-descriptive</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: Tan&inodot;mlanabilir hatalar&inodot; etkinle&scedil;tirir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-sablot">
      <term>
       <parameter>--with-sablot[=DIR]</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: Mevcut de&gbreve;il
       </para>
       <para>
       PHP 4: Sablotron deste&gbreve;ini etkinle&scedil;tirir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.enable-wddx">
      <term>
       <parameter>--enable-wddx</parameter>
      </term>
      <listitem>
       <para>
        PHP 3: Mevcut de&gbreve;il
       </para>
       <para>
        PHP 4: WDDX deste&gbreve;ini etkinle&scedil;tirir.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.disable-xml">
      <term>
       <parameter>--disable-xml</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: PHP 3 için mevcut de&gbreve;il, XML deste&gbreve;i önyüklü de&gbreve;ildir.
        Yüklemek için <link
         linkend="install.configure.with-xml">--with-xml</link>
        kullan&inodot;n.
       </para>
       <para>
       PHP 4: Önyüklü expat lib kullan&inodot;larak XML deste&gbreve;ini verilmesini devre d&inodot;&scedil;&inodot; b&inodot;rak&inodot;r.
       </para>
      </listitem>
     </varlistentry>

     <varlistentry id="install.configure.with-xml">
      <term>
       <parameter>--with-xml</parameter>
      </term>
      <listitem>
       <para>
       PHP 3: XML deste&gbreve;ini ekler
       </para>
       <para>
        PHP 4: XML deste&gbreve;i önyüklü olarak mevcuttur. Kald&inodot;rmak için
        <link
         linkend="install.configure.disable-xml">--disable-xml</link> to
        kullan&inodot;n.
       </para>
      </listitem>
     </varlistentry>
    </variablelist>
   </sect2>

  </sect1>

  <sect1 id="install.windows">
   <title>Windows alt&inodot;nda kurulum</title>
   <para>
   Bu bölüm Windows 95/98/ME ve Windows NT/2000/XP kullan&inodot;c&inodot;lar&inodot;na
   yöneliktir. PHP Windows 3.1 gibi 16 bit platformlarda çal&inodot;&scedil;mamaktad&inodot;r. Zaman
   zaman desteklenen Windows platformlar&inodot; yerine Win32 sözcü&gbreve;ünü kulland&inodot;k.
   </para>
   <para>
   PHP'yi Windows alt&inodot;nda kurmak için iki ana yöntem mevcut; ya
    <link linkend="install.windows.manual">elle</link>
    ya da <link linkend="install.windows.installer">InstallShield</link>
    kullanarak.
   </para>
   <para>
   Microsoft Visual Studio uygulamas&inodot;na sahipseniz, PHP'yi kaynak kodundan
    <link linkend="install.windows.build">derleyebilirsiniz</link>.
   </para>
   <para>
   PHP'yi bir defa sisteminize kurduktan sonra, <link linkend="install.windows.extensions">farkl&inodot; uzant&inodot;lar&inodot;</link>
   deneyebilirsiniz.
   </para>
   
   <sect2 id="install.windows.installer">
    <title>Windows InstallShield</title>
    
    <para>
    Windows PHP yükleyicisi <ulink url="&url.php;">&url.php;</ulink>, 
    adresindeki indirme sayfas&inodot;ndan edinilebilir. Bu yükleyici PHP'nin CGI sürümünü
    kuracak ve IIS, PWS ve Xitami sunucular&inodot; için kullan&inodot;ma haz&inodot;r hale getirecektir.
    Öte yandan, InstallShield yükleyicisi PHP kurulumunu kolayla&scedil;t&inodot;rmakla birlikte,
    birçok yönden k&inodot;s&inodot;tlay&inodot;c&inodot; olabilir, örne&gbreve;in uzant&inodot;lar&inodot;n otomatik olarak yüklenmesi
    desteklenmemektedir.
    </para>
    
    <simpara>
     Kullanmak istedi&gbreve;iniz<acronym>HTTP</acronym> sunucunuzu sisteminize
     yükleyin ve çal&inodot;&scedil;t&inodot;&gbreve;&inodot;ndan emin olun.
    </simpara>
    
    <simpara>
    Kurulum dosyas&inodot;n&inodot; çal&inodot;&scedil;t&inodot;r&inodot;n ve size sorulan sorular&inodot; cevaplay&inodot;n. &Idot;ki farkl&inodot; tipte
    kurulum desteklenmektedir - standart, bütün ayarlar öntan&inodot;ml&inodot; de&gbreve;erler gözetilerek
    yap&inodot;l&inodot;r, ve ileri düzey, sizin verdi&gbreve;iniz cevaplar üzerinden yap&inodot;l&inodot;r.
    </simpara>
    
    <simpara>
    Kurulum sihirbaz&inodot; <filename>php.ini</filename> için gerekli veriyi toplar ve
    web sunucusunu PHP'ye haz&inodot;r hale getirir. NT üzerindeki IIS ve PWS için,
    script map ayarlar&inodot; ile ilgili liste görüntülenir ve sizden yapmak istedi&gbreve;iniz eklenti
    hakk&inodot;nda bilgi al&inodot;n&inodot;r.
    </simpara>

    <simpara>
    Kurulum bir defa tamamland&inodot;ktan sonra, sihirbaz sizden sistemi yeniden
    ba&scedil;latman&inodot;z&inodot; isteyecek, sisteminizi yeniden ba&scedil;lat&inodot;n ve PHP'yi kullanmaya ba&scedil;lay&inodot;n.
    </simpara>
    
    <warning>
     <para>
     PHP'nin bu &scedil;ekilde kurulumunun güvenli olmad&inodot;&gbreve;&inodot;n&inodot; unutmay&inodot;n.
     E&gbreve;er güvenli bir PHP kurulumu istiyorsan&inodot;z, elle kurulum yöntemini izlemeli
     ve her seçene&gbreve;i dikkatle gözden geçirmelisiniz. Bu otomatik kurulum size
     PHP'yi h&inodot;zl&inodot; ve sorunsuz biçimde kullanma imkan&inodot; sa&gbreve;lar, ancak bu online
     sunucularda kullan&inodot;ma da haz&inodot;rd&inodot;r anlam&inodot;na gelmemelidir.
     </para>
    </warning>
   
   </sect2>
   
   <sect2 id="install.windows.manual">
    <title>Elle Kurulum Ad&inodot;mlar&inodot;</title>
    <simpara>
    Bu kurulum rehberi size PHP'yi Windows web sunucunuzda kurup ayarlayabilmeniz
    için yard&inodot;mc&inodot; olacakt&inodot;r. <ulink url="&url.php;">&url.php;</ulink>.
    adresinden PHP'nin binary zip sürümünü indirmeniz gereklidir. Bu rehberin
    orjinal sürümü &link.bob; taraf&inodot;ndan haz&inodot;rlanm&inodot;&scedil;t&inodot;r ve <ulink
     url="&url.win32install;">&url.win32install;</ulink> adresinde bulunabilir.
    </simpara>
    <para>
    Bu rehber a&scedil;a&gbreve;&inodot;daki elle kurulum yöntemlerini destekler:
     <itemizedlist>
      <listitem>
       <para>
       Ki&scedil;isel Web Sunucusu 3 ve 4 ya da daha yenisi
       </para>
      </listitem>
      <listitem>
       <para>
       Internet Information Server 3 veya 4 ya da daha yenisi
       </para>
      </listitem>
      <listitem>
       <para>
       Apache 1.3.x
       </para>
      </listitem> 
      <listitem>
       <para>
       OmniHTTPd 2.0b1 ve yukars&inodot;
       </para>
      </listitem>
      <listitem>
       <para>
       Oreilly Website Pro
       </para>
      </listitem>
      <listitem>
       <para>
        Xitami
       </para>
      </listitem>
      <listitem>
       <para>
        Netscape Enterprise Server, iPlanet
       </para>
      </listitem>
     </itemizedlist>
    </para>
    <para>
    Windows için PHP 4 iki farkl&inodot; &scedil;ekilde gelir - bir CGI çal&inodot;&scedil;t&inodot;r&inodot;labiliri (php.exe),
    ve birkaç SAPI modülü (örne&gbreve;in: php4isapi.dll). Sonraki &scedil;ekil PHP 4 için daha
    yenidir, ve ciddi anlamda performans ve yeni özellik getirisi sa&gbreve;lar.
    </para>
    <warning>
     <para>
     Öte yandan, SAPI modüllerinin henüz üretim kalitesinde <emphasis>OLMADI&Gbreve;INI</emphasis>
      bilmelisiniz. Genelde, ISAPI modülü ile özellikle W2K platformu d&inodot;&scedil;&inodot;ndaki ortamlarda
      ciddi problemler ya&scedil;ayabilirsiniz.- &Scedil;imdiden ASP gibi di&gbreve;er birçok modülün de
      kurtulamad&inodot;&gbreve;&inodot; bir sürü 500 hatas&inodot;yla kar&scedil;&inodot;la&scedil;maya haz&inodot;rl&inodot;kl&inodot; olun. Uyarmad&inodot; demeyin!
     </para>
     <para> 
     Bu çak&inodot;lmalar&inodot;n nedeni, PHP SAPI modülünün PHP kodunun thread-safe sürümünü
     kullanmalar&inodot;d&inodot;r. Bu yöntem PHP 4 için yenidir, ve henüz tamamen kararl&inodot; denebilmesi
     için yeterli anlamda test edilememi&scedil;tir, ve birkaç bilinen hata ta&scedil;&inodot;maktad&inodot;r.
     Öte yandan, baz&inodot; ki&scedil;iler SAPI modüllerini kullanarak oldukça iyi sonuçlar elde etmi&scedil;lerdir,
     ancak biz bu modülleri üretim a&scedil;amas&inodot;nda kullanan siteler olup olmad&inodot;&gbreve;&inodot;nu bilmiyoruz.
     K&inodot;saca - kararl&inodot;l&inodot;k sizin için vazgeçilmezse, SAPI modüllerinin performans&inodot; ile CGI
     çal&inodot;&scedil;t&inodot;r&inodot;labilirinin kararl&inodot;l&inodot;&gbreve;&inodot;n&inodot; takas edin.
     </para>
    </warning>
    <para>
    E&gbreve;er SAPI modüllerinden birini kullanmaya karar verir ve Windows 95 kullan&inodot;rsan&inodot;z,
     <ulink
     url="&url.dcom.update;">Microsoft DCOM sayfalar&inodot;</ulink>ndan DCOM
     güncellemesini indirip kurun. ISAPI modülü için, ISAPI 4.0 ile uyumlu bir
     web sunucusu gereklidir (IIS 4.0, PWS 4.0 ve IIS 5.0 ile test edilmi&scedil;tir). IIS 3.0
     <emphasis>DESTEKLENMEMEKTED&Idot;R</emphasis>. E&gbreve;er gerçek PHP
     deste&gbreve;i istiyorsan&inodot;z, IIS 4.0 içeren Windows NT 4.0 Option Pack'i indirip
     kurmal&inodot;s&inodot;n&inodot;z.
    </para>
    <para>
    A&scedil;a&gbreve;&inodot;daki ad&inodot;mlar bütün kurulumlar için istisnas&inodot;z yap&inodot;lmal&inodot;d&inodot;r.
     <itemizedlist>
      <listitem>
       <para>
       S&inodot;k&inodot;&scedil;t&inodot;r&inodot;lm&inodot;&scedil; dosyay&inodot; kendi iste&gbreve;inize göre bir klasöre aç&inodot;n.
        &quot;c:\php\&quot; iyi bir ba&scedil;lang&inodot;ç olacakt&inodot;r.
       </para>
      </listitem>
      <listitem>
       <para>
       PHP'nin kulland&inodot;&gbreve;&inodot; dll dosyalar&inodot;n&inodot; bulabilece&gbreve;inden emin olmal&inodot;s&inodot;n&inodot;z.
       Kullan&inodot;lan DLL dosyalar&inodot; hangi web sunucusunu kulland&inodot;&gbreve;&inodot;n&inodot;za ve CGI m&inodot; yoksa
       sunucu modülü mü tercih etti&gbreve;inize göre de&gbreve;i&scedil;ir. <filename>php4ts.dll</filename>
       her durumda kullan&inodot;l&inodot;r. E&gbreve;er bir sunucu modülü kullan&inodot;yorsan&inodot;z (ISAPI veya Apache gibi)
       bu durumda <filename>sapi</filename> klasöründeki DLL'ler kullan&inodot;lacakt&inodot;r.
       E&gbreve;er bir PHP uzant&inodot;s&inodot; kullan&inodot;yorsan&inodot;z, bunlara yine ihtiyac&inodot;n&inodot;z olacak.
       DLL'lerin bulunaca&gbreve;&inodot;ndan emin olmak için, bu dosyalar&inodot; sistem klasörüne
       (örn. <filename>winnt/system32</filename> ya da
        <filename>windows/system</filename>) kopyalayabilir ya da hepsinin kulland&inodot;&gbreve;&inodot;n&inodot;z
	sunucu tipine göre php.exe ya da ilgili sunucu modülü ile ayn&inodot; klasöre ta&scedil;&inodot;yabilirsiniz.
       </para>
       <para>
       PHP çal&inodot;&scedil;t&inodot;r&inodot;labiliri, SAPI modülleri ve baz&inodot; uzant&inodot;lar çal&inodot;&scedil;abilmek için d&inodot;&scedil; DLL
       dosyalar&inodot;na ba&gbreve;&inodot;ml&inodot;d&inodot;rlar. 
       BU DLL dosyalar&inodot;n&inodot;n Windows PATH'ine dahil bir klasörde olduklar&inodot;ndan emin olun.
       Bunu yapman&inodot;n en iyi yolu, bu dosyalar&inodot; sistem klasörünüzün alt&inodot;na atmakt&inodot;r. Genellikle bu
         <simplelist>
         <member>Windows 9X/ME için c:\windows\system</member>
         <member>Windows NT/2000/XP için c:\winnt\system32</member>
        </simplelist>
        Kopyalanmas&inodot; gereken dosyalar:
        <simplelist>
         <member>
          &apos;php4ts.dll&apos;, mevcutsa üstüne yazd&inodot;r&inodot;n.
         </member>
         <member>
	 Da&gbreve;&inodot;t&inodot;m&inodot;n&inodot;za ait dosyalar&inodot;n ait oldu&gbreve;u &apos;dll&apos; klasörü.
          Bu dosyalar zaten sisteminizde yüklüyse, yaln&inodot;zca bir &scedil;eylerin düzgün çal&inodot;&scedil;mamas&inodot;
	  durumunda üzerlerine yazd&inodot;r&inodot;n. (Üzerlerine yazd&inodot;rmadan önce,
          yedeklerini alman&inodot;zda ya da ba&scedil;ka bir klasöre ta&scedil;&inodot;man&inodot;zda fayda var - bir &scedil;eylerin
	  yolunda gitmeme durumuna kar&scedil;&inodot;.
          </member>
        </simplelist>
       </para>
       <para>
       Platformunuz için Microsoft Data Access Components (MDAC) uygulamas&inodot;n&inodot;n
       son sürümünü indirin. Özellikle Microsoft 9X/NT4 kullan&inodot;c&inodot;lar&inodot;n&inodot;n yapmas&inodot;nda
       fayda var. MDAC'&inodot; <ulink url="&url.mdac;">&url.mdac;</ulink> adresinde
       bulabilirsiniz.
       </para>
      </listitem>
      <listitem>
       <para>
       Tercih etti&gbreve;iniz ini dosyas&inodot;n&inodot; (a&scedil;a&gbreve;&inodot;ya bak&inodot;n) Windows 9X/ME kullan&inodot;yorsan&inodot;z
       &apos;%WINDOWS%&apos; klasörüne, Windows NT/2000/XP kullan&inodot;yorsan&inodot;z
       &apos;%SYSTEMROOT%&apos; klasörüne kopyalay&inodot;n ve ismini
       <filename>php.ini</filename> olarak de&gbreve;i&scedil;tirin.
       &apos;%WINDOWS%&apos ya da &apos;%SYSTEMROOT%&apos;
       klasörlerinin genel olarak bulunduklar&inodot; yerler:
        <simplelist>
         <member>Windows 9x/Me için c:\windows</member>
         <member>NT/2000/XP sunucular&inodot; için c:\winnt ya da c:\winnt40</member>
        </simplelist>
       </para>  
       <para>
       Zip dosyas&inodot; ile birlikte iki farkl&inodot; ini dosyas&inodot; gelir, <filename>php.ini-dist</filename> ve
        <filename>php.ini-optimized</filename>. Size önerimiz 
	<filename>php.ini-optimized</filename> dosyas&inodot;n&inodot; kullanman&inodot;z, çünkü
	bu dosyadaki ayarlar performans ve güvenlik dü&scedil;ünülerek haz&inodot;rlanm&inodot;&scedil;t&inodot;r.
	Yap&inodot;lacak en iyi i&scedil;, bütün dosyay&inodot; incelemek ve <link linkend="configuration.file">ini
        ayarlar&inodot;</link>n&inodot;n her birini tek tek elle onaylamakt&inodot;r. Güvenli&gbreve;i son s&inodot;n&inodot;r&inodot;na
	ç&inodot;karmak istiyorsan&inodot;z, bu yolu izleyebilirsiniz, öte yandan PHP öntan&inodot;ml&inodot; ini
	dosyalar&inodot;yla sorunsuz biçimde çal&inodot;&scedil;maktad&inodot;r.
       </para>
      </listitem>
      <listitem>
       <para>
       Yeni &apos;;php.ini&apos; dosyan&inodot;z&inodot; düzenleyin:
        <itemizedlist>
         <listitem>
          <simpara>
	'extension_dir' ayar&inodot;n&inodot; php-kurulum-klasörünün ya da php_*.dll dosyalar&inodot;
	klasörünün yerini gösterecek biçimde de&gbreve;i&scedil;tirmelisiniz. örn: c:\php\extensions
          </simpara>
         </listitem>
         <listitem>
          <simpara>
	  OmniHTTPd'yi kullanmay&inodot; seçtiyseniz, &scedil;imdiki ad&inodot;m&inodot; atlay&inodot;n.
	  'doc_root' ayar&inodot;n&inodot; de&gbreve;i&scedil;tirin ve web sunucunuzun document_root de&gbreve;erini
	  yaz&inodot;n. Örne&gbreve;in: c:\apache\htdocs ya da c:\webroot
          </simpara>
         </listitem>
         <listitem>
          <simpara>
	  PHP ba&scedil;lad&inodot;&gbreve;&inodot;nda hangi uzant&inodot;lar&inodot;n yüklenece&gbreve;ini seçin. 
	  <link linkend="install.windows.extensions">Windows
           uzant&inodot;lar&inodot;</link> bölümünden uzant&inodot;lar&inodot;n nas&inodot;l kuruldu&gbreve;u ve hangilerinin
	   önyüklü geldiklerini ö&gbreve;renebilirsiniz. Ancak öncelikle PHP'yi hiçbir uzant&inodot;
	   yüklemeden test edip çal&inodot;&scedil;t&inodot;&gbreve;&inodot;ndan emin olman&inodot;z&inodot;, uzant&inodot;lar&inodot; sonra etkinle&scedil;tirmenizi
	   tavsiye ediyoruz.
          </simpara>
         </listitem>
         <listitem>
          <simpara>
	  PWS ve IIS üzerinde, <filename>browscap.ini</filename>
	  dosyas&inodot;n&inodot; 'c:\windows\system\inetsrv\browscap.ini' ya da
	  'c:\winnt\system32\inetsrv\browscap.ini' klasörlerinden birini gösterecek
	  biçimde ayarlayabilirsiniz.
          </simpara>
         </listitem>
         <listitem>
          <simpara>
	  Windows da&gbreve;&inodot;t&inodot;m&inodot; ile birlikte gelen <filename>mibs</filename> klasörü,
	  SNMP deste&gbreve;i için gerekli dosyalar&inodot; içermektedir. Bu klasör
	  <filename>DRIVE:\usr\mibs</filename> olarak ta&scedil;&inodot;nmal&inodot;d&inodot;r.
	  (<filename>DRIVE</filename> PHP'nin kurulu oldu&gbreve;u sürücüyü gösterir.)
          </simpara>
         </listitem>
        </itemizedlist>
       </para>
      </listitem>
     </itemizedlist>
    </para>
   </sect2>

   <sect2 id="install.windows.build">
    <title>Kaynaktan kurulum</title>
    <para>
    Ba&scedil;lamadan önce bir soruyu cevaplamakta yarar var:
     "Windows alt&inodot;nda derleme neden bu kadar zor?" . Akla iki neden geliyor:
    </para>
    <orderedlist>
     <listitem><simpara>
     Windows kaynaklar&inodot;n&inodot; özgürce payla&scedil;maktan ho&scedil;lanan yaz&inodot;l&inodot;mc&inodot;lara
     (henüz) yeterince sahip de&gbreve;il. Bunun sonucu olarak, yaz&inodot;l&inodot;m geli&scedil;tirme için
     harcanmas&inodot; gereken maddi kaynak çok daha yukarda kal&inodot;yor. Bu nedenle yap&inodot;lanlar,
     ihtiyaç duyulan araçlar&inodot;n Unixten ta&scedil;&inodot;nmas&inodot;yla mümkün olabiliyor.
     </simpara></listitem>
     <listitem><simpara>
     A&scedil;a&gbreve;&inodot;daki bilgilerin ço&gbreve;u "yap ve sorma" biçimindedir. O nedenle arkan&inodot;za
     yaslan&inodot;n ve komutlar&inodot; mümkün olabildi&gbreve;ince sad&inodot;k biçimde uygulamaya ba&scedil;lay&inodot;n.
     </simpara></listitem>
    </orderedlist>

    <sect3 id="install.windows.build.prepare">
     <title>Preparations</title>
     <para>
      Before you get started, you have a lot to download...
     </para>
     <itemizedlist>
      <listitem><simpara>
       For starters, get the Cygwin toolkit from the closest <ulink
       url="http://sources.redhat.com/cygwin/download.html">cygwin</ulink>
       mirror site.  This will provide you most of the popular GNU 
       utilities used by the build process.
      </simpara></listitem>
      <listitem><simpara>
       Download the rest of the build tools you will need from the PHP
       site at <ulink url="http://www.php.net/extra/win32build.zip"
       >http://www.php.net/extra/win32build.zip</ulink>.
      </simpara></listitem>
      <listitem><simpara>
       Get the source code for the DNS name resolver used by PHP
       at <ulink url="http://www.php.net/extra/bindlib_w32.zip"
       >http://www.php.net/extra/bindlib_w32.zip</ulink>. This
       is a replacement for the <filename>resolv.lib</filename>
       library included in <filename>win32build.zip</filename>.
      </simpara></listitem>
      <listitem><simpara>
       If you don't already have an unzip utility, you will
       need one.  A free version is available from <ulink
       url="http://www.cdrom.com/pub/infozip/UnZip.html">InfoZip</ulink>.
      </simpara></listitem>
     </itemizedlist>
     <simpara>
      Finally, you are going to need the source to PHP 4 itself.
      You can get the latest development version using <ulink
      url="http://www.php.net/anoncvs.php">anonymous CVS</ulink>. If you get
      a <ulink url="http://snaps.php.net/">snapshot</ulink> or a <ulink
      url="http://www.php.net/downloads.php">source</ulink> tarball, you
      not only will have to untar and ungzip it, but you will have to
      convert the bare linefeeds to crlf's in the <filename>*.dsp</filename>
      and <filename>*.dsw</filename> files before Microsoft Visual C++
      will have anything to do with them.
     </simpara>
     <note>
      <simpara>
       Place the <filename>Zend</filename> and
       <filename>TSRM</filename> directories inside the
       <filename>php4</filename> directory in order for the projects
       to be found during the build process.
      </simpara>
     </note>
    </sect3>
    <sect3 id="install.windows.build.install">
     <title>Putting it all together</title>
     <itemizedlist>
      <listitem><simpara>
       Follow the instructions for installing the unzip utility of
       your choosing.
      </simpara></listitem>
      <listitem>
       <simpara>
        Execute <filename>setup.exe</filename> and follow the installation
        instructions.  If you choose to install to a path other than
        <filename>c:\cygnus</filename>, let the build process know by setting
        the Cygwin environment variable. On Windows 95/98 setting
        an environment variable can be done by placing a line in
        your autoexec.bat. On Windows NT, go to My Computer =&gt;
        Control Panel =&gt; System and select the environment tab.
       </simpara>
       <warning>
        <simpara>
         Make a temporary directory for Cygwin to use, otherwise many
         commands (particularly bison) will fail. On Windows 95/98,
         <userinput>mkdir C:\TMP</userinput>. For Windows NT,
         <userinput>mkdir %SystemDrive%\tmp</userinput>.
        </simpara>
       </warning>
      </listitem>
      <listitem><simpara>
       Make a directory and unzip <filename>win32build.zip</filename> into it.
      </simpara></listitem>
      <listitem>
       <simpara>
        Launch Microsoft Visual C++, and from the menu select
        Tools =&gt; Options. In the dialog, select the
        directories tab. Sequentially change the dropdown
        to Executables, Includes, and Library files,
        and ensure that <filename>cygwin\bin</filename>,
        <filename>win32build\include</filename>, and
        <filename>win32build\lib</filename> are in each list,
        respectively. (To add an entry, select a blank line
        at the end of the list and begin typing).  Typical entries
        will look like this:
       </simpara>
       <itemizedlist>
        <listitem><simpara>
         <filename>c:\cygnus\bin</filename>
        </simpara></listitem>
        <listitem><simpara>
         <filename>c:\php-win32build\include</filename>
        </simpara></listitem>
        <listitem><simpara>
         <filename>c:\php-win32build\lib</filename>
        </simpara></listitem>
       </itemizedlist>
       <simpara>
        Press OK, and exit out of Visual C++.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        Make another directory and unzip <filename>bindlib_w32.zip</filename>
        into it. Decide whether you want to have debug symbols available
        (bindlib - Win32 Debug) or not (bindlib - Win32 Release).
        Build the appropriate configuration:
       </simpara>
       <itemizedlist>
        <listitem><simpara>
         For GUI users, launch VC++, and then select File =&gt; Open
         Workspace and select bindlib.  Then select Build=&gt;Set
         Active Configuration and select the desired configuration.
         Finally select Build=&gt;Rebuild All.
        </simpara></listitem>
        <listitem>
         <simpara>
          For command line users, make sure that you either have
          the C++ environment variables registered, or have run
          <command>vcvars.bat</command>, and then execute one of the
          following:
         </simpara>
         <itemizedlist>
          <listitem>
           <simpara>
            <userinput>msdev bindlib.dsp /MAKE "bindlib - Win32 Debug"</userinput>
           </simpara>
          </listitem>
          <listitem>
           <simpara>
            <userinput>msdev bindlib.dsp /MAKE "bindlib - Win32 Release"</userinput>
           </simpara>
          </listitem>
         </itemizedlist>
        </listitem>
        <listitem><simpara>
         At this point, you should have a usable
         <filename>resolv.lib</filename> in either your
         <filename>Debug</filename> or <filename>Release</filename>
         subdirectories.  Copy this file into your
         <filename>win32build\lib</filename> directory over the
         file by the same name found in there.
        </simpara></listitem>
       </itemizedlist>
      </listitem>
     </itemizedlist>
    </sect3>

    <sect3 id="install.windows.build.compile">
     <title>Compiling</title>
     <simpara>
      The best way to get started is to build the standalone/CGI version.
     </simpara>
     <itemizedlist>
      <listitem><simpara>
       For GUI users, launch VC++, and then select File =&gt; Open
       Workspace and select php4ts.  Then select Build=&gt;Set Active
       Configuration and select the desired configuration. Finally
       select Build=&gt;Rebuild All.
      </simpara></listitem>
      <listitem>
       <simpara>
        For command line users, make sure that you either have
        the C++ environment variables registered, or have run
        <command>vcvars.bat</command>, and then execute one of the
        following:
       </simpara>
       <itemizedlist>
        <listitem><simpara>
         <userinput>msdev php4ts.dsp /MAKE "php4ts - Win32 Debug_TS"</userinput>
        </simpara></listitem>
        <listitem><simpara>
         <userinput>msdev php4ts.dsp /MAKE "php4ts - Win32 Release_TS"</userinput>
        </simpara></listitem>
        <listitem><simpara>
         At this point, you should have a usable
         <filename>php.exe</filename> in either
         your <filename>Debug_TS</filename> or
         <filename>Release_TS</filename> subdirectories.
        </simpara></listitem>
       </itemizedlist>
      </listitem>
     </itemizedlist>
     <simpara>
      Repeat the above steps with <filename>php4isapi.dsp</filename>
      (which can be found in <filename>sapi\isapi</filename>) in
      order to build the code necessary for integrating PHP with
      Microsoft IIS.
     </simpara>
    </sect3>
   </sect2>
   
   <sect2 id="install.windows.extensions">
    <title>Installation of Windows extensions</title>
    <para>
     After installing PHP and a webserver on Windows, you will
     probably want to install some extensions for added functionality.
     The following table describes some of the extensions available. You
     can choose which extensions you would like to load when PHP starts
     by uncommenting the: 'extension=php_*.dll' lines in
     <filename>php.ini</filename>. You can also load a module dynamically
     in your script using <function>dl</function>.
    </para>
    <para>
     The DLLs for PHP extensions are prefixed with 'php_' in PHP 4 (and 
     'php3_' in PHP 3). This prevents confusion between PHP extensions 
     and their supporting libraries. 
    </para>
    <note>
     <para>
       In PHP 4.0.6 BCMath, Calendar, COM, FTP, MySQL, ODBC, PCRE, 
       Session, WDDX and XML support is <emphasis>built in</emphasis>.
       You don't need to load any additional extensions in order to 
       use these functions. See your distributions
       <filename>README.txt</filename> or <filename>install.txt</filename>
       for a list of built in modules.
     </para>
    </note>

    <note>
     <para>
      Some of these extensions need extra dlls to work. Couple of them can be
      found in the distribution package, in the &apos;dlls&apos; folder but
      some, for example Oracle (php_oci8.dll) require dlls which are
      not bundled with the distribution package.
     </para>

     <para>
      Copy the bundled dlls from &apos;dlls&apos; folder to your Windows 
      PATH, safe places are:
      <simplelist>
       <member>c:\windows\system for Windows 9x/Me</member>
       <member>c:\winnt\system32 for Windows NT/2000/XP</member>
      </simplelist>
      If you have them already installed on your system, overwrite them
      only if something doesn't work correctly (Before overwriting them,
      it is a good idea to make a backup of them, or move them to
      another folder - just in case something goes wrong).
     </para>
    </note>

    <para>
     <table>
      <title>PHP Extensions</title>
      <tgroup cols="3">
       <thead>
        <row>
         <entry>Extension</entry>
         <entry>Description</entry>
         <entry>Notes</entry>
        </row>
       </thead>
                                                     
       <tbody>
  <row>
   <entry>php_bz2.dll</entry>
   <entry><link linkend="ref.bzip2">bzip2</link> compression functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_calendar.dll</entry>
   <entry><link linkend="ref.calendar">Calendar</link> conversion functions</entry>
   <entry>Built in since PHP 4.0.3</entry>
  </row>
  <row>
   <entry>php_cpdf.dll</entry>
   <entry><link linkend="ref.cpdf">ClibPDF</link> functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php3_crypt.dll</entry>
   <entry>Crypt functions</entry>
   <entry>unknown</entry>
  </row>
  <row>
   <entry>php_ctype.dll</entry>
   <entry><link linkend="ref.ctype">ctype</link> family functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_curl.dll</entry>
   <entry><link linkend="ref.curl">CURL</link>, Client URL library functions</entry>
   <entry>Requires: libeay32.dll, ssleay32.dll (bundled)</entry>
  </row>
  <row>
   <entry>php_cybercash.dll</entry>
   <entry><link linkend="ref.cybercash">Cybercash</link> payment functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_db.dll</entry>
   <entry><link linkend="ref.dbm">DBM</link> functions</entry>
   <entry>Deprecated. Use DBA instead (php_dba.dll)</entry>
  </row>
  <row>
   <entry>php_dba.dll</entry>
   <entry><link linkend="ref.dba">DBA</link>: DataBase (dbm-style) Abstraction layer functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_dbase.dll</entry>
   <entry><link linkend="ref.dbase">dBase</link> functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php3_dbm.dll</entry>
   <entry>Berkeley DB2 library</entry>
   <entry>unknown</entry>
  </row>
  <row>
   <entry>php_domxml.dll</entry>
   <entry><link linkend="ref.domxml">DOM XML</link> functions</entry>
   <entry>Requires: libxml2.dll (bundled)</entry>
  </row>
  <row>
   <entry>php_dotnet.dll</entry>
   <entry>.NET functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_exif.dll</entry>
   <entry><link linkend="function.read-exif-data">Read EXIF</link> headers from JPEG</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_fbsql.dll</entry>
   <entry><link linkend="ref.fbsql">FrontBase</link> functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_fdf.dll</entry>
   <entry><link linkend="ref.fdf">FDF</link>: Forms Data Format functions.</entry>
   <entry>Requires: fdftk.dll (bundled)</entry>
  </row>
  <row>
   <entry>php_filepro.dll</entry>
   <entry><link linkend="ref.filepro">filePro</link> functions</entry>
   <entry>Read-only access</entry>
  </row>
  <row>
   <entry>php_ftp.dll</entry>
   <entry><link linkend="ref.ftp">FTP</link> functions</entry>
   <entry>Built-in since PHP 4.0.3</entry>
  </row>
  <row>
   <entry>php_gd.dll</entry>
   <entry><link linkend="ref.image">GD</link> library image functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_gettext.dll</entry>
   <entry><link linkend="ref.gettext">Gettext</link> functions</entry>
   <entry>Requires: gnu_gettext.dll (bundled)</entry>
  </row>
  <row>
   <entry>php_hyperwave.dll</entry>
   <entry><link linkend="ref.hyperwave">HyperWave</link> functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_iconv.dll</entry>
   <entry><link linkend="ref.iconv">ICONV</link> characterset conversion</entry>
   <entry>Requires: iconv-1.3.dll (bundled)</entry>
  </row>
  <row>
   <entry>php_ifx.dll</entry>
   <entry><link linkend="ref.ifx">Informix</link> functions</entry>
   <entry>Requires: Informix libraries</entry>
  </row>
  <row>
   <entry>php_iisfunc.dll</entry>
   <entry>IIS management functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_imap.dll</entry>
   <entry><link linkend="ref.imap">IMAP</link> POP3 and NNTP functions</entry>
   <entry>PHP 3: php3_imap4r1.dll</entry>
  </row>
  <row>
   <entry>php_ingres.dll</entry>
   <entry><link linkend="ref.ingres">Ingres II</link> functions</entry>
   <entry>Requires: Ingres II libraries</entry>
  </row>
  <row>
   <entry>php_interbase.dll</entry>
   <entry><link linkend="ref.ibase">InterBase</link> functions</entry>
   <entry>Requires: gds32.dll (bundled)</entry>
  </row>
  <row>
   <entry>php_java.dll</entry>
   <entry><link linkend="ref.java">Java</link> extension</entry>
   <entry>Requires: jvm.dll (bundled)</entry>
  </row>
  <row>
   <entry>php_ldap.dll</entry>
   <entry><link linkend="ref.ldap">LDAP</link> functions</entry>
   <entry>Requires: libsasl.dll (bundled)</entry>
  </row>
  <row>
   <entry>php_mhash.dll</entry>
   <entry><link linkend="ref.mhash">Mhash</link> Functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_ming.dll</entry>
   <entry><link linkend="ref.ming">Ming</link> functions for Flash</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_msql.dll</entry>
   <entry><link linkend="ref.msql">mSQL</link> functions</entry>
   <entry>Requires: msql.dll (bundled)</entry>
  </row>
  <row>
   <entry>php3_msql1.dll</entry>
   <entry>mSQL 1 client</entry>
   <entry>unknown</entry>
  </row>
  <row>
   <entry>php3_msql2.dll</entry>
   <entry>mSQL 2 client</entry>
   <entry>unknown</entry>
  </row>
  <row>
   <entry>php_mssql.dll</entry>
   <entry><link linkend="ref.mssql">MSSQL</link> functions</entry>
   <entry>Requires: ntwdblib.dll (bundled)</entry>
  </row>
  <row>
   <entry>php3_mysql.dll</entry>
   <entry><link linkend="ref.mysql">MySQL</link> functions</entry>
   <entry>Built-in in PHP 4</entry>
  </row>
  <row>
   <entry>php3_nsmail.dll</entry>
   <entry>Netscape mail functions</entry>
   <entry>unknown</entry>
  </row>
  <row>
   <entry>php3_oci73.dll</entry>
   <entry>Oracle functions</entry>
   <entry>unknown</entry>
  </row>
  <row>
   <entry>php_oci8.dll</entry>
   <entry><link linkend="ref.oci8">Oracle 8</link> functions</entry>
   <entry>Requires: Oracle 8 client libraries</entry>
  </row>
  <row>
   <entry>php_openssl.dll</entry>
   <entry><link linkend="ref.openssl">OpenSSL</link> functions</entry>
   <entry>Requires: libeay32.dll (bundled)</entry>
  </row>
  <row>
   <entry>php_oracle.dll</entry>
   <entry><link linkend="ref.oracle">Oracle</link> functions</entry>
   <entry>Requires: Oracle 7 client libraries</entry>
  </row>
  <row>
   <entry>php_pdf.dll</entry>
   <entry><link linkend="ref.pdf">PDF</link> functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_pgsql.dll</entry>
   <entry><link linkend="ref.pgsql">PostgreSQL</link> functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_printer.dll</entry>
   <entry><link linkend="ref.printer">Printer</link> functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_sablot.dll</entry>
   <entry><link linkend="ref.xslt">XSLT</link> functions</entry>
   <entry>Requires: sablot.dll (bundled)</entry>
  </row>
  <row>
   <entry>php_snmp.dll</entry>
   <entry><link linkend="ref.snmp">SNMP</link> get and walk functions</entry>
   <entry>NT only!</entry>
  </row>
  <row>
   <entry>php_sybase_ct.dll</entry>
   <entry><link linkend="ref.sybase">Sybase</link> functions</entry>
   <entry>Requires: Sybase client libraries</entry>
  </row>
  <row>
   <entry>php_yaz.dll</entry>
   <entry><link linkend="ref.yaz">YAZ</link> functions</entry>
   <entry>None</entry>
  </row>
  <row>
   <entry>php_zlib.dll</entry>
   <entry><link linkend="ref.zlib">ZLib</link> compression functions</entry>
   <entry>None</entry>
  </row>
       </tbody>
      </tgroup>
     </table>
    </para>
   </sect2>
  </sect1>

  <sect1 id="install.apache">
   <title>Sunucular-Apache</title>
   <para>
   Bu bölüm hem <link linkend="install.apache.unix">Unix</link> hem de
   <link linkend="install.apache.windows">Windows</link> için PHP'nin
   Apache ile birlikte kullan&inodot;ld&inodot;&gbreve;&inodot; sistemler hakk&inodot;nda notlar ve ipuçlar&inodot; içeriyor.
   </para>   
   <sect2 id="install.apache.unix">
    <title>PHP'nin Unix alt&inodot;nda Apache ile Kurulumu</title>
    <para>
    8. sat&inodot;rdaki <command>configure</command> komutuna ekleyebilece&gbreve;iniz
    argümanlar&inodot;n listesini <link linkend="install.configure">Konfigürasyon ayarlar&inodot;n&inodot;n
    tam listesi</link> bölümünde bulabilirsiniz.
    </para>

    <example id="install.apache.unix.longer">
     <title>
     Kurulum Talimatlar&inodot; (Apache Modül Sürümü)
     </title>
     <programlisting>
1.  gunzip apache_1.3.x.tar.gz
2.  tar xvf apache_1.3.x.tar
3.  gunzip php-x.x.x.tar.gz
4.  tar xvf php-x.x.x.tar
5.  cd apache_1.3.x
6.  ./configure --prefix=/www
7.  cd ../php-x.x.x
8.  ./configure --with-mysql --with-apache=../apache_1.3.x --enable-track-vars
9.  make
10. make install
11. cd ../apache_1.3.x
12. PHP 3 için: ./configure --activate-module=src/modules/php3/libphp3.a
     PHP 4 için: ./configure --activate-module=src/modules/php4/libphp4.a
13. make
14. make install

Bu ad&inodot;m yerine httpd binary dosyas&inodot;n&inodot; varolan binary dosyas&inodot;n&inodot;n yerine kopyalamay&inodot;
da tercih edebilirsiniz. Bunu yapmadan önce sunucunuzu durdurmay&inodot; unutmay&inodot;n.

15. cd ../php-x.x.x
16. PHP 3 için: cp php3.ini-dist /usr/local/lib/php3.ini
    PHP 4 için: cp php.ini-dist /usr/local/lib/php.ini

  PHP ayarlar&inodot;n&inodot; de&gbreve;i&scedil;tirmek için .ini dosyan&inodot;z&inodot; düzenleyebilirsiniz. Bu dosyan&inodot;n
  farkl&inodot; bir yerde saklanmas&inodot;n&inodot; istiyorsan&inodot;z, 8.ad&inodot;mda --with-config-file-path=/path
  kullan&inodot;n.
  
17. httpd.conf ya da srm.conf dosyan&inodot;z&inodot; aç&inodot;n ve ekleyin:
      
     PHP 3 için:   AddType application/x-httpd-php3 .php3
     PHP 4 için:   AddType application/x-httpd-php .php
 
  Buraya istedi&gbreve;iniz uzant&inodot;y&inodot; ekleyebilirsiniz. .php bizim önerdi&gbreve;imiz &scedil;eklidir. Bunlar&inodot;n
  aras&inodot;na .html dahil istedi&gbreve;iniz uzant&inodot;y&inodot; yazabilirsiniz.
  
18. Apache sunucusunu normal &scedil;ekliyle ba&scedil;lat&inodot;n. (Sunucuyu durdurmal&inodot; ve yeniden
ba&scedil;latmal&inodot;s&inodot;n&inodot;z, sunucuya HUP ya da USR1 sinyali göndermek yeterli de&gbreve;ildir)
      </programlisting>
     </example>

     <para>
     Apache kurulumunuz ve kulland&inodot;&gbreve;&inodot;n&inodot;z Unix türevine ba&gbreve;l&inodot; olarak, sunucuyu
     durdurman&inodot;n ve yeniden ba&scedil;latman&inodot;n farkl&inodot; yollar&inodot; bulunabilir. A&scedil;a&gbreve;&inodot;da sunucuyu
     yeniden ba&scedil;latmak için kullan&inodot;lan al&inodot;&scedil;&inodot;lm&inodot;&scedil; komutlar yer al&inodot;yor. Buradaki
     <literal>/path/to/</literal> de&gbreve;erini kendi sisteminize uyacak biçimde
     de&gbreve;i&scedil;tirmeyi unutmay&inodot;n.
      <informalexample>
       <programlisting>
1. Çe&scedil;itli Linux ve SysV türevleri
/etc/rc.d/init.d/httpd restart

2. apachectl uygulamas&inodot; kullan&inodot;larak:
/path/to/apachectl stop
/path/to/apachectl start

3. httpdctl ve httpsdctl (OpenSSL kullanarak), apachectl ye benzer &scedil;ekilde:
/path/to/httpsdctl stop
/path/to/httpsdctl start

4. mod_ssl ya da ba&scedil;ka bir SSL sunucu kullan&inodot;yorsan&inodot;z, sunucuyu elle ba&scedil;latabilirsiniz:
/path/to/apachectl stop
/path/to/apachectl startssl

5. SuSE 7.2 için:
rcapache restart
       </programlisting>
      </informalexample>
      apachectl ve http(s)dctl binary dosyalar&inodot;n&inodot;n yerleri s&inodot;kl&inodot;kla farkl&inodot;l&inodot;k gösterebilir.
      Sisteminiz <literal>locate</literal> ya da <literal>whereis</literal> veya
      <literal>which</literal> komutlar&inodot;na sahipse, bunlar&inodot; kullanarak web sunucunuzun
      kontrol dosyalar&inodot;na ula&scedil;abilirsiniz.
     </para>

     <para>
     PHP'nin Apache modülü olarak derlenmesine dair birkaç örnek verirsek:
      <informalexample>
       <programlisting>
./configure --with-apxs --with-pgsql
       </programlisting>
      </informalexample>
     </para>
     <para>
     Bu yöntem <filename>libphp4.so</filename> payla&scedil;&inodot;m kütüphanesini
     yaratacak ve Apache'&inodot;n <filename>httpd.conf</filename> düzenleyerek
     modülün yüklenmesi için gerekli LoadModule sat&inodot;r&inodot;n&inodot; ekleyecektir. PostgreSQL
     deste&gbreve;i <filename>libphp4.so</filename> içine gömülecektir.
     </para>
     <para>
      <informalexample>
       <programlisting>
./configure --with-apxs --with-pgsql=shared
       </programlisting>
      </informalexample>
     </para>
     <para>
     Bu yöntem yine <filename>libphp4.so</filename> kütüphanesini derleyecektir,
     ama bu sefer PHP'ye php.ini dosyas&inodot;na yaz&inodot;larak ya da 
     <function>dl</function> fonksiyonu kullan&inodot;larak eklenecek halde çal&inodot;&scedil;t&inodot;r&inodot;labilecek 
     <filename>pgsql.so</filename> dosyas&inodot;n&inodot; da üretecektir.
     </para>
     <para>
      <informalexample>
       <programlisting>
./configure --with-apache=/path/to/apache_source --with-pgsql
       </programlisting>
      </informalexample>
     </para>
     <para>
     Bu yöntem <filename>libmodphp4.a</filename> kütüphanesini, 
     <filename>mod_php4.c</filename> dosyas&inodot;n&inodot; ve bunlara e&scedil;lik eden birkaç
     dosyay&inodot; yarat&inodot;p Apache kaynak kod a&gbreve;ac&inodot; içindeki <literal>src/modules/php4</literal>
     klasörüne kopyalayacakt&inodot;r. &Idot;kinci ad&inodot;mda Apache'&inodot; derledi&gbreve;inizde
     <literal>--activate-module=src/modules/php4/libphp4.a</literal>
     dosyas&inodot; yarat&inodot;lacak ve statik olarak  <filename>httpd</filename> binary dosyas&inodot;na
     ba&gbreve;lanacakt&inodot;r. Sonuç olarak Apache'&inodot;n ve PHP'nin tümünü içeren bir 
     <filename>httpd</filename> dosyas&inodot; elde edilecektir.
     </para>
     <para>
      <informalexample>
       <programlisting>
./configure --with-apache=/path/to/apache_source --with-pgsql=shared
       </programlisting>
      </informalexample>
     </para>
     <para>
     Bir önceki ile ayn&inodot;d&inodot;r, yaln&inodot;zca PostgreSQL deste&gbreve;inin sondaki 
     <filename>httpd</filename> dosyas&inodot;n&inodot;n içine gömülmesinin yerine,
     <filename>pgsql.so</filename> kütüphanesi ayr&inodot;ca yarat&inodot;lacak ve bu
     kütüphaneyi <filename>php.ini</filename> ile ya da 
     <function>dl</function> fonksiyonu ile birlikte kullanman&inodot;z mümkün
     olacak.
     </para>
     <para>
     PHP'yi hangi yolla derleyece&gbreve;inize karar verirken, her yöntemin avantajlar&inodot;
     ve dezavantajlar&inodot; oldu&gbreve;unu gözönünde bulundurun. Payla&scedil;&inodot;m nesnesi olarak
     derlemek, Apache'yi ayr&inodot;ca derleyebilece&gbreve;iniz anlam&inodot;na gelir, ve size PHP'yi
     her derledi&gbreve;inizde Apache'&inodot; da yeniden derleme derdinden kurtar&inodot;r. PHP'yi
     Apache'&inodot;n içine gömmek (statik yöntem) PHP'nin daha h&inodot;zl&inodot; çal&inodot;&scedil;mas&inodot; anlam&inodot;na
     gelir. Daha fazla bilgi için Apache'&inodot;n <ulink url="&url.apachedso;">DSO deste&gbreve;i</ulink>
     sayfas&inodot;n&inodot; inceleyin.
     </para>
   </sect2>


   <sect2 id="install.apache.windows">
    <title>PHP'nin Windows alt&inodot;nda Apache 1.3.x ile Kurulumu</title>
    
    <simpara>
    PHP'yi Windows alt&inodot;nda Apache 1.3.x ile birlikte kurmak için iki yol vard&inodot;r.
    Birincisi CGI binary (php.exe) kullanmak, ikincisi ise Apache modülünü sa&gbreve;layan
    dll'yi kullanmakt&inodot;r. Her iki durumda da Apache sunucusunu durdurup 
    <filename>srm.conf</filename> ya da <filename>httpd.conf</filename>
    dosyas&inodot;n&inodot; düzenlemeniz ve Apache'&inodot; PHP ile çal&inodot;&scedil;acak &scedil;ekilde ayarlaman&inodot;z
    gereklidir.
    </simpara>
    <simpara>
    PHP'yi Apache alt&inodot;nda kurman&inodot;n farkl&inodot; yöntemleri olsa da, bu yöntemler
    yeni ba&scedil;layan birisinin uygulayabilece&gbreve;i kadar basittir. Konfigürasyon seçenekleri
    için Apache dokümantasyonunu inceleyebilirsiniz.
    </simpara>
  
    <para>
    PHP zip paketini <link linkend="install.windows.manual">Elle
     Kurulum Ad&inodot;mlar&inodot;</link> bölümünde anlat&inodot;ld&inodot;&gbreve;&inodot; gibi c:\php\ klasörüne açt&inodot;ysan&inodot;z,
     CGI binary ayarlamas&inodot;n&inodot; yapmak için a&scedil;a&gbreve;&inodot;daki sat&inodot;rlar&inodot; Apache konfigürasyon
     dosyan&inodot;za eklemeniz gereklidir:
     <itemizedlist>
      <listitem>
       <simpara>
        <literal>
         ScriptAlias /php/ "c:/php/"
        </literal>
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        <literal>
         AddType application/x-httpd-php .php .phtml
        </literal>
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        <literal>
         Action application/x-httpd-php "/php/php.exe"
        </literal>
       </simpara>
      </listitem>
     </itemizedlist>
     &Idot;kinci sat&inodot;r <filename>httpd.conf</filename> dosyas&inodot;n&inodot;n yeni sürümlerinde
     haz&inodot;r olarak mevcuttur ancak ba&scedil;&inodot;na devre d&inodot;&scedil;&inodot; kalmas&inodot; için yorum i&scedil;areti
     eklenmi&scedil;tir. Dosyay&inodot; de&gbreve;i&scedil;tirdikten sonra, sunucuyu yeniden ba&scedil;lat&inodot;n. Bunu
     Apache bir Windows hizmeti olarak çal&inodot;&scedil;&inodot;yorsa
     <literal>NET STOP APACHE</literal> komutunu izleyen 
     <literal>NET START APACHE</literal> komutunu vererek yapabilirsiniz.
    </para>

    <para>
    PHP'yi Apache modülü olarak kullanmak istiyorsan&inodot;z, <filename>php4ts.dll</filename>
    dosyas&inodot;n&inodot; windows/system (Windows 9X/ME için) ya da winnt/system32
    (Windows NT/2000/XP için) klasörlerine ta&scedil;&inodot;may&inodot; unutmay&inodot;n ve varolan eski
    dosyalar&inodot;n üzerine yazmaktan çekinmeyin. Daha sonra a&scedil;a&gbreve;&inodot;daki iki sat&inodot;r&inodot;
    Apache conf dosyan&inodot;za ekleyin:
     <itemizedlist>
      <listitem>
       <simpara>
        <literal>
         LoadModule php4_module c:/php/sapi/php4apache.dll
        </literal>
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        <literal>
          AddType application/x-httpd-php .php .phtml
        </literal>
       </simpara>
      </listitem>
     </itemizedlist>
    </para>

    <note>
     <simpara>
     Windows için Apache 1.3.22 de, öntan&inodot;ml&inodot; konfigürasyon dosyas&inodot;
     (<filename>httpd.conf-dist-win</filename>) öntan&inodot;ml&inodot; olarak
     <literal>ClearModuleList</literal> direktifini içermektedir. Bu direktif
     kullan&inodot;ld&inodot;&gbreve;&inodot;nda, <literal>AddModule</literal> listesine <literal>AddModule mod_php4.c</literal>
     sat&inodot;r&inodot;n&inodot;n eklenmesi gerekmektedir, aksi takdirde PHP Apache modülü olarak
     kay&inodot;t edilmeyecektir.
     </simpara>
    <simpara>
    Kaynak kod renklendirme özelli&gbreve;ini kullanmak için, basit bir PHP dosyas&inodot; yarat&inodot;n
    ve içine: <literal>&lt;?php show_source
     ("original_php_script.php"); ?></literal> sat&inodot;r&inodot;n&inodot; ekleyin. Renklendirmek
     istedi&gbreve;iniz dosyan&inodot;n ismini <literal>original_php_script.php</literal> ile
     de&gbreve;i&scedil;tirin (Windows alt&inodot;nda .phps benzeri bir özellik olmad&inodot;&gbreve;&inodot; için bu renklendirme
     için tek yoldur).
    </simpara>
    </note>
    <note>
     <simpara>
     Win-Apache içersindeki yol tan&inodot;m&inodot;nda kullan&inodot;lan bütün ters bölü i&scedil;aretleri,
     "c:\directory\file.ext" gibiler, "c:/directory/file.ext" de oldu&gbreve;u gib düz bölüye
     çevrilmelidir.
     </simpara>
    </note>
   </sect2>
  </sect1>

  <sect1 id="install.commandline">
   <title>Sunucu-CGI/Komut Sat&inodot;r&inodot;</title>
   <para>
   PHP'nin öntan&inodot;ml&inodot; kurulumu CGI uygulamas&inodot; &scedil;eklindedir.
   Bu kurulum CGI i&scedil;lemleri ya da webden ba&gbreve;&inodot;ms&inodot;z PHP uygulamalar&inodot; için
   kullan&inodot;labilir. PHP'nin destekledi&gbreve;i bir web sunucusuna sahipseniz, performans&inodot;
   dü&scedil;ünerek sunucu modülü kurulumunu tercih etmelisiniz. Öte yandan, CGI sürümü
   Apache kullan&inodot;c&inodot;lar&inodot;n&inodot;n farkl&inodot; kullan&inodot;c&inodot;-idleri ile farkl&inodot; PHP-etkin sayfalar
   çal&inodot;&scedil;t&inodot;rabilmelerini sa&gbreve;lar. PHP'yi CGI olarak kullanmay&inodot; dü&scedil;ünüyorsan&inodot;z,
   <link
    linkend="security">Güvenlik bölümü</link> adresine u&gbreve;ray&inodot;n.
   </para>
   
   <sect2 id="install.commandline.testing">
    <title>Deneme</title>
    <simpara>
    PHP'yi CGI uygulamas&inodot; olarak derlediyseniz, olu&scedil;turulan yap&inodot;y&inodot; 
    <command>make test</command> yazarak deneyebilirsiniz. Yap&inodot;y&inodot;
    test etmek her zaman için iyi bir fikirdir. Bu &scedil;ekilde platformunuzda PHP ile
    ilgili ç&inodot;kabilecek problemleri önceden tespit edip giderme f&inodot;rsat&inodot;n&inodot; bulmu&scedil;
    olursunuz.
    </simpara>
   </sect2>

   <sect2 id="install.commandline.benchmarking">
    <title>Performans Testi</title>
    <simpara>
    PHP 3'ü CGI olarak derlediyseniz, olu&scedil;an yap&inodot;n&inodot;n performans&inodot;n&inodot;
    <command>make bench</command> komutunu vererek ölçebilirsiniz.
    <link linkend="features.safe-mode">Safe Mode</link> öntan&inodot;ml&inodot; olarak
    aç&inodot;ksa, ölçüm 30 saniyeyi geçti&gbreve;inde otomatik olarak duracakt&inodot;r. Bunun nedeni
    <function>set_time_limit</function> fonksiyonunun güvenli modda kullan&inodot;lam&inodot;yor
    olmas&inodot;d&inodot;r.<link
      linkend="ini.max-execution-time">max_execution_time</link>
      ayar&inodot;n&inodot; kullanarak bu zaman&inodot; kendi uygulamalar&inodot;n&inodot;za göre ayarlamal&inodot;s&inodot;n&inodot;z.
      <command>make bench</command> komutu 
      <link
      linkend="configuration.file">ayar dosyas&inodot;</link>n&inodot; gözard&inodot; etmektedir.
    </simpara>
    <note>
     <simpara>
        <command>make bench</command> is only available for PHP 3.
     </simpara>
    </note>
   </sect2>
  </sect1>

  <sect1 id="install.fhttpd">
   <title>Servers-fhttpd</title>
   <para>
    To build PHP as an fhttpd module, answer "yes" to "Build as an
    fhttpd module?" (the <link
    linkend="install.configure.with-fhttpd">
    --with-fhttpd</link>=<replaceable>DIR</replaceable>
    option to configure) and specify the fhttpd source base
    directory.  The default directory is <filename
    class="directory">/usr/local/src/fhttpd</filename>. If you are
    running fhttpd, building PHP as a module will give better
    performance, more control and remote execution capability.
   </para>
  </sect1>

  <sect1 id="install.caudium">
   <title>Servers-Caudium</title>
   <para>
    PHP 4 can be build as a Pike module for the Caudium webserver. Note
    that this is not supported with PHP 3. Follow the simple
    instructions below to install PHP 4 for Caudium.
   </para>
   <example id="install.caudium.instructions">
    <title>Caudium Installation Instructions</title>
    <programlisting>
1.  Make sure you have Caudium installed prior to attempting to
    install PHP 4. For PHP 4 to work correctly, you will need Pike
    7.0.268 or newer. For the sake of this example we assume that
    Caudium is installed in /opt/caudium/server/.
2.  Change directory to php-x.y.z (where x.y.z is the version number).
3.  ./configure --with-caudium=/opt/caudium/server
4.  make
5.  make install
6.  Restart Caudium if it's currently running.
7.  Log into the graphical configuration interface and go to the
    virtual server where you want to add PHP 4 support.
8.  Click Add Module and locate and then add the PHP 4 Script Support module.
9.  If the documentation says that the 'PHP 4 interpreter isn't
    available', make sure that you restarted the server. If you did
    check /opt/caudium/logs/debug/default.1 for any errors related to
    <filename>PHP4.so</filename>. Also make sure that 
    <filename>caudium/server/lib/[pike-version]/PHP4.so</filename>
    is present.
10. Configure the PHP Script Support module if needed.
    </programlisting>
   </example>
   <para>
    You can of course compile your Caudium module with support for the
    various extensions available in PHP 4. See the 
    <link linkend="install.configure">complete list of configure
    options</link> for an exhaustive rundown. 
   </para>
   <note>
    <para>
     When compiling PHP 4 with MySQL support you must make sure that
     the normal MySQL client code is used. Otherwise there might be
     conflicts if your Pike already has MySQL support. You do this by
     specifying a MySQL install directory <link
     linkend="install.configure.with-mysql">the --with-mysql
     option</link>.
    </para>
   </note>
  </sect1>

  <sect1 id="install.iis">
   <title>Sunucu-IIS/PWS</title>
   <para>
   Bu bölüm IIS (Microsoft Internet Information Server) sunucusuna özel
   notlar ve ipuçlar&inodot; içermektedir. PHP'nin
    <link linkend="install.iis.iis3">PWS/IIS 3</link>,
    <link linkend="install.iis.pws4">PWS 4 ya da daha yeni</link> ve
    <link linkend="install.iis.iis4">IIS 4 ya da daha yeni</link> sürümler üzerinde
    çal&inodot;&scedil;mas&inodot;yla ilgili bilgi vermektedir.
   </para>
   <sect2 id="install.iis.iis3">
    <title>Windows ve PWS/IIS 3</title>
    
    <simpara>
    Bu sunucular&inodot;n konfigürasyonu için önerilen yöntem da&gbreve;&inodot;t&inodot;mla birlikte gelen
    (pws-php4cgi.reg) dosyas&inodot;n&inodot;n kullan&inodot;m&inodot;d&inodot;r. Bu dosyay&inodot; düzenleyerek PHP'nin
    uzant&inodot; ve kurulum klasörlerinin sizin sisteminizdekilerle e&scedil;de&gbreve;erde oldu&gbreve;undan
    emin olun. Ya da a&scedil;a&gbreve;&inodot;daki ad&inodot;mlar&inodot; tek tek uygulay&inodot;n.
    </simpara>
    <warning>
     <para>
     Bu ad&inodot;mlar Windows registrysi yani sistem kayd&inodot; ile direk i&scedil;lem yapman&inodot;z&inodot;
     gerektirir. Burada yap&inodot;lacak bir hata, sisteminizi karars&inodot;z halde b&inodot;rakabilir.
     Bu nedenle öncelikle sistem kayd&inodot;n&inodot;z&inodot;n yede&gbreve;ini alman&inodot;z&inodot; tavsiye ederiz.
     PHP Geli&scedil;tirme Tak&inodot;m&inodot;'n&inodot;n, kay&inodot;t sisteminizde olu&scedil;acak herhangi bir hatadan
     sorumlu olmayaca&gbreve;&inodot;n&inodot; bilmenizi isteriz.
     </para>
    </warning>

    <para>
     <itemizedlist>
      <listitem>
       <simpara>
        Regedit uygulamas&inodot;n&inodot; çal&inodot;&scedil;t&inodot;r&inodot;n.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        <literal>HKEY_LOCAL_MACHINE /System
         /CurrentControlSet /Services /W3Svc /Parameters
         /ScriptMap</literal> a gidin.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       Düzan menüsünden <literal>New->String Value</literal> seçin.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       Php uygulamalar&inodot;n&inodot;z için kullanmak istedi&gbreve;iniz uzant&inodot;y&inodot; seçin.
	Örn: <literal>.php</literal>
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       Yeni de&gbreve;erin üzerine t&inodot;klay&inodot;n ve veri&scedil;i giri&scedil;i yap&inodot;lan bölüme
       <literal>php.exe</literal>'nin bulundu&gbreve;u yolu yaz&inodot;n. Örn:
        <literal>c:\php\php.exe</literal>.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       Bu ad&inodot;mlar&inodot; eklemek istedi&gbreve;iniz her uzant&inodot; için tekrarlay&inodot;n.
       </simpara>
      </listitem>
     </itemizedlist>
    </para>
    <para>
    A&scedil;a&gbreve;&inodot;daki ad&inodot;mlar web sunucu kurulumunuzu etkilemeyecek, yaln&inodot;zca
    php uygulamalar&inodot;n&inodot;z&inodot;n konsoldan çal&inodot;&scedil;t&inodot;r&inodot;labilmesini istiyorsan&inodot;z uygulanacakt&inodot;r.
    (örn. <filename>c:\myscripts\test.php</filename>). Bu ad&inodot;mlar&inodot; atlayabilir
    ve PHP dosyalar&inodot;n&inodot;z&inodot;n çift t&inodot;kland&inodot;klar&inodot;nda bir metin editörü taraf&inodot;ndan aç&inodot;lmas&inodot;n&inodot;
    sa&gbreve;layabilirsiniz.
    </para>
    <para>
     <itemizedlist>
      <listitem>
       <simpara>
        <literal>HKEY_CLASSES_ROOT</literal> a gidin.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       Düzün menüsünden <literal>New->Key</literal> seçin.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       Önceki bölümde seçti&gbreve;iniz uzant&inodot; ismini key de&gbreve;erine e&scedil;leyin.
       Örn: <literal>.php</literal>
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       Yeni anahtar&inodot;n üzerine gelin ve sa&gbreve; bölümden "öntan&inodot;ml&inodot; de&gbreve;er" üzerine
       çift t&inodot;klay&inodot;n ve <literal>phpfile</literal> yaz&inodot;n.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       Son ad&inodot;m&inodot; kullanmak istedi&gbreve;iniz bütün uzant&inodot;lar için tekrarlay&inodot;n.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       &Scedil;imdi <literal>HKEY_CLASSES_ROOT</literal> alt&inodot;nda yeni bir
       <literal>New->Key</literal> yarat&inodot;n ve ad&inodot;n&inodot; <literal>phpfile</literal> koyun.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        <literal>phpfile</literal> üzerine gelin ve sa&gbreve; bölümden, "öntan&inodot;ml&inodot; de&gbreve;er"in
	üzerine çift t&inodot;klay&inodot;p <literal>PHP Script</literal> yaz&inodot;n.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       <literal>phpfile</literal> anahtar&inodot;n&inodot;n üstüne sa&gbreve; t&inodot;klay&inodot;n ve 
       <literal>New->Key</literal> seçin, ve <literal>Shell</literal>
       olarak adland&inodot;r&inodot;n.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       <literal>Shell</literal> anahtar&inodot;n&inodot;n üstüne sa&gbreve; t&inodot;klay&inodot;n ve
       <literal>New->Key</literal>, seçin ve <literal>open</literal>
       olarak adland&inodot;r&inodot;n.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       <literal>open</literal> anahtar&inodot;n&inodot;n üstüne sa&gbreve; t&inodot;klay&inodot;n ve 
       <literal>New->Key</literal> seçin, ve <literal>command</literal>
       olarak adland&inodot;r&inodot;n.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       Yeni olu&scedil;an <literal>command</literal> anahtar&inodot;n&inodot; seçin ve sa&gbreve; bölümden,
       "öntan&inodot;ml&inodot; de&gbreve;er"e çift t&inodot;klay&inodot;p <literal>php.exe</literal> için yolu girin.
       Örn: <literal>c:\php\php.exe -q %1</literal> (<literal>%1</literal>
       yazmay&inodot; unutmay&inodot;n).
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       Regedit'ten ç&inodot;k&inodot;n.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       Windows alt&inodot;nda PWS kullan&inodot;yorsan&inodot;z, sistem kayd&inodot;n&inodot;n yeniden yüklenmesi
       için sistemi yeniden ba&scedil;lat&inodot;n.
       </simpara>
      </listitem>
     </itemizedlist>
    </para>
    <simpara>
    PWS ve IIS 3 kullan&inodot;c&inodot;lar&inodot; &scedil;u anda tam çal&inodot;&scedil;an bir sisteme sahipler. IIS 3
    kullan&inodot;c&inodot;lar&inodot; uygulama haritalar&inodot;n&inodot; ayarlamak için Steven Genusa taraf&inodot;ndan
    haz&inodot;rlanm&inodot;&scedil; <ulink url="&url.iiscfg;">arac&inodot;</ulink> kullanabilirler.
    </simpara>
    
   </sect2>

   <sect2 id="install.iis.pws4">
    <title>Windows ve PWS 4 ya da üstü</title>

    <simpara>
    PHP'yi Windows alt&inodot;nda PWS 4 ya da üstü için kurarken, iki seçene&gbreve;iniz vard&inodot;r.
    Birincisi CGI çal&inodot;&scedil;t&inodot;r&inodot;labiliri kurulumu, ikincisi ISAPI modülü kurulumu.
    </simpara>
     
    <para>
    CGI kurulumu seçtiyseniz, a&scedil;a&gbreve;&inodot;dakileri takip edin:
     <itemizedlist>
      <listitem>
       <simpara>
       Da&gbreve;&inodot;t&inodot;mla birlikte gelen <filename>pws-php4cgi.reg</filename>
       dosyas&inodot;n&inodot; düzenleyip php.exe nizin yerini kendi sisteminize göre de&gbreve;i&scedil;tirin.
       Bölü i&scedil;aretlerinden kaç&inodot;labilir, örne&gbreve;in:
       <literal>[HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\w3svc\parameters\Script Map] ".php"="c:\\php\\php.exe"</literal>
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       PWS yöneticisine gelin, PHP deste&gbreve;i eklemek istedi&gbreve;iniz klasörün üstüne sa&gbreve;
       t&inodot;klay&inodot;n, ve Özellikler'i seçin. 'Yürütme' (Execute) kutu&gbreve;unu i&scedil;aretleyin ve
       onaylay&inodot;n.
       </simpara>
      </listitem>
     </itemizedlist>
    </para>

    <para>
    ISAPI modülünü seçtiyseniz, a&scedil;a&gbreve;&inodot;dakileri uygulay&inodot;n:
     <itemizedlist>
      <listitem>
       <simpara>
       Da&gbreve;&inodot;t&inodot;mla birlikte gelen <filename>pws-php4cgi.reg</filename>
       dosyas&inodot;n&inodot; düzenleyip php4isapi.dll nizin yerini kendi sisteminize göre de&gbreve;i&scedil;tirin.
       Bölü i&scedil;aretlerinden kaç&inodot;lmal&inodot;d&inodot;r, örne&gbreve;in:
       <literal>[HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\w3svc\parameters\Script Map] ".php"="c:\\php\\sapi\\php4isapi.dll"</literal>
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       PWS yöneticisine gelin, PHP deste&gbreve;i eklemek istedi&gbreve;iniz klasörün üstüne sa&gbreve;
       t&inodot;klay&inodot;n, ve Özellikler'i seçin. 'Yürütme' (Execute) kutu&gbreve;unu i&scedil;aretleyin ve
       onaylay&inodot;n.
       </simpara>
      </listitem>
     </itemizedlist>
    </para>

   </sect2>

   <sect2 id="install.iis.iis4">
    <title>Windows NT/2000/XP ve IIS 4 ya da üstü</title>

    <simpara>
    PHP'yi IIS 4 ya da üstü çal&inodot;&scedil;an bir NT/2000/XP sunucuya kurmak için,
    a&scedil;a&gbreve;&inodot;daki komutlar&inodot; uygulay&inodot;n. PHP'yi kurmak için iki seçene&gbreve;iniz var,
    CGI (php.exe) ya da ISAPI modülü.
    </simpara>
    
    <simpara>
    Her iki &scedil;ekilde de, Microsoft Yönetim Konsolunu ba&scedil;latmal&inodot;s&inodot;n&inodot;z
    ('Internet Hizmet Yöneticisi' olarak da geçer). Daha sonra Web sunucu
    ba&gbreve;&inodot;na sa&gbreve; t&inodot;klay&inodot;n (büyük ihtimalle 'Öntan&inodot;ml&inodot; Web Sunucusu' olarak gözükecektir),
    ve 'Özellikler'i seçin.
    </simpara>

    <para>
    CGI kurulumu istiyorsan&inodot;z, a&scedil;a&gbreve;&inodot;dakileri uygulay&inodot;n:
     <itemizedlist>
      <listitem>
       <simpara>
       'Home Klasörü', 'Sanal Klasör' ya da 'Klasör' alt&inodot;nda, 'Ayarlar' tu&scedil;una t&inodot;klay&inodot;n
       ve Uygulama Haritalar&inodot; bölümüne girin.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       Ekle tu&scedil;una t&inodot;klay&inodot;n ve Çal&inodot;&scedil;t&inodot;r&inodot;labilir kutusuna:
       <literal>c:\php\php.exe</literal> (PHP'yi c:\php\ ye kurdu&gbreve;unuzu kabul
       edersek) yaz&inodot;n.
        </simpara>
      </listitem>
      <listitem>
       <simpara>
       Uzant&inodot;lar kutusunda, PHP uygulamalar&inodot; ile birlikte kullanmak istedi&gbreve;iniz
       dosya uzant&inodot;lar&inodot;n&inodot; yaz&inodot;n. 'Method exclusions' bölümünü bo&scedil; b&inodot;rak&inodot;n, ve
       Betik motoru kutucu&gbreve;unu seçili hale getirin. Ayn&inodot; zamanda 'dosyan&inodot;n varoldu&gbreve;undan
       emin ol' kutucu&gbreve;unu da i&scedil;aretleyebilirsiniz - ufak bir performans kayb&inodot;na kar&scedil;&inodot;l&inodot;k,
       IIS (ya da PWS) uygulama dosyas&inodot;n&inodot;n varl&inodot;&gbreve;&inodot;n&inodot; kontrol eder ve PHP'yi çal&inodot;&scedil;t&inodot;rmadan
       önce bir çe&scedil;it do&gbreve;rulama yapar. Bunun anlam&inodot;, kullan&inodot;c&inodot;ya PHP'nin hiçbir veri
       göndermedi&gbreve;inden yak&inodot;nan CGI hatas&inodot; yerine, anlaml&inodot; 404 stili hata mesajlar&inodot;n&inodot;n
       gösterilecek olmas&inodot;d&inodot;r.
       </simpara>
       <simpara>
       Kullanmak istedi&gbreve;iniz her dosya uzant&inodot;s&inodot; için önceki ad&inodot;m&inodot; ba&scedil;tan uygulamal&inodot;s&inodot;n&inodot;z.
        <literal>.php</literal> ve <literal>.phtml</literal>
        en s&inodot;k kullan&inodot;lan uzant&inodot;lard&inodot;r, öte yandan <literal>.php3</literal>
	baz&inodot; eski uygulamalar için gerekli olabilir.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       Güvenlik ayarlar&inodot;n&inodot; yap&inodot;n (Internet Hizmet Sunucusu üzerinden yap&inodot;l&inodot;r).
       NT sunucunuz NTFS dosya sistemini kullan&inodot;yorsa, <literal>php.exe</literal>
       dosyas&inodot;n&inodot;n bulundu&gbreve;u klasördeki  I_USR_ için çal&inodot;&scedil;t&inodot;rma iznini verin.
       </simpara>
      </listitem>
     </itemizedlist>
    </para>
    
    <para>
    ISAPI modülünü kullanmak için, a&scedil;a&gbreve;&inodot;dakileri yap&inodot;n:
     <itemizedlist>
      <listitem>
       <simpara>
       PHP ile HTTP Do&gbreve;rulamas&inodot; kullanmayacaksan&inodot;z, bu ad&inodot;m&inodot; atlayabilirsiniz
       (ve atlamal&inodot;s&inodot;n&inodot;z). ISAPI Süzgeçleri alt&inodot;ndan yeni bir ISAPI süzgeçi ekleyin.
       Süzgeç ismi olarak PHP verin, ve yol olarak php4isapi.dll dosyas&inodot;n&inodot;n bulundu&gbreve;u
       yolu girin.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       'Home Klasörü' bölümünden, 'Ayarlar' tu&scedil;una t&inodot;klay&inodot;n. Uygulama Haritalar&inodot;
       bölümüne yeni bir giri&scedil; yap&inodot;n. Çal&inodot;&scedil;t&inodot;r&inodot;labilir olarak php4isapi.dll için yolu belirtin,
       <literal>.php</literal> yi uzant&inodot; olarak belirtin, Method exclusions bölümünü
       bo&scedil; b&inodot;rak&inodot;n, ve Betik motoru kutucu&gbreve;unu seçili hale getirin.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       IIS'i kapat&inodot;n (NET STOP iisadmin)
       </simpara>
      </listitem>
      <listitem>
       <simpara>
       IIS'i tekrar ba&scedil;lat&inodot;n (NET START w3svc)
       </simpara>
      </listitem>
     </itemizedlist>
    </para>
   </sect2>
  </sect1>
  
  <sect1 id="install.netscape-enterprise">
   <title>Servers-Netscape and iPlanet</title>
   <para>
    This section contains notes and hints specific to Netscape and iPlanet
    installs of PHP, both for <link linkend="install.netscape.sun">Sun Solaris</link>
    and <link linkend="install.netscape.windows">Windows</link> versions.
   </para>
   <para>
    You can find more information about setting up PHP for
    the Netscape Enterprise Server here:
    <ulink url="&url.netscape.nsapi;">&url.netscape.nsapi;</ulink>
   </para>
   <sect2 id="install.netscape.sun">
    <title>Installing PHP with Netscape on Sun Solaris</title>
    <para>
     To build PHP with NES or iPlanet web servers, enter the proper
     install directory for the 
     <link linkend="install.configure.with-nsapi">--with-nsapi</link>
     = <replaceable>DIR</replaceable> option. The default
     directory is usually <filename class="directory">/opt/netscape/suitespot/</filename>.
     Please also read <filename>/php-xxx-version/sapi/nsapi/nsapi-readme.txt</filename>. 
    </para>
    <para>
     <example id="install.netscape-enterprise.solaris">
      <title>Installation Example for Netscape Enterprise on Solaris</title>
      <programlisting>
Instructions for Sun Solaris 2.6 with Netscape Enterprise Server 3.6
From: bhager@invacare.com

1. Install the following packages from www.sunfreeware.com or another
download site: 

    flex-2_5_4a-sol26-sparc-local 
    gcc-2_95_2-sol26-sparc-local 
    gzip-1.2.4-sol26-sparc-local 
    perl-5_005_03-sol26-sparc-local 
    bison-1_25-sol26-sparc-local 
    make-3_76_1-sol26-sparc-local 
    m4-1_4-sol26-sparc-local 
    autoconf-2.13 
    automake-1.4 
    mysql-3.23.24-beta (if you want mysql support) 
    tar-1.13 (GNU tar) 

2. Make sure your path includes the proper directories
    PATH=.:/usr/local/bin:/usr/sbin:/usr/bin:/usr/ccs/bin 
    export PATH 

3. gunzip php-x.x.x.tar.gz (if you have a .gz dist, otherwise go to 4) 
4. tar xvf php-x.x.x.tar 
5. cd ../php-x.x.x 

6. For the following step, make sure /opt/netscape/suitespot/ is where
   your netscape server is installed. Otherwise, change to correct path:
    /configure --with-mysql=/usr/local/mysql --with-nsapi=/opt/netscape/suitespot/ --enable-track-vars --enable-libgcc 
7. make 
8. make install
      </programlisting>
     </example>
     After performing the base install and reading the appropriate
     readme file, you may need to performs some additional
     configuration steps.
    </para>
    <para>
     Firstly you may need to add some paths to the LD_LIBRARY_PATH 
     environment for Netscape to find all the shared libs. This can 
     best done in the start script for your Netscape server. 
     Windows users can probably skip this step. The start 
     script is often located in:
     <filename
     class="directory">/path/to/server/https-servername/start</filename> 
    </para>
    <para>
     You may also need to edit the configuration files that are
     located in:<filename
     class="directory">/path/to/server/https-servername/config/</filename>.
    </para>

    <example id="install.netscape-enterprise.configure">
     <title>
      Configuration Example for Netscape Enterprise
     </title>
     <programlisting>
Configuration Instructions for Netscape Enterprise Server
From: bhager@invacare.com

1. Add the following line to mime.types:
    type=magnus-internal/x-httpd-php exts=php

2. Add the following to obj.conf, shlib will vary depending on
    your OS, for unix it will be something like
    /opt/netscape/suitespot/bin/libphp4.so.

    You should place the following lines after mime types init.
    Init fn="load-modules" funcs="php4_init,php4_close,php4_execute,php4_auth_trans" shlib="/php4/nsapiPHP4.dll"
    Init fn=php4_init errorString="Failed to initialize PHP!"

    &lt;object name="default"&gt;
    . 
    . 
    . 
    .#NOTE this next line should happen after all 'ObjectType' and before all 'AddLog' lines 
    Service fn="php4_execute" type="magnus-internal/x-httpd-php" 
    . 
    . 
    &lt;/Object&gt;


    &lt;Object name="x-httpd-php"&gt; 
    ObjectType fn="force-type" type="magnus-internal/x-httpd-php" 
    Service fn=php4_execute 
    &lt;/Object&gt; 


    Authentication configuration 

    PHP authentication cannot be used with any other authentication. ALL AUTHENTICATION IS 
    PASSED TO YOUR PHP SCRIPT. To configure PHP Authentication for the entire server, add 
    the following line: 

    &lt;Object name="default"&gt; 
    AuthTrans fn=php4_auth_trans 
    . 
    . 
    . 
    . 
    &lt;/Object&gt; 

    To use PHP Authentication on a single directory, add the following: 

    &lt;Object ppath="d:\path\to\authenticated\dir\*"&gt; 
    AuthTrans fn=php4_auth_trans 
    &lt;/Object&gt;
     </programlisting>
    </example>
    <para>
     If you are running Netscape Enterprise 4.x, then you should use the following:
    </para>
    <example>
     <title>Configuration Example for Netscape Enterprise 4.x</title>
     <programlisting>
Place these lines after the mime types init, and everything else is similar
to the example configuration above.
From: Graeme Hoose (GraemeHoose@BrightStation.com)

Init fn="load-modules" shlib="/path/to/server4/bin/libphp4.so" funcs="php4_init,php4_close,php4_execute,php4_auth_trans"
Init fn="php4_init" LateInit="yes"
     </programlisting>
    </example>
   </sect2>
   <sect2 id="install.netscape.windows">
    <title>Installing PHP with Netscape on Windows</title>
    <para>
      To Install PHP as CGI (for Netscape Enterprise Server,
      iPlanet, perhaps Fastrack), do the following:
    </para>
    <itemizedlist>
     <listitem>
      <simpara>
       Copy <filename>php4ts.dll</filename> to your systemroot
       (the directory where you installed windows)
      </simpara>
     </listitem>
     <listitem>
      <para>
       Make a file association from the command line.
       Type the following two lines:
       <programlisting>
assoc .php=PHPScript
ftype PHPScript=c:\php\php.exe %1 %*
       </programlisting>
      </para>
     </listitem>
     <listitem>
      <simpara>
       In the Netscape Enterprise Administration Server create
       a dummy shellcgi directory and remove it just after (this
       step creates 5 important lines in obj.conf and allow the
       web server to handle shellcgi scripts).
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       In the Netscape Enterprise Administration Server create
       a new mime type (Category: type,
       Content-Type: magnus-internal/shellcgi, File Suffix:php).
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       Do it for each web server instance you want php to run
      </simpara>
     </listitem>
    </itemizedlist>
    <para>
     More details about setting up
     PHP as a CGI executable can be found here:
     <ulink url="&url.netscape.cgi;">&url.netscape.cgi;</ulink>
    </para>
    <para>
     To Install PHP as NSAPI (for Netscape Enterprise Server,
     iPlanet, perhaps Fastrack, do the following:
    </para>
    <itemizedlist>
     <listitem>
      <simpara>
       Copy <filename>php4ts.dll</filename> to your systemroot
       (the directory where you installed windows)
      </simpara>
     </listitem>
     <listitem>
      <para>
       Make a file association from the command line.
       Type the following two lines:
       <programlisting>
assoc .php=PHPScript
ftype PHPScript=c:\php\php.exe %1 %*
       </programlisting>
      </para>
     </listitem>
     <listitem>
      <simpara>
       In the Netscape Enterprise Administration Server create
       a new mime type (Category: type,
       Content-Type: magnus-internal/x-httpd-php, File Suffix:php).
      </simpara>
     </listitem>
     <listitem>
      <para>
       Stop your web service and edit <filename>obj.conf</filename>.
       At the end of the Init section, place these two lines
       (necessarily after mime type init!):
       <programlisting>
Init fn="load-modules" funcs="php4_init,php4_close,php4_execute,php4_auth_trans" shlib="c:/php/sapi/php4nsapi.dll"
Init fn="php4_init" errorString="Failed to initialise PHP!"
       </programlisting>
      </para>
     </listitem>
     <listitem>
      <para>
       In The <literal>&lt; Object name="default" &gt;</literal>
       section, place this line necessarily after all 'ObjectType'
       and before all 'AddLog' lines:
       <programlisting>
Service fn="php4_execute" type="magnus-internal/x-httpd-php"
       </programlisting>
      </para>
     </listitem>
     <listitem>
      <para>
       At the end of the file, create a new object called
       <literal>x-httpd-php</literal>, by inserting these lines:
       <programlisting>
&lt;Object name="x-httpd-php"&gt;
ObjectType fn="force-type" type="magnus-internal/x-httpd-php"
Service fn=php4_execute
&lt;/Object&gt;
       </programlisting>
      </para>
     </listitem>
     <listitem>
      <simpara>
       Restart your web service and apply changes
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       Do it for each web server instance you want PHP to run
      </simpara>
     </listitem>
    </itemizedlist>
    <para>
     More details about setting up
     PHP as an NSAPI filter can be found here:
     <ulink url="&url.netscape.nsapi;">&url.netscape.nsapi;</ulink>
    </para>
   </sect2>
  </sect1>

  <sect1 id="install.omnihttpd">
   <title>Sunucular-OmniHTTPd Sunucusu</title>
   <para>
   Bölüm OmniHTTPd ile ilgili notlar ve ipuçlar&inodot; içermektedir.
   </para>
   <sect2 id="install.omnihttpd.windows">
    <title>Windows için OmniHTTPd 2.0b1 ve yukar&inodot;s&inodot;</title>
    
    <simpara>
    PHP'yi OmniHTTPd ile birlikte kullanabilmek için a&scedil;a&gbreve;&inodot;daki ad&inodot;mlar&inodot;
    tamamlaman&inodot;z gereklidir. Bu kurulum CGI kurulumudur. SAPI OmniHTTPd'yi
    destekliyor olsa da, baz&inodot; testler PHP'nin OmniHTTPd'de ISAPI modülü olarak
    kullan&inodot;lmas&inodot;n&inodot;n kararl&inodot; olmad&inodot;&gbreve;&inodot;n&inodot; göstermi&scedil;tir.
    </simpara>

    <para>
     <itemizedlist>
      <listitem>
       <para>
       Ad&inodot;m 1: OmniHTTPd'yi kurun.
       </para>
      </listitem>
      <listitem>
       <para>
       Ad&inodot;m 2: Sistem çubu&gbreve;undan mavi OmniHTTPd simgesine sa&gbreve; t&inodot;klay&inodot;n
       ve <literal>Properties</literal> seçene&gbreve;ini seçin.
       </para>
      </listitem>
      <listitem>
       <para>
       Ad&inodot;m 3: <literal>Web Server Global Settings</literal> seçene&gbreve;ine t&inodot;klay&inodot;n.
       </para>
      </listitem>
      <listitem>
       <para>
       Ad&inodot;m 4: 'External' seçe&gbreve;ine gelip, <literal>virtual = .php
         | actual = c:\path-to-php-dir\php.exe</literal> yaz&inodot;n ve Add tu&scedil;una bas&inodot;n.
       </para>
      </listitem>
      <listitem>
       <para>
       Ad&inodot;m 5: <literal>Mime</literal> bölümüne gelin, 
       <literal>virtual = wwwserver/stdcgi | actual = .php</literal>
       yaz&inodot;n ve Add tu&scedil;una bas&inodot;n.
       </para>
      </listitem>
      <listitem>
       <para>
       Ad&inodot;m 6: <literal>OK</literal> tu&scedil;una t&inodot;klay&inodot;n.
       </para>
      </listitem>
     </itemizedlist>
    </para>

    <simpara>
    2 - 6 ad&inodot;mlar&inodot; aras&inodot;n&inodot; PHP ile birlikte kullanmak istedi&gbreve;iniz her dosya uzant&inodot;s&inodot;
    için tekrarlay&inodot;n.
    </simpara>
    <note>
     <para>
     Baz&inodot; OmniHTTPd paketleri önyüklü PHP deste&gbreve;i ile birlikte gelmektedir.
     Kuruluma ba&scedil;larken custom setup seçene&gbreve;ini seçebilir ve PHP modülünün
     yüklenmemesini sa&gbreve;layabilirsiniz. Önerimiz en son PHP sürümünü kullanman&inodot;zd&inodot;r.
     Baz&inodot; OmniHTTPd sunucular&inodot; PHP'nin beta sürümleri ile birlikte da&gbreve;&inodot;t&inodot;lmaktad&inodot;r,
     bu nedenle önyüklü modülü ç&inodot;kart&inodot;p kendi kurulumunuzu yapman&inodot;z gereklidir.
     E&gbreve;er sunucu makinan&inodot;zda zaten yüklüyse, Ad&inodot;m 4 ve 5'te Replace tu&scedil;unu
     kullanarak yeni, do&gbreve;ru bilgi giri&scedil;ini yapabilirsiniz.
     </para>
    </note>
   </sect2>
  </sect1>

  <sect1 id="install.oreilly">
   <title>Servers-Oreilly Website Pro</title>
   <para>
    This section contains notes and hints specific to Oreilly
    Website Pro.
   </para>
   <sect2 id="install.oreilly.windows">
    <title>Oreilly Website Pro 2.5 and up for Windows</title>
    
    <simpara>
     This list describes how to set up the PHP CGI binary
     or the ISAPI module to work with Oreilly Website Pro
     on Windows.
    </simpara>

    <para>
     <itemizedlist>
      <listitem>
       <para>
        Edit the Server Properties and select the tab "Mapping".
       </para>
      </listitem>
      <listitem>
       <para>
        From the List select "Associations" and enter the desired
        extension (<literal>.php</literal>) and the path to the CGI exe
        (ex. <filename>c:\php\php.exe</filename>) or the ISAPI DLL file
        (ex. <filename>c:\php\sapi\php4isapi.dll</filename>).
       </para>
      </listitem>
      <listitem>
       <para>
        Select "Content Types" add the same extension
        (<literal>.php</literal>) and enter the content type.
        If you choose the CGI executable file, enter
        'wwwserver/shellcgi', if you chosse the ISAPI module,
        enter 'wwwserver/isapi' (both without quotes).
       </para>
      </listitem>
     </itemizedlist>
    </para>
   </sect2>
  </sect1>

  <sect1 id="install.xitami">
   <title>Sunucular-Xitami</title>
   <para>
   Bu bölüm Xitami için notlar ve ipuçlar&inodot;n&inodot; içerir.
   </para>
   <sect2 id="install.xitami.windows">
    <title>Windows için Xitami</title>
    
    <simpara>
    A&scedil;a&gbreve;&inodot;daki liste PHP'yi CGI olarak Windows alt&inodot;nda çal&inodot;&scedil;an Xitami'ye nas&inodot;l
    tan&inodot;tabilece&gbreve;inizi anlatmaktad&inodot;r.
    </simpara>

    <para>
     <itemizedlist>
      <listitem>
       <para>
       Web sunucunuzun çal&inodot;&scedil;&inodot;r durumda oldu&gbreve;undan ve taray&inodot;c&inodot;n&inodot;z&inodot;n Xitami yönetim
       konsolunu gösterdi&gbreve;inden 
       (genellikle <literal>http://127.0.0.1/admin</literal>) emin olun, ve 
       Configuration üzerine t&inodot;klay&inodot;n.
       </para>
      </listitem>
      <listitem>
       <para>
       Süzgeçler bölümüne girin, ve kullanmak istedi&gbreve;iniz dosya uzant&inodot;lar&inodot;n&inodot;
       (örn. .php) File extensions bölümüne girin (.xxx).
       </para>
      </listitem>
      <listitem>
       <para>
       Süzgeç bölümünde php çal&inodot;&scedil;t&inodot;r&inodot;labilirinizin yolunu ve ismini yaz&inodot;n.
       Örn: <literal>c:\php\php.exe</literal>.
       </para>
      </listitem>
      <listitem>
       <para>
       'Save' simgesine bas&inodot;n.
       </para>
      </listitem>
     </itemizedlist>
    </para>
   </sect2>
  </sect1>
  
  <sect1 id="install.otherhttpd">
   <title>Servers-Other web servers</title>
   <para>
    PHP can be built to support a large number of web servers. Please
    see <link linkend="install.configure.servers">Server-related
    options</link> for a full list of server-related configure
    options. The PHP CGI binaries are compatible with almost all
    webservers supporting the CGI standard.
   </para>
  </sect1>

  <sect1 id="install.problems">
   <title>Problemler?</title>

   <sect2>
    <title>SSS'yi okuyun</title>
    <simpara>
    Baz&inodot; problemlerle di&gbreve;erlerine göre daha s&inodot;k kar&scedil;&inodot;la&scedil;&inodot;lmaktad&inodot;r. En çok kar&scedil;&inodot;la&scedil;&inodot;lan
    problemler, <link linkend="faq">PHP SSS</link> bölümünde ele al&inodot;nm&inodot;&scedil;t&inodot;r.
    </simpara>
   </sect2>

   <sect2 id="install.otherproblems">
    <title>Di&gbreve;er problemler</title>

    <simpara>
    Sorununuza çözüm bulamad&inodot;ysan&inodot;z, PHP kurulum posta listesinden herhangi
    biri size yard&inodot;mc&inodot; olabilir. Öncelikle ar&scedil;ivi taray&inodot;n, muhtemelen sizinle ayn&inodot; sorunu
    ya&scedil;am&inodot;&scedil; birini ve ona gelen cevab&inodot; bulacaks&inodot;n&inodot;z. Ar&scedil;ivlere destek sayfas&inodot;ndaki 
    <ulink
     url="&url.php;">&url.php;</ulink> ba&gbreve;&inodot;ndan ula&scedil;&inodot;labilir. PHP kurulum
     posta listesine dahil olmak için, <ulink
     url="mailto:&email.php.install.subscribe;">&email.php.install.subscribe;</ulink>
     adresine bo&scedil; bir e-posta atman&inodot;z yeterlidir. Posta listesinin adresi
     <literal>&email.php.install;</literal> dir.
    </simpara>
    <simpara>
    Posta listesinden yard&inodot;m almak istiyorsan&inodot;z, lütfen sisteminizle ilgili gerekli bilgiyi
    de ekleyin ve sorunu tam olarak aç&inodot;klamaya çal&inodot;&scedil;&inodot;n. Sisteminizle ilgili bilgiler
    aras&inodot;nda hangi i&scedil;letim sistemini kulland&inodot;&gbreve;&inodot;n&inodot;z, hangi PHP sürümünde çal&inodot;&scedil;t&inodot;&gbreve;&inodot;n&inodot;z,
    hangi web sunucuya sahip oldu&gbreve;unuz, PHP'yi CGI m&inodot; sunucu modülü olarak m&inodot;
    kulland&inodot;&gbreve;&inodot;n&inodot;z hakk&inodot;nda bilgiler mutlaka olmal&inodot;d&inodot;r. Ayr&inodot;ca sorun ç&inodot;kan kodla
    ilgili yeterli kodu da iletmenizin di&gbreve;erlerinin hatay&inodot; bulabilmesine faydas&inodot; olacakt&inodot;r.
    </simpara>
   </sect2>

   <sect2 id="install.bugreports">
    <title>Hata raporlar&inodot;</title>
    <simpara>
    PHP'de bir hata buldu&gbreve;unuzu dü&scedil;ünüyorsan&inodot;z, lütfen bildirin. PHP geli&scedil;tiricileri
    muhtemelen hatadan habersizdirler, ve siz bildirmedikçe, sorunun giderilme
    ihtimali de az olacakt&inodot;r. Hatalar&inodot; <ulink
     url="&url.php.bugs;">&url.php.bugs;</ulink> adresindeki hata-takip
     sistemine bildirebilirsiniz. Lütfen hatalarla ilgili mesajlar&inodot;n&inodot;z&inodot; posta listesine
     ya da ki&scedil;isel e-posta hesaplar&inodot;na göndermeyin. Hata sistemi ayn&inodot; zamanda
     yeni özellik talepleri için de kullan&inodot;labilir.
    </simpara>
    <simpara>
    Lütfen bir hata bildirmeden önce<ulink 
     url="&url.php.bugs.howtoreport;">Hata nas&inodot;l bildirilir</ulink> 
     adresindeki doküman&inodot; okuyun!
    </simpara>
   </sect2>

  </sect1>

 </chapter>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
