<?xml version="1.0" encoding="iso-8859-9"?>
<!-- $Revision: 1.5 $ -->
 <chapter id="introduction">
  <title>Ba&scedil;lang&inodot;ç</title>

  <sect1 id="intro-whatis">
   <title>PHP nedir?</title>
   <para>
    <acronym>PHP</acronym> ("PHP: Hypertext
    Preprocessor" sözünün k&inodot;salt&inodot;lm&inodot;&scedil; hali) özellikle Web uygulamalar&inodot; geli&scedil;tirmek için
    tasarlanm&inodot;&scedil;, geni&scedil; bir kitle taraf&inodot;ndan kullan&inodot;lan genel amaçl&inodot; ve Aç&inodot;k Kodlu bir betik
    dilidir. PHP, HTML'in içine gömülebilir.
   </para>
   <para>
    Basit bir cevap, biraz daha aç&inodot;k olal&inodot;m. Bir örnek:
   </para>
   <para>
    <example>
     <title>Ba&scedil;lang&inodot;ç örne&gbreve;i</title>
     <programlisting role="php">
<![CDATA[
<html>
    <head>
        <title>Örnek</title>
    </head>
    <body>

        <?php 
        echo "Merhaba, Ben bir PHP beti&gbreve;iyim!"; 
        ?>

    </body>
</html>
]]>
     </programlisting>
    </example>
   </para>
   <para>
   Perl ya da C gibi ba&scedil;ka diller ile yaz&inodot;lm&inodot;&scedil; betiklerden ne kadar farkl&inodot; oldu&gbreve;una
   dikkat edin -- HTML ç&inodot;kt&inodot;s&inodot; üretmek için bir dolu komut yazmak yerine, bir parça
   gömülmü&scedil; kod içeren bir HTML beti&gbreve;i yaz&inodot;yorsunuz (bizim örne&gbreve;imizde yapt&inodot;&gbreve;&inodot; i&scedil; yaz&inodot;
   ç&inodot;kt&inodot;s&inodot; vermek). PHP kodu özel <link
    linkend="language.basic-syntax.phpmode">ba&scedil;lang&inodot;ç ve biti&scedil; etiketleri</link> içinde yer al&inodot;r.
    Bu etikler size "PHP modu"na girme ve ç&inodot;kma imkan&inodot; sa&gbreve;lar.
   </para>
   <para>
   PHP'yi JavaScript gibi istemci taraf&inodot;nda çal&inodot;&scedil;an yap&inodot;lardan ay&inodot;ran kodun sunucu
   taraf&inodot;nda çal&inodot;&scedil;&inodot;yor olmas&inodot;d&inodot;r. Sunucunuzda yukardaki kodun bir benzerini çal&inodot;&scedil;t&inodot;rd&inodot;&gbreve;&inodot;n&inodot;zda,
   istemci bu beti&gbreve;in olu&scedil;turdu&gbreve;u sonucu alacak ve arka tarafta çal&inodot;&scedil;an koddan haberdar
   olmayacakt&inodot;r. Dilerseniz web sunucunuzu bütün HTML dosyalar&inodot;n&inodot;z&inodot; PHP taraf&inodot;ndan i&scedil;lenecek
   &scedil;ekilde yap&inodot;land&inodot;rabilirsiniz.
   </para>
   <para>
   PHP'nin en üstün taraflar&inodot;ndan biri, yeni kullan&inodot;c&inodot;lar için çok basit olmas&inodot;n&inodot;n yan&inodot;nda,
   profesyonel programc&inodot;lar için de birçok ileri özellik içermesidir. PHP'nin uzun özellikler
   listesini okumaktan korkmay&inodot;n. Bu özelliklerin içine dalabilir, ve birkaç saat içinde, kendi
   ba&scedil;&inodot;n&inodot;za basit betikler geli&scedil;tirmeye ba&scedil;layabilirsiniz.
   </para>
   <para>
   PHP'nin geli&scedil;imi sunucu tarafl&inodot; uygulamalar üzerine odaklanm&inodot;&scedil;sa da, çok daha fazlas&inodot;n&inodot; yapma
   imkan&inodot;n&inodot;z var. <link linkend="intro-whatcando">PHP Neler Yapabilir?</link> bölümünde daha fazlas&inodot;n&inodot;
   okuyabilirsiniz.
   </para>
  </sect1>

  <sect1 id="intro-whatcando">
   <title>PHP Neler Yapabilir?</title>
   <para>
   Her &scedil;eyi. PHP temelde sunucu tarafl&inodot; uygulama geli&scedil;tirmeye odaklanm&inodot;&scedil;t&inodot;r, bu sebeple di&gbreve;er
   bütün CGI uygulamalar&inodot;n&inodot;n yapt&inodot;klar&inodot;n&inodot; yapabilirsiniz. Form datalar&inodot;n&inodot; toplamak, dinamik sayfa
   içeri&gbreve;i olu&scedil;turmak ya da çerez al&inodot;p göndermek bunlardan birkaç&inodot;. Ancak PHP çok daha fazlas&inodot;n&inodot;
   yapabilecek kapasiteye sahip.
   </para>
   <para>
   PHP betiklerinin kullan&inodot;ld&inodot;&gbreve;&inodot; temel üç alan mevcuttur.
    <itemizedlist>
     <listitem>
      <simpara>
      Sunucu tarafl&inodot; uygulama geli&scedil;tirme. Bu PHP'nin en geleneksel ve en temel hedef alan&inodot;d&inodot;r.
      Bu i&scedil; için üç &scedil;eye ihtiyac&inodot;n&inodot;z var. PHP okuyucusu (CGI ya da sunucu modülü), bir web sunucusu
      ve bir web taray&inodot;c&inodot;s&inodot;. Web sunucusunu, kendisine ba&gbreve;lanm&inodot;&scedil; bir PHP kurulumu ile çal&inodot;&scedil;t&inodot;rman&inodot;z
      gereklidir. PHP program&inodot;n&inodot;n ç&inodot;kt&inodot;s&inodot;na web taray&inodot;c&inodot;s&inodot; ile eri&scedil;ebilirsiniz ve PHP sayfas&inodot;n&inodot;
      sunucu üzerinden görüntülemi&scedil; olursunuz. Kurulum hakk&inodot;nda daha fazla bilgi almak için
      <link linkend="installation">kurulum talimatlar&inodot;</link> bölümünden faydalanabilirsiniz.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
      Komut sat&inodot;r&inodot; uygulamalar&inodot;. Bir PHP beti&gbreve;ini herhangi bir sunucu ya da taray&inodot;c&inodot; olmadan
      çal&inodot;&scedil;t&inodot;rabilirsiniz. Bunun için yaln&inodot;zca PHP okuyucusuna ihtiyac&inodot;n&inodot;z olacak. Bu tip kullan&inodot;m
      cron (*nix ya da Linux türevleri) ya da Görev Zamanlay&inodot;c&inodot;s&inodot; (Windows) uygulamalar&inodot; ile birlikte
      çal&inodot;&scedil;t&inodot;rmak için idealdir. Bu betikler ayn&inodot; zamanda basit metin tarama görevleri için de
      kullan&inodot;labilir. <link linkend="features.commandline">PHP'nin komut sat&inodot;r&inodot;nda kullan&inodot;m&inodot;</link> bölümünde
      konu ile ilgili daha detayl&inodot; bilgi bulabilirsiniz.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
      &Idot;stemci taraf&inodot;nda çal&inodot;&scedil;an GUI (Grafik arabirim) tabanl&inodot; uygulamalar geli&scedil;tirme. PHP pencere
      alt&inodot;nda çal&inodot;&scedil;an uygulamalar geli&scedil;tirmek için mükemmel bir seçim olmayabilir, ancak PHP'ye
      hakimseniz ve PHP'nin baz&inodot; ileri seviye özelliklerini kendi istemci taraf&inodot;nda çal&inodot;&scedil;an uygulamalar&inodot;n&inodot;zda
      kullanmak istiyorsan&inodot;z, PHP-GTK'dan faydalanabilirsiniz. Bu yolla ayn&inodot; zamanda platformdan
      ba&gbreve;&inodot;ms&inodot;z uygulama geli&scedil;tirme imkan&inodot;n&inodot; da yakalam&inodot;&scedil; olacaks&inodot;n&inodot;z. PHP-GTK, PHP'nin bir eklentisidir
      ve ana da&gbreve;&inodot;t&inodot;mda yer almamaktad&inodot;r. PHP-GTK ilginizi çektiyse, <ulink url="&url.php.gtk;">kendi
       web sitesini</ulink> ziyaret edebilirsiniz.
      </simpara>
     </listitem>
    </itemizedlist>
   </para>
   <para>
   PHP bütün büyük i&scedil;letim sistemlerinde kullan&inodot;labilir, bunlara 
    Linux, birçok Unix türevi (HP-UX, Solaris ve OpenBSD dahil),
    Microsoft Windows, Mac OS X, RISC OS, ve daha birço&gbreve;u dahildir.
    PHP ayn&inodot; zamanda bugünkü web sunucular&inodot;n&inodot;n büyük k&inodot;sm&inodot;n&inodot; desteklemektedir. Bunlara örnek olarak
    Apache, Microsoft Internet Information Server, Personal Web Server, Netscape and iPlanet servers, Oreilly
    Website Pro server, Caudium, Xitami, OmniHTTPd, ve birçok ba&scedil;ka sunucu örnek verilebilir.
    Sunucular&inodot;n büyük ço&gbreve;unlu&gbreve;unda PHP modül olarak bulunur, CGI standard&inodot;n&inodot; destekleyen di&gbreve;erlerinde ise
    PHP CGI i&scedil;lemcisi olarak çal&inodot;&scedil;abilir.
   </para>
   <para>
   Sonuç olarak, PHP ile i&scedil;letim sisteminizi ve web sunucunuzu seçme özgürlü&gbreve;üne sahipsiniz. Buna ek
   olarak, prosedürel programlama ya da nesneye yönelik programlama yöntemlerinden birini seçebilir
   ya da her ikisinin kar&inodot;&scedil;&inodot;m&inodot;n&inodot; kullanabilirsiniz. PHP'nin mevcut sürümü OOP'nin bütün standartlar&inodot;n&inodot;
   içermiyor olsa da, birçok kod kütüphanesi ve büyük uygulamalar (buna PEAR kütüphanesi dahil) yaln&inodot;zca
   OOP kodu kullanarak yaz&inodot;lm&inodot;&scedil;t&inodot;r.
   </para>
   <para>
   PHP ile yaln&inodot;zca HTML ç&inodot;kt&inodot;s&inodot; üretmekle s&inodot;n&inodot;rl&inodot; de&gbreve;ilsiniz. PHP'nin imkanlar&inodot; resim ç&inodot;kt&inodot;s&inodot; verme,
   PDF dosyas&inodot; yaratma ve hatta Flash filmleri (libswf ve Ming kullanarak) olu&scedil;turmaya kadar
   geni&scedil;ler. XHTML ya da XML tabanl&inodot; herhangi bir metin dosyas&inodot;n&inodot; kolayca sunabilirsiniz. PHP bu tür
   dosyalar&inodot; otomatik olarak olu&scedil;turabilir ve dosya sisteminde saklayabilir, bu &scedil;ekilde dinamik
   içeri&gbreve;iniz için bir önbellek olu&scedil;turabilirsiniz.
   </para>
   <para>
   PHP'nin en güçlü ve dikkate de&gbreve;er özelliklerden biri sahip oldu&gbreve;u geni&scedil; veritaban&inodot; deste&gbreve;idir.
   Veritaban&inodot; ile etkile&scedil;imli çal&inodot;&scedil;an bir web sayfas&inodot; yaratmak inan&inodot;lmaz derecede kolayd&inodot;r. &Scedil;u anda
   desteklenen veritabanlar&inodot;:
    <blockquote>
     <simplelist columns="3">
      <member>Adabas D</member>
      <member>dBase</member>
      <member>Empress</member>
      <member>FilePro (salt-okunur)</member>
      <member>Hyperwave</member>
      <member>IBM DB2</member>
      <member>Informix</member>
      <member>Ingres</member>
      <member>InterBase</member>
      <member>FrontBase</member>
      <member>mSQL</member>
      <member>Direct MS-SQL</member>
      <member>MySQL</member>
      <member>ODBC</member>
      <member>Oracle (OCI7 ve OCI8)</member>
      <member>Ovrimos</member>
      <member>PostgreSQL</member>
      <member>Solid</member>
      <member>Sybase</member>
      <member>Velocis</member>
      <member>Unix dbm</member>
     </simplelist>
    </blockquote>
    Bunlar&inodot;n haricinde DBX veritaban&inodot; soyutlama eklentisi ad&inodot; verilen
    modül ile bu eklenti taraf&inodot;ndan desteklenen tüm veritabanlar&inodot;na &scedil;effaf
    eri&scedil;im sa&gbreve;layabilirsiniz. Ek olarak PHP ODBC'yi, Aç&inodot;k Veritaban&inodot; Ba&gbreve;lant&inodot; Standard&inodot;'n&inodot; destekler,
    böylece bu dünya standard&inodot;n&inodot; destekleyen tüm veritabanlar&inodot; ile ba&gbreve;lant&inodot; kurabilirsiniz.
   </para>
   <para>
   PHP, LDAP, IMAP, SNMP, NNTP, POP3, HTTP, COM (Windows platformunda) ve daha birçok protokolü
   kullanarak di&gbreve;er hizmetler ile konu&scedil;abilir. Dilerseniz ham a&gbreve; soketleri yaratabilir ve istedi&gbreve;iniz
   ba&scedil;ka herhangi bir protokol ile etkile&scedil;ime geçebilirsiniz. PHP, WDDX karma&scedil;&inodot;k veri de&gbreve;i&scedil;imi protokolünü
   destekler, bu &scedil;ekilde di&gbreve;er bütün Web uygulama dilleri ile ileti&scedil;im kurabilir. Kar&scedil;&inodot;l&inodot;kl&inodot; ba&gbreve;lant&inodot;
   sözkonusu ise, PHP Java nesnelerinin ilklendirilebilmesini ve &scedil;effaf olarak PHP nesneleri olarak kullan&inodot;labilmelerini
   destekler. &Idot;sterseniz kendi CORBA eklentinizi kullanarak uzaktaki nesnelere eri&scedil;im sa&gbreve;layabilirsiniz.
   </para>
   <para>
   PHP, POSIX Geni&scedil;letilmi&scedil; ya da Perl Regular Expression'dan XML belgelerinin ayr&inodot;&scedil;t&inodot;r&inodot;lmas&inodot;na kadar
   çe&scedil;itli metin i&scedil;leme özelliklerine sahiptir. XML dosyalar&inodot;n&inodot;n ayr&inodot;&scedil;t&inodot;r&inodot;lmas&inodot; ve eri&scedil;imi için,
   SAX ve DOM standartlar&inodot;n&inodot; destekler. XSLT eklentisini kullanarak, XML belgelerini dönü&scedil;türebilirsiniz.
   </para>
   <para>
   PHP'nin elektronik ticaret alan&inodot;nda kullan&inodot;m&inodot;nda, Cybercash, CyberMUT, VeriSign Payflow Pro ve CCVS
   için faydal&inodot; fonksiyonlar bulabilir ve online ödeme uygulamalar&inodot;n&inodot;zda kullanabilirsiniz.
   </para>
   <para>
   Bütün bunlar&inodot;n haricinda, mnoGoSearch arama motoru, IRC Gateway, çe&scedil;itli s&inodot;k&inodot;&scedil;t&inodot;rma araçlar&inodot; (gzip, bz2),
   takvim çevirici vb. de&gbreve;i&scedil;ik ihtiyaçlara hitap eden birçok ilginç eklenti de mevcuttur.
   </para>
   <para>
    Gördü&gbreve;ünüz gibi bu sayfa PHP'nin sundu&gbreve;u bütün özellikleri ve faydalar&inodot; listelemek için yeterli de&gbreve;il.
    <link linkend="installation">PHP kurulumu</link> ve <link linkend="funcref">fonksiyon bilgisi</link>
    bölümlerinde burada bahsetti&gbreve;imiz eklentileri ve daha fazlas&inodot;n&inodot; bulabilirsiniz.
   </para>
  </sect1>

 </chapter>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
