<?xml version="1.0" encoding="iso-8859-9"?>
<!-- $Revision: 1.3 $ -->
<chapter id="features.connection-handling">
 <!-- dirge: handling => i&scedil;leme -->
 <title>Ba&gbreve;lant&inodot; &Idot;&scedil;leme</title>

 <note>
  <para>Burada yazanlar 3.0.7 ve sonras&inodot; sürümler için geçerlidir.</para>
 </note>

 <para>
  PHP'nin içinde ba&gbreve;lant&inodot; durumu saklan&inodot;r. Olas&inodot; durumlar 3 tanedir:
  <itemizedlist>
   <listitem><simpara>0 - NORMAL (normal)</simpara></listitem>
   <listitem><simpara>1 - ABORTED (iptal edilmi&scedil;)</simpara></listitem>
   <listitem><simpara>2 - TIMEOUT (zaman a&scedil;&inodot;m&inodot;na u&gbreve;ram&inodot;&scedil;)</simpara></listitem>
  </itemizedlist>
 </para>

 <simpara>
  PHP beti&gbreve;i normal olarak çal&inodot;&scedil;&inodot;rken NORMAL durumu aktiftir. E&gbreve;er al&inodot;c&inodot;
  taraf ba&gbreve;lant&inodot;y&inodot; keserse ABORTED durum anahtar&inodot; aktifle&scedil;tirilir. Al&inodot;c&inodot;
  taraf&inodot;n ba&gbreve;lant&inodot;y&inodot; kesmesi genellikle uzaktaki kullan&inodot;c&inodot;n&inodot;n STOP dü&gbreve;mesine
  basmas&inodot;ndan kaynaklan&inodot;r. E&gbreve;er PHP'ye bildirilen zaman s&inodot;n&inodot;r&inodot;na (bkz.
  <function>set_time_limit</function>) ula&scedil;&inodot;l&inodot;rsa, TIMOUT durum anahtar&inodot;
  aktifle&scedil;tirilir.
 </simpara>

 <simpara>
  <!-- dirge: return => döndürmek -->
  <!-- dirge: directive => direktif -->
  Al&inodot;c&inodot;n&inodot;n ba&gbreve;lant&inodot;y&inodot; kesmesi durumunda PHP beti&gbreve;inin çal&inodot;&scedil;mas&inodot;n&inodot;n durdurulup
  durdurulmayaca&gbreve;&inodot;n&inodot; seçebilirsiniz. Baz&inodot; durumlarda kar&scedil;&inodot; taraftaki internet
  gezgini yollad&inodot;&gbreve;&inodot;n&inodot;z ç&inodot;kt&inodot;y&inodot; alm&inodot;yor olsa bile PHP beti&gbreve;inin normal olarak
  sonlanmas&inodot; kullan&inodot;&scedil;l&inodot; olabilir. Ancak PHP'nin öntan&inodot;ml&inodot; davran&inodot;&scedil;&inodot; kar&scedil;&inodot;
  taraftaki internet gezgini ba&gbreve;lant&inodot;y&inodot; kesti&gbreve;inde beti&gbreve;i sonland&inodot;rmakt&inodot;r.
  Bu davran&inodot;&scedil; ignore_user_abort php.ini direktifiyle ayarlanabilece&gbreve;i gibi
  bunun Apache .conf kar&scedil;&inodot;l&inodot;&gbreve;&inodot; olan php3_ignore_user_abort direktifiyle veya
  <function>ignore_user_abort</function> fonksiyonuyla da ayarlanabilir. Tek
  istisna <function>register_shutdown_function</function> fonksiyonu ile
  bir kapan&inodot;&scedil; fonksiyonu tan&inodot;mlaman&inodot;zd&inodot;r. Tan&inodot;ml&inodot; bir kapan&inodot;&scedil; fonkiyonu
  varken, beti&gbreve;iniz ç&inodot;kt&inodot; yollamaya çal&inodot;&scedil;t&inodot;&gbreve;&inodot;nda PHP al&inodot;c&inodot;n&inodot;n STOP dü&gbreve;mesine
  bast&inodot;&gbreve;&inodot;n&inodot; alg&inodot;layacak ve tan&inodot;mlad&inodot;&gbreve;&inodot;n&inodot;z fonksiyonu ça&gbreve;&inodot;racakt&inodot;r. Bu kapan&inodot;&scedil;
  fonksiyonu ayr&inodot;ca beti&gbreve;iniz normal olarak sonland&inodot;&gbreve;&inodot;nda da ça&gbreve;r&inodot;laca&gbreve;&inodot;
  için, sadece ba&gbreve;lant&inodot;n&inodot;n kesilmesi durumunda yap&inodot;lmas&inodot;n&inodot; istedi&gbreve;iniz i&scedil;ler
  varsa <function>connection_aborted</function> fonksiyonunu
  kullanabilirsiniz. Bu fonksiyon e&gbreve;er ba&gbreve;lant&inodot; kesilmi&scedil;se &true; de&gbreve;erini
  döndürecektir.
 </simpara>

 <simpara>
  Beti&gbreve;iniz ayr&inodot;ca yerle&scedil;ik betik süre-ölçeri taraf&inodot;ndan da
  sonland&inodot;r&inodot;labilir. Öntan&inodot;ml&inodot; zaman 30 saniyedir. Bu de&gbreve;er
  max_execution_time php.ini direktifi veya bunun Apache .conf kar&scedil;&inodot;l&inodot;&gbreve;&inodot; olan
  php3_max_execution_time direktifi ile ayarlanabilece&gbreve;i gibi
  <function>set_time_limit</function> fonksiyonuyla da ayarlanabilir.
  Belirlenen azami sürenin dolmas&inodot; durumunda betik sonland&inodot;r&inodot;lacak, ve
  yukar&inodot;daki ba&gbreve;lant&inodot; kesilmesi durumunda oldu&gbreve;u gibi, varsa, tan&inodot;mlanm&inodot;&scedil;
  kapan&inodot;&scedil; fonksiyonu ça&gbreve;r&inodot;lacakt&inodot;r. Bu kapan&inodot;&scedil; fonksiyonunun içinde,
  ça&gbreve;r&inodot;lmas&inodot;n&inodot;n sebebinin süre dolmas&inodot; olup olmad&inodot;&gbreve;&inodot;n&inodot; ö&gbreve;renmek isterseniz
  <function>connection_timeout</function> fonksiyonunu kullanabilirsiniz. Bu
  fonksiyon sürenin dolmu&scedil; olmas&inodot; durumunda &true; de&gbreve;erini döndürecektir.
 </simpara>

 <simpara>
  Dikkat edilmesi gereken bir nokta hem ABORTED hem de TIMEOUT durumlar&inodot;n&inodot;n
  ayn&inodot; anda aktif olabilece&gbreve;idir. Bu, PHP'ye kar&scedil;&inodot; taraf&inodot;n ba&gbreve;lant&inodot;y&inodot;
  sonland&inodot;rmas&inodot;n&inodot; gözard&inodot; etmesini söylerseniz mümkün olur. PHP'nin
  ba&gbreve;lant&inodot;n&inodot;n kapand&inodot;&gbreve;&inodot;n&inodot; anlamas&inodot;na ra&gbreve;men betik çal&inodot;&scedil;maya devam edecektir.
  Süre s&inodot;n&inodot;r&inodot; a&scedil;&inodot;ld&inodot;&gbreve;&inodot;nda betik sonland&inodot;r&inodot;l&inodot;r ve, varsa, kapan&inodot;&scedil; fonksiyonu
  ça&gbreve;r&inodot;l&inodot;r. Bu noktada <function>connection_timeout</function> ve
  <function>connection_aborted</function> fonksiyonlar&inodot; &true; de&gbreve;erini
  döndürür. &Idot;ki durumu ayn&inodot; anda <function>connection_status</function>
  fonksiyonu ile kontrol edebilirsiniz. Bu fonksiyon aktif durumlar&inodot; içeren
  bit alan&inodot;n&inodot; döndürür. Örne&gbreve;in, iki durum da aktifse geriye dönü&scedil; de&gbreve;eri
  olarak 3'ü verecektir.
 </simpara>
</chapter>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
